{
  "general_info": {
    "meta": {
      "id": "general_info",
      "name": "General Information - معلومات عامة"
    },
    "rows": [
      {
        "id": "pi_01",
        "name": "اسم المشروع - Project Name",
        "value": "مشروع تصميم وتشغيل نظام مركز الاتصال والتذاكر"
      },
      {
        "id": "pi_02",
        "name": "الجهة المالكة - Owner",
        "value": "أحمد قنصوة"
      },
      {
        "id": "pi_03",
        "name": "مدير المشروع - Manager",
        "value": "أحمد خالد"
      },
      {
        "id": "pi_04",
        "name": "محلل المشروع - Analyst",
        "value": "غير محدد"
      },
      {
        "id": "pi_05",
        "name": "معد التقرير - Author",
        "value": "أحمد خالد"
      },
      {
        "id": "pi_06",
        "name": "معتمد التقرير - Approver",
        "value": "أحمد خالد"
      },
      {
        "id": "pi_07",
        "name": "تاريخ البداية - Start Date",
        "value": "غير محدد"
      },
      {
        "id": "pi_08",
        "name": "تاريخ الانتهاء - End Date",
        "value": "غير محدد"
      },
      {
        "id": "pi_09",
        "name": "مدة المشروع - Duration",
        "value": "غير محدد"
      }
    ]
  },
  "revision_history": {
    "meta": {
      "id": "revision_history",
      "name": "Revision History - إدارة الإصدارات"
    },
    "rows": [
      {
        "id": "rev_01",
        "version": "0.1",
        "status": "مسودة",
        "author": "أحمد خالد",
        "date": "2025-05-25"
      }
    ]
  },
  "index": {
    "meta": {
      "id": "index",
      "name": "Index - الفهرس"
    },
    "rows": [
      {
        "id": "1",
        "name": "Glossary - جدول المصطلحات",
        "page": 4
      },
      {
        "id": "2",
        "name": "Introduction - مقدمة",
        "page": 5
      },
      {
        "id": "3",
        "name": "Importance - أهمية المشروع",
        "page": 5
      },
      {
        "id": "4",
        "name": "Goals - أهداف المشروع",
        "page": 5
      },
      {
        "id": "5",
        "name": "Scope - نطاق المشروع والمخرجات المتوقعة",
        "page": 5
      },
      {
        "id": "6",
        "name": "Out of Scope - خارج نطاق المشروع",
        "page": 6
      },
      {
        "id": "7",
        "name": "Assumptions and Constraints - الافتراضات والقيود",
        "page": 6
      },
      {
        "id": "8",
        "name": "Dependency and Integration - علاقة المشروع مع الأنظمة الأخرى",
        "page": 7
      },
      {
        "id": "9",
        "name": "Current State - الوضع الحالي والحلول السابقة (الملخص التنفيذي)",
        "page": 7
      },
      {
        "id": "10",
        "name": "System Diagram - الرسم البياني لوضعية عمل النظام",
        "page": 8
      },
      {
        "id": "11",
        "name": "Actors - مستخدمي النظام وخصائصهم",
        "page": 9
      },
      {
        "id": "12",
        "name": "Function Requirements - متطلبات الوظيفة",
        "page": 10
      },
      {
        "id": "13",
        "name": "Use Cases - حالات الاستخدام",
        "page": 11
      },
      {
        "id": "14",
        "name": "Conclusion - الخاتمة",
        "page": 18
      }
    ]
  },
  "glossary": {
    "meta": {
      "id": "glossary",
      "name": "Glossary - جدول المصطلحات"
    },
    "terms": [
      {
        "id": "1",
        "term": "إدارة التذاكر - Ticket Management",
        "definition": "نظام لتنظيم وتتبع التذاكر الخاصة بطلبات العملاء ومشاكلهم."
      },
      {
        "id": "2",
        "term": "نظام الرد الصوتي التفاعلي IVR - IVR System",
        "definition": "نظام للتفاعل الصوتي مع العملاء عبر الهاتف لتوجيه المكالمات وإنشاء التذاكر."
      },
      {
        "id": "3",
        "term": "تكامل النظام - System Integration",
        "definition": "ربط الأنظمة المختلفة لتحقيق التشغيل الأوتوماتيكي وتحسين الكفاءة."
      },
      {
        "id": "4",
        "term": "المزامنة الثنائية الاتجاه - Bi-directional Synchronization",
        "definition": "نقل البيانات في كلا الاتجاهين بين الأنظمة لضمان تحديثها بشكل متزامن."
      },
      {
        "id": "5",
        "term": "إدارة المستخدم - User Management",
        "definition": "إجراءات لإضافة المستخدمين وتعيين الصلاحيات لهم وفقًا لأدوارهم."
      },
      {
        "id": "6",
        "term": "الاستيفاء - Escalation",
        "definition": "عملية رفع مستوى التذاكر أو الطلبات إلى إدارة أعلى عند الضرورة."
      },
      {
        "id": "7",
        "term": "لوحات المعلومات - Dashboards",
        "definition": "أدوات لعرض الأداء والمؤشرات الحيوية للإدارة."
      },
      {
        "id": "8",
        "term": "التدريب - Training",
        "definition": "توفير البرامج التعليمية للموظفين لاستخدام النظام بكفاءة."
      },
      {
        "id": "9",
        "term": "اتصال متعدد القنوات - Multi-channel Communication",
        "definition": "دعم التفاعل مع العملاء عبر عدة وسائط مثل الهاتف والبريد الإلكتروني والدردشة."
      },
      {
        "id": "10",
        "term": "إدارة الاتصال - Communication Management",
        "definition": "الإشراف على جميع أشكال التواصل مع العملاء لضمان الجودة والفعالية."
      }
    ]
  },
  "introduction": {
    "meta": {
      "id": "introduction",
      "name": "Introduction - المقدمة"
    },
    "paragraphs": "يتمحور هذا المشروع حول تطوير نظام مركز اتصال متكامل يتصل بنظام إدارة التذاكر لشركة الجزيرة كابيتال. الهدف الرئيسي هو تلبية احتياجات العملاء بسرعة وكفاءة عن طريق دمج عمليات خدمة العملاء مع إدارة التذاكر، مما يخلق تجربة سلسة عبر القنوات الإلكترونية والهاتفية. يعتمد المشروع على الخبرات الواسعة لمزود الحلول الرقمية المعنية، ويستند إلى أفضل الممارسات في السوق وتحليل البيانات التاريخية لخدمة العملاء. يحدد هذا المشروع نطاق العمل، تدفقات الخدمة وآليات التصعيد الأساسية لتحسين مؤشرات الأداء وضمان تحقيق الأهداف الاستراتيجية للمؤسسة. الرؤية لهذا المشروع هي تحسين تجربة العملاء بشكل جذري من خلال توفير أدوات مبتكرة تعزز العمليات التشغيلية وتعطي الأولوية للاحتياجات الفردية لكل عميل. تعد السرعة والكفاءة في معالجة طلبات الخدمة من الأهداف الأساسية لهذا المشروع، مع التركيز على تقديم دعم متكامل عبر جميع قنوات الخدمة. سيوفر النظام لوحات معلومات أداء للإدارة لمراقبة جودة الخدمة وتحسين العمليات بشكل مستمر لضمان تطابق المخرجات مع الأهداف الاستراتيجية. سيتضمن النظام آليات لضمان الامتثال والحوكمة من خلال توثيق شامل لجميع التذاكر والإجراءات ذات الصلة مما يعزز من الالتزام بمعايير الجودة والشفافية. يتميز نظام إدارة التذاكر بتخصيص تدفقات العمل وتحديد قواعد التوجيه والتصعيد لتحقيق الكفاءة في حل المشاكل وخدمة العملاء بشكل مبتكر. سيتم تصميم واجهات المستخدم لتتسم بالمرونة، وتدعم الإشعارات التلقائية عبر البريد الإلكتروني أو الرسائل القصيرة، مما يعزز من خدمة العملاء الاستباقية. ستتولى إدارة المهام المستخدمين بما في ذلك التعيين وإلغاء التعيين والتعديل، مما يتيح بيئة عمل أكثر تنظيماً وكفاءة. سيتيح النظام للأعضاء المعنيين عرض تفاصيل التذاكر بشكل شامل مع إمكانيات بحث متقدمة لضمان معالجة فعالة وموجهة لكل حالة. من خلال التكامل مع نظام IVR، سيتمكن النظام من التعرف على هوية المتصل وإنشاء تذاكر جديدة مرفقة ببيانات العملاء المسجلة مسبقًا. سيقوم النظام بتسجيل تفاصيل المكالمة في نظام التذاكر مع تحديد نوع المكالمة والقسم والأولوية، مما يساهم في تخصيص الخدمة بشكل أكثر دقة. سيوفر التكامل مع قاعدة بيانات العملاء مزامنة فعالة وذو اتجاهين لبيانات العملاء بين القاعدة ونظام التذاكر. سيكون هناك إمكانية عرض سجل العميل بالكامل من بدء التذكرة حتى إغلاقها، مما يسهل متابعة العملية كاملة وتحسين رضا العملاء. "
  },
  "importance": {
    "meta": {
      "id": "importance",
      "name": "Importance - أهمية المشروع"
    },
    "points": [
      "يضمن تحسين الكفاءة التشغيلية من خلال تكامل مركز الاتصال مع نظام إدارة التذاكر.",
      "يساعد في تقليص زمن الاستجابة ومعالجة طلبات الخدمة بسرعة أكبر.",
      "يوفر لوحة تحكم للأداء تُمكن الإدارة من متابعة جودة الخدمة وتحسين العمليات بشكل مستمر.",
      "يساهم في تحقيق الامتثال والحوكمة من خلال توثيق جميع التذاكر والإجراءات المرتبطة بها بدقة.",
      "يسمح بمزامنة ثنائية الاتجاه لبيانات العملاء مما يضمن الوصول الفوري إلى كافة معلومات العملاء.",
      "يعزز من تجربة العملاء بتحسين آليات التواصل وتعدد قنوات الاتصال المتاحة.",
      "يمكن من تقليص الأخطاء البشرية عبر أتمتة الإشعارات وعمليات تخصيص التذاكر.",
      "يوفر تقارير مخصصة تمكن من تحليل نسبة إرضاء العملاء وحجم المكالمات وأداء الموظفين.",
      "يساعد على تحسين الإجراءات الداخلية من خلال إدارة دقيقة لمهام المستخدمين وارتباطهم بالأقسام المناسبة.",
      "يعزز التفاعل مع العملاء بفضل التكامل مع منصات مثل WhatsApp والمحادثات الرقمية والبريد الإلكتروني."
    ]
  },
  "goals": {
    "meta": {
      "id": "goals",
      "name": "Goals - أهداف المشروع"
    },
    "points": [
      "إنشاء مركز اتصال متكامل يربط بين إدارة خدمة العملاء وإدارة التذاكر عبر جميع القنوات خلال 6 أشهر.",
      "تسريع أوقات الاستجابة وتقليل متوسط وقت معالجة الطلبات إلى أقل من 3 دقائق.",
      "تقديم لوحة معلومات أداء للإدارة خلال الربع الأول لتحسين جودة الخدمة.",
      "توفير نظام وثائق شامل لكل التذاكر والإجراءات المتبعة لتحقيق الامتثال بنسبة 100٪.",
      "دمج منصة IVR بنظام التذاكر لتمكين خدمة العملاء بشكل تلقائي خلال أول شهرين.",
      "تحقيق نسبة دقة 95٪ في التعرف على هوية المتصل وإنشاء التذاكر الجديدة.",
      "تمكين تحديث ثنائي الاتجاه لبيانات العملاء بين قاعدة البيانات ونظام التذاكر.",
      "إضافة 100 مستخدم جديد للنظام وتوزيعهم على الأقسام المناسبة خلال 3 أشهر.",
      "دعم قنوات الاتصال المتعددة بما في ذلك المكالمات والدردشة خلال أول 4 أشهر.",
      "إعداد تقارير شهرية عن توزيع أنواع المشاكل ونسب إغلاق التذاكر وكفاءة الأداء الوظيفي للموظفين."
    ]
  },
  "scope": {
    "meta": {
      "id": "scope",
      "name": "Scope - نطاق المشروع"
    },
    "included": [
  {
    "title": "ربط مركز الاتصال بنظام إدارة التذاكر عبر كافة قنوات الخدمة.",
    "describtion": [
      "يشمل المكالمات الهاتفية والبريد الإلكتروني والدردشة.",
      "يوفّر تجربة سلسة بين العميل وخدمة الدعم."
    ]
  },
  {
    "title": "تسريع أوقات الاستجابة وتحسين معالجة طلبات الخدمة.",
    "describtion": [
      "تقليل زمن الانتظار للعميل.",
      "تسريع إغلاق التذاكر ذات الأولوية.",
      "تحسين كفاءة موظفي الدعم."
    ]
  },
  {
    "title": "تزويد لوحة قياس الأداء للمديرين لمراقبة جودة الخدمة وتحسين العمليات.",
    "describtion": [
      "عرض مؤشرات الأداء الرئيسية (KPIs).",
      "تقديم إحصائيات عن معدلات الاستجابة والإغلاق.",
      "تحليل رضا العملاء بشكل دوري."
    ]
  },
  {
    "title": "دمج المعلومات الثنائية للمستخدمين بين النظام القاعدي ونظام التذاكر.",
    "describtion": [
      "مزامنة بيانات العميل بشكل فوري.",
      "تحديث تلقائي لملفات العملاء في كلا النظامين.",
      "تقليل الأخطاء الناتجة عن إدخال البيانات اليدوي."
    ]
  },
  {
    "title": "إدارة مهام المستخدمين بما في ذلك التعيين والإلغاء والتعديل.",
    "describtion": [
      "توزيع المهام على الموظفين المناسبين.",
      "إلغاء أو تعديل التعيين حسب الحاجة.",
      "تحسين مرونة سير العمل."
    ]
  },
  {
    "title": "إدماج النظام الصوتي الآلي (IVR) مع نظام التذاكر لخدمة العملاء الفعالة.",
    "describtion": [
      "توجيه المكالمات تلقائياً حسب القسم المناسب.",
      "تسهيل فتح التذاكر مباشرة من خلال IVR.",
      "تقليل العبء على موظفي الاستقبال."
    ]
  },
  {
    "title": "التعرف على هوية المتصل لفتح تذاكر جديدة تحتوي على بيانات العميل.",
    "describtion": [
      "مطابقة رقم الهاتف مع قاعدة بيانات العملاء.",
      "إرفاق بيانات العميل بالتذكرة مباشرة.",
      "تحسين سرعة ودقة الخدمة المقدمة."
    ]
  },
  {
    "title": "التخزين الآمن لحسابات المستخدمين وتفاصيل الأذونات لمراجعة الامتثال والحكم.",
    "describtion": [
      "تشفير بيانات الحسابات.",
      "تحديد صلاحيات الوصول لكل مستخدم.",
      "إجراء مراجعات دورية للأذونات."
    ]
  },
  {
    "title": "دعم الاتصال عبر قنوات متعددة مثل المكالمات والدردشة الرقمية والبريد الإلكتروني.",
    "describtion": [
      "توحيد جميع القنوات في منصة واحدة.",
      "إتاحة التواصل من أي قناة يفضلها العميل.",
      "تحقيق تجربة مستخدم متكاملة."
    ]
  },
  {
    "title": "تحضير وتصدير التقارير التي تركز على توزيع نوع المشاكل ومعدلات إغلاق التذاكر وأداء الموظفين.",
    "describtion": [
      "توليد تقارير يومية وأسبوعية وشهرية.",
      "تحليل كفاءة الفرق المختلفة.",
      "دعم اتخاذ القرارات الاستراتيجية المبنية على البيانات."
    ]
  }
],
    "diagrams": [
      {
        "name": "",
        "url": "",
        "description": "Context Diagram showing System integrating Contact Center, Ticket Management, Customer Database, and IVR."
      }
    ]
  },
  "out_of_scope": {
    "meta": {
      "id": "out_of_scope",
      "name": "Out of Scope - خارج نطاق المشروع"
    },
    "excluded": [
      "إدارة البنية التحتية أو تطوير الوحدات الخارجية.",
      "تقديم خدمة الدعم الفني المباشر عبر الهاتف.",
      "إغلاق التذاكر بواسطة غير الوكلاء المخصصين."
    ]
  },
  "assumptions_constraints": {
    "meta": {
      "id": "assumptions_constraints",
      "name": "Assumptions & Constraints - الافتراضات والقيود"
    },
    "assumptions": [
      "الموظفين سيتم تدريبهم بالشكل الكافي لاستخدام الأنظمة المطورة حديثاً.",
      "النظام سيعمل حصرياً مع البنية التحتية للشبكة الحالية المقدمة من قبل أقسام الجزيره كابيتال.",
      "سيتم تنفيذ النظام بما يتماشى مع أفضل الممارسات في السوق.",
      "سيتم توفير واجهة مستخدم مخصصة لجميع الأنواع المحددة من المستخدمين.",
      "سيمكن من إدارة مهام المستخدمين وإجراء التعديلات بشكل فعال.",
      "ستكون البيانات متاحة لعرض سجل العميل الكامل من الإنشاء إلى الإغلاق.",
      "سيكون هناك تزامن باتجاهين بين بيانات العملاء في قاعدة البيانات ونظام التذاكر.",
      "ستكون هناك إمكانيات للإبلاغ عن رضا العملاء وحجم المكالمات وأداء الموظفين.",
      "سيمكن للمديرين والمشرفين عرض تقارير الأداء بناءً على أذوناتهم.",
      "سيكون النظام قادراً على التعامل مع التواصل ثنائي الاتجاه."
    ],
    "constraints": [
      "المشروع يغطي فقط تطوير وتشغيل مركز الاتصال وأنظمة التذاكر والارتباط بينها.",
      "النظام متصل فقط بالبنية التحتية القائمة دون تضمين العناصر الخارجية.",
      "فقط وكلاء الاتصال المعينين يمكنهم إغلاق التذاكر لضمان الاتساق والمساءلة.",
      "يجب أن يتم الامتثال لجميع القوانين واللوائح المتعلقة بالحوكمة والامتثال.",
      "يجب أن تظل بيانات العميل خاصة وآمنة مع التقيد بلوائح الخصوصية المنطبقة.",
      "سيكون هناك عدة امتيازات وفوائد متاحة فقط للمستخدمين المعينين.",
      "جميع الإشعارات الإلكترونية تعتمد على البنية التحتية للاتصالات الحالية.",
      "النظام يجب أن يضمن التزام الموظفين بالوقت والمواعيد النهائية المحددة للعملاء.",
      "سيتم تحديد مسارات العمل مع قواعد التوجيه والتصعيد مسبقًا لضمان الفعالية.",
      "النظام يغطي فقط عمليات التواصل المتعددة القنوات مثل المكالمات وواتساب والبريد الإلكتروني."
    ]
  },
  "current_state": {
    "meta": {
      "id": "current_state",
      "name": "Current State - الوضع الحالي"
    },
    "points": "تواجه المؤسسة عدداً من التحديات الجوهرية في إدارة مراكز الاتصال وخدمات العملاء. من أبرز هذه التحديات عدم التكامل بين مراكز الاتصال ونظام إدارة التذاكر، مما يؤدي إلى تكرار الجهود وصعوبة متابعة الطلبات عبر مختلف القنوات. كما أن معالجة الطلبات تستغرق وقتاً طويلاً بسبب الاعتماد على العمليات اليدوية، وهو ما يقلل من كفاءة الاستجابة ويؤثر سلباً على رضا العملاء. يضاف إلى ذلك غياب نظام الإفصاح عن الأداء الفوري للإدارة، حيث لا تتوفر مؤشرات مباشرة لمراقبة جودة الخدمة أو تقييم أداء الموظفين في الوقت الحقيقي. ومن المشكلات أيضاً عدم توفر خاصية المزامنة المباشرة لبيانات العملاء بين الأنظمة المختلفة، الأمر الذي يؤدي إلى تضارب أو نقص في المعلومات المتاحة لموظفي الدعم. كما أن التقارير الإدارية تُعَد بشكل يدوي وتتطلب جهداً كبيراً، مما يبطئ عملية اتخاذ القرار ويزيد من احتمال وقوع الأخطاء. بالإضافة إلى ذلك، هناك غياب لقواعد تصعيد فعّالة للمشكلات العالقة، وهو ما يترتب عليه تأخر في معالجة القضايا المعقدة أو الحساسة. كما أن بيانات العملاء غير محدثة بشكل مستمر بين قنوات الخدمة المختلفة، مما يضعف دقة المعلومات ويؤثر على جودة الخدمة المقدمة. كذلك يلاحظ انعدام نظام لربط تعريف المتصل ببيانات العميل بشكل تلقائي، مما يستهلك وقتاً إضافياً في التعرف على المتصل وتوثيق بياناته. أما على مستوى الإدارة الداخلية، فإن إدارة الصلاحيات والمهام تتم بشكل غير منهجي، مما قد يؤدي إلى تضارب في المسؤوليات أو ضعف في الحوكمة. وأخيراً، فإن التواصل عبر القنوات المختلفة يتم بشكل منفصل وغير موحد، وهو ما يخلق تجربة مجزأة للعميل ويضعف التكامل بين المكالمات الهاتفية، البريد الإلكتروني، والدردشات الرقمية."
  },
  "actors": {
    "meta": {
      "id": "actors",
      "name": "Actors - الأطراف المشاركة"
    },
    "rows": [
  {
    "id": "1",
    "role": "وكيل الاتصال",
    "description": "يتعامل مباشرة مع العملاء عبر المكالمات الهاتفية، الدردشة الرقمية أو البريد الإلكتروني. يقوم بإنشاء التذاكر الجديدة، تحديث حالتها بشكل دوري، وتقديم حلول فورية إذا أمكن. يوجه الطلبات إلى الأقسام المناسبة وفقاً لقواعد التصعيد."
  },
  {
    "id": "2",
    "role": "المشرف",
    "description": "يراقب أداء وكلاء الاتصال بشكل يومي، ويتأكد من التزامهم بمعايير الجودة وخطط الاستجابة. يقوم بحل التذاكر العالقة، وتقديم الدعم الفني والإداري للوكلاء، بالإضافة إلى متابعة الأهداف الشهرية للفريق."
  },
  {
    "id": "3",
    "role": "مسؤول النظام",
    "description": "يدير صلاحيات وأذونات المستخدمين، ويشرف على تكوين النظام والتكامل مع الأنظمة الخارجية. يتابع تحديثات النظام الأمنية ويضمن جاهزيته العالية. يتعامل مع إعدادات قنوات الاتصال مثل المكالمات، البريد الإلكتروني، والدردشة."
  },
  {
    "id": "4",
    "role": "مدير",
    "description": "يركز على متابعة الأداء الكلي لمركز الاتصال، ويعتمد على تقارير ولوحات معلومات الأداء لاتخاذ قرارات استراتيجية. يعمل على تحسين العمليات، زيادة كفاءة الموارد البشرية، وضمان توافق العمليات مع الأهداف المؤسسية."
  },
  {
    "id": "5",
    "role": "نظام الـ IVR",
    "description": "يقوم بالرد الآلي على المكالمات الواردة والتعرف على هوية المتصل تلقائياً باستخدام البيانات المسجلة مسبقاً. يوجه العملاء عبر قوائم صوتية ذكية، ينشئ تذاكر جديدة عند الحاجة، ويحول المكالمات إلى الوكلاء أو الأقسام المناسبة. يقلل الضغط على الوكلاء من خلال الرد على الأسئلة الشائعة وتسجيل تفاصيل المكالمات بشكل فوري."
  },
  {
    "id": "6",
    "role": "عميل",
    "description": "المستفيد النهائي من الخدمة، يقوم بالاتصال للاستفسار، طلب الدعم أو متابعة حالة التذكرة. يمكنه استخدام قنوات متعددة مثل الهاتف، البريد الإلكتروني، أو الدردشة للوصول إلى الخدمة. يتوقع استجابة سريعة وخدمة ذات جودة عالية."
  },
  {
    "id": "7",
    "role": "محلل الأداء",
    "description": "مسؤول عن تحليل البيانات الناتجة من نظام إدارة التذاكر ولوحات الأداء. يحدد الاتجاهات والمشكلات المتكررة، ويقدم توصيات لتحسين جودة الخدمة. يساعد الإدارة في اتخاذ قرارات مبنية على البيانات."
  },
  {
    "id": "8",
    "role": "فريق الدعم الفني",
    "description": "يتعامل مع التذاكر التقنية المعقدة التي تتجاوز قدرات وكلاء الاتصال. يقوم بتقديم حلول جذرية للمشكلات التقنية، والتأكد من توافق النظام مع متطلبات البنية التحتية، ودعم التكامل مع الأنظمة الأخرى."
  },
  {
    "id": "9",
    "role": "مسؤول الأمان",
    "description": "مسؤول عن مراقبة أنشطة المستخدمين وضمان حماية بيانات العملاء. يقوم بتطبيق سياسات الامتثال، مراجعة الأذونات بشكل دوري، والتأكد من التزام النظام بمعايير الأمان المحلية والدولية."
  },
  {
    "id": "10",
    "role": "مسؤول التقارير",
    "description": "يعمل على إعداد وتصدير تقارير مفصلة حول أداء مركز الاتصال، توزيع أنواع القضايا، معدلات إغلاق التذاكر، ومستوى رضا العملاء. يساعد الإدارة العليا على رؤية شاملة للعمليات اليومية واتخاذ قرارات استراتيجية مبنية على الأدلة."
  }
],
    "diagrams": [
      {
        "name": "مخطط حالة استخدام لإنشاء وإدارة التذاكر",
"description":"",
        "url": "https://brd-qi0f.onrender.com/static/37b4c01fd70a40c4bc0074cf04a8d76c.svg"
      },
      {
        "name": "مخطط حالة استخدام لتكامل نظام IVR",
"description":"",
        "url": ""
      },
      {
        "name": "مخطط حالة استخدام لتزامن قاعدة بيانات العملاء",
"description":"",
        "url": "https://brd-qi0f.onrender.com/static/ff68a00e375c4db79a2f5d7ca60dc20a.svg"
      },
      {
        "name": "مخطط حالة استخدام لإدارة المستخدمين",
"description":"",
        "url": "https://brd-qi0f.onrender.com/static/1ce2743a943a46b3ba0b19d3915ba7ad.svg"
      },
      {
        "name": "مخطط حالة استخدام لإعداد تقارير الأداء",
"description":"",
        "url": "https://brd-qi0f.onrender.com/static/e77e8653c79943629e3612f0a5788835.svg"
      }
    ]
  },
  "dependency_and_integration": {
    "meta": {
      "id": "dependency_and_integration",
      "name": "Dependencies & Integrations - التبعيات والتكامل"
    },
    "description": "النظام يعتمد على قاعدة بيانات خارجية للعملاء، ويتطلب تكاملاً مع نظام ال-IVR، وخدمة الرسائل القصيرة، ونظام إدارة المستخدمين، وخدمة التقارير الخارجية.",
    "diagrams": [
      {
        "name": "مخطط المكونات للتكامل",
"description":"",
        "url": "https://brd-qi0f.onrender.com/static/208aa5ac5be94084ae004a49ca05bdff.svg"
      },
      {
        "name": "مخطط النشر للخدمات",
"description":"",
        "url": "https://brd-qi0f.onrender.com/static/ddfbb7115c4d4fd9a3f9adf700a96f0d.svg"
      }
    ]
  },
  "architecture": {
    "meta": {
      "id": "architecture",
      "name": "Architecture - هيكلية النظام"
    },
    "diagrams": [
      {
        "name": "تدفق إدارة التذاكر",
"description":"",
        "url": "https://brd-qi0f.onrender.com/static/17a754ad95ae45b49a40337d3edbcb7f.svg"
      },
      {
        "name": "تكامل IVR ونظام التذاكر",
"description":"",
        "url": "https://brd-qi0f.onrender.com/static/4c44a3579c224776bcc202a15573e718.svg"
      },
      {
        "name": "تزامن قاعدة بيانات العملاء",
"description":"",
        "url": "https://brd-qi0f.onrender.com/static/24f35e42498d4c3ba56c24e7dcc4929a.svg"
      },
      {
        "name": "إدارة المستخدمين",
"description":"",
        "url": "https://brd-qi0f.onrender.com/static/2cd002ee5c1d4032a0604a6e5ec014de.svg"
      },
      {
        "name": "إدارة قنوات الاتصال",
"description":"",
        "url": "https://brd-qi0f.onrender.com/static/d40cbed4cd8f4e20851c50198385d0ef.svg"
      },
      {
        "name": "لوحة الأداء والتقارير",
"description":"",
        "url": "https://brd-qi0f.onrender.com/static/dd9772d0ebfd47af86605eb46ab92e62.svg"
      },
      {
        "name": "تدفق التصعيد",
"description":"",
        "url": ""
      },
      {
        "name": "التعامل مع المكالمات المتعددة",
"description":"",
        "url": "https://brd-qi0f.onrender.com/static/0b2cde715cac433c862f6ca97ba06a0e.svg"
      },
      {
        "name": "نظام إدارة المهام للمستخدم",
"description":"",
        "url": "https://brd-qi0f.onrender.com/static/e83f8caf839248259624351e575a5c94.svg"
      },
      {
        "name": "إعداد التقارير المخصصة",
"description":"",
        "url": "https://brd-qi0f.onrender.com/static/33ba23ce6e8249c7a654053db0ec9aef.svg"
      }
    ]
  },
  "functional_requirements": {
    "meta": {
      "id": "functional_requirements",
      "name": "Functional Requirements - المتطلبات الوظيفية"
    },
    "items": [
  {
    "id": "fr_01",
    "title": "إدارة التذاكر",
    "description": "يجب على النظام أن يدعم إدارة التذاكر من خلال تصميم تدفقات العمل، وتحديد قواعد التوجيه والتصعيد. يساعد هذا في ضمان معالجة جميع الطلبات بكفاءة ويتماشى مع أهداف الأداء الخاصة بالمؤسسة.",
    "priority": "عالي",
    "acceptance_criteria": [
      "يمكن لمدير النظام إنشاء وتعديل قواعد التوجيه للتذاكر.",
      "يجب إرسال إشعارات آلية عند تلبية شروط تصعيد محددة.",
      "يجب أن يوفر النظام واجهة مستخدم تساعد على تعديل البيانات بسهولة.",
      "يجب تسجيل جميع عمليات إدارة التذاكر لأغراض المراجعة.",
      "يتم توفير خيارات للبحث في تفاصيل التذكرة بشكل كامل."
    ],
    "diagrams": [
      {
        "name": "مخطط النشاط لإدارة التذاكر",
        "description": "",
        "url": "https://brd-qi0f.onrender.com/static/85cbe63241f541a68b35db17767c58a3.svg"
      }
    ]
  },
  {
    "id": "fr_02",
    "title": "تكامل نظام الرد الصوتي IVR مع نظام التذاكر",
    "description": "يجب أن يتمكن النظام من التكامل بين منصة IVR ونظام التذاكر للوصول السريع إلى بيانات العميل وإنشاء تذاكر جديدة تلقائيًا بناءً على المكالمة.",
    "priority": "عالي",
    "acceptance_criteria": [
      "يجب التعرف على معرف المتصل إذا كان مسجلاً في قاعدة بيانات العملاء.",
      "يمكن لنظام IVR إنشاء تذكرة جديدة تلقائيًا باستخدام بيانات التعرف الخاصة بالعميل.",
      "يجب تسجيل تفاصيل المكالمة في نظام التذاكر مع تحديد النوع والقسم والأولوية.",
      "يتم تعيين الأولوية للعملاء بناءً على حالتهم في قاعدة بيانات الجزيرة كابيتال.",
      "يجب أن يكون هناك اتصال ثنائي الاتجاه بين منصة IVR ونظام التذاكر للمعلومات المحدثة."
    ],
    "diagrams": [
      {
        "name": "مخطط التسلسل لتكامل نظام IVR",
        "description": "",
        "url": "https://brd-qi0f.onrender.com/static/b90ef36a371e4e198b4ae7a1de0084de.svg"
      }
    ]
  },
  {
    "id": "fr_03",
    "title": "تزامن قاعدة بيانات العملاء",
    "description": "يجب على النظام أن يدعم تزامن البيانات ثنائياً بين قاعدة بيانات العملاء ونظام التذاكر لضمان أن البيانات دقيقة ومحدثة.",
    "priority": "عالي",
    "acceptance_criteria": [
      "يجب أن يشمل التزامن جميع البيانات الشخصية والسجلات التاريخية للعملاء.",
      "يجب أن تعرض التذاكر جميع مراحل المعالجة من البداية إلى النهاية.",
      "يجب توفير إمكانية إنشاء تقارير مخصصة تعرض رضى العملاء وحجم المكالمات وأداء الموظفين.",
      "يجب أن تحدث عمليات المزامنة تلقائيًا عند تغيير البيانات في أي من النظامين.",
      "يجب تسجيل جميع حالات التزامن لأغراض تتبع الأخطاء."
    ],
    "diagrams": [
      {
        "name": "مخطط النشاط لتزامن قاعدة البيانات",
        "description": "",
        "url": "https://brd-qi0f.onrender.com/static/7b442e5a62d4458ebac168aa49a466eb.svg"
      }
    ]
  },
  {
    "id": "fr_04",
    "title": "إدارة المستخدمين",
    "description": "النظام يجب أن يدعم إضافة مستخدمين جدد وتحديد أذوناتهم بدقة تبعًا لأدوارهم، وربط المستخدمين بالأقسام المناسبة لضمان تدفق العمل بشكل سلس.",
    "priority": "عالي",
    "acceptance_criteria": [
      "يمكن لمدير النظام إضافة مستخدمين جدد بسهولة.",
      "يجب أن تتيح واجهة المستخدم تحديد الأذونات بدقة.",
      "يجب أن يتم تخزين بيانات الحساب للمستخدمين بأمان.",
      "يمكن ربط المستخدمين بالوحدات التنظيمية المناسبة.",
      "يجب على النظام أن يحتفظ بسجل لجميع التغييرات التي تطرأ على أذونات الدخول."
    ],
    "diagrams": [
      {
        "name": "مخطط دراسي لإدارة المستخدمين",
        "description": "",
        "url": "https://brd-qi0f.onrender.com/static/5a43b75bcab4495a94f4ac8a8d43932c.svg"
      }
    ]
  },
  {
    "id": "fr_05",
    "title": "إدارة الاتصال",
    "description": "يجب على النظام دعم الاتصال متعدد القنوات، وتضمين وظائف مثل التعامل مع المكالمات المتزامنة والتواصل الثنائي الاتجاه عبر مختلف وسائل الاتصال.",
    "priority": "متوسط",
    "acceptance_criteria": [
      "يجب أن يدعم النظام الاتصالات عبر المكالمات، وWhatsApp، والدردشات الرقمية، والايميل.",
      "يجب أن يكون النظام قادرًا على التعامل مع مكالمات متزامنة بشكل فعال.",
      "يجب أن يوفر النظام أدوات للدمج بين القنوات المختلفة لخلق تجربة متسقة للمستخدم.",
      "يجب تسجيل جميع الاتصالات لأغراض التحليل والمراجعة.",
      "يجب أن يدعم النظام تضمين الرسائل الآلية للرد الفوري."
    ],
    "diagrams": [
      {
        "name": "مخطط النشاط لإدارة الاتصال",
        "description": "",
        "url": "https://brd-qi0f.onrender.com/static/f6775b1cba6541909b80fda96dff6ad9.svg"
      }
    ]
  },
  {
    "id": "fr_06",
    "title": "إشعارات البريد الإلكتروني",
    "description": "يجب على النظام أن يرسل إشعارات بريد إلكتروني آلية عند تغيير حالة التذكرة أو إضافة تعليق جديد لتبقي العميل والوكيل على اطلاع دائم.",
    "priority": "عالي",
    "acceptance_criteria": [
      "يتم إرسال بريد إلكتروني لكل تحديث على التذكرة.",
      "يمكن تخصيص محتوى الرسائل ليتوافق مع سياسة المؤسسة.",
      "يمكن تعطيل أو تمكين الإشعارات من خلال إعدادات النظام.",
      "يجب أن تحتوي الرسائل على تفاصيل دقيقة حول حالة التذكرة.",
      "يجب أن تدعم الرسائل لغات متعددة حسب العميل."
    ],
    "diagrams": [
      {
        "name": "مخطط تسلسل إشعارات البريد الإلكتروني",
        "description": "",
        "url": ""
      }
    ]
  },
  {
    "id": "fr_07",
    "title": "إدارة المهام",
    "description": "يجب أن يوفر النظام آلية لإدارة المهام الموزعة بين الوكلاء بما يشمل التعيين، إعادة التعيين، والتعديل لضمان عدالة توزيع العمل.",
    "priority": "متوسط",
    "acceptance_criteria": [
      "يمكن تعيين المهام إلى وكلاء محددين.",
      "يمكن إعادة التعيين في حال غياب الوكيل.",
      "يجب تسجيل جميع تغييرات التعيين في سجل النظام.",
      "يمكن للوكلاء الاطلاع على مهامهم في لوحة تحكم خاصة.",
      "يجب أن يدعم النظام إشعارات فورية عند تعيين مهمة جديدة."
    ],
    "diagrams": [
      {
        "name": "مخطط النشاط لإدارة المهام",
        "description": "",
        "url": ""
      }
    ]
  },
  {
    "id": "fr_08",
    "title": "البحث المتقدم في التذاكر",
    "description": "يجب أن يدعم النظام وظيفة البحث المتقدم التي تسمح بالبحث باستخدام معايير متعددة مثل العميل، الحالة، القسم، والأولوية.",
    "priority": "متوسط",
    "acceptance_criteria": [
      "يمكن البحث باستخدام اسم العميل أو رقم التذكرة.",
      "يمكن تصفية النتائج حسب الحالة أو القسم.",
      "يمكن البحث باستخدام نطاقات زمنية محددة.",
      "يجب أن يعرض النظام النتائج في وقت قصير.",
      "يمكن حفظ استعلامات البحث المتكررة للاستخدام المستقبلي."
    ],
    "diagrams": [
      {
        "name": "مخطط تسلسل البحث المتقدم",
        "description": "",
        "url": ""
      }
    ]
  },
  {
    "id": "fr_09",
    "title": "التقارير الإدارية",
    "description": "يجب أن يدعم النظام إنشاء تقارير إدارية دورية ومخصصة حول حجم الطلبات، سرعة الاستجابة، معدل الإغلاق، ورضا العملاء.",
    "priority": "عالي",
    "acceptance_criteria": [
      "يمكن للمدير إنشاء تقارير حسب الفترات الزمنية.",
      "يجب أن تتضمن التقارير رسوم بيانية ولوحات إحصائية.",
      "يمكن تصدير التقارير إلى ملفات PDF أو Excel.",
      "يجب أن تدعم التقارير جدولة التوليد التلقائي.",
      "يمكن مشاركة التقارير عبر البريد الإلكتروني."
    ],
    "diagrams": [
      {
        "name": "مخطط النشاط لإعداد التقارير",
        "description": "",
        "url": ""
      }
    ]
  },
  {
    "id": "fr_10",
    "title": "التكامل مع قواعد البيانات الخارجية",
    "description": "يجب أن يدعم النظام التكامل مع قواعد بيانات خارجية للحصول على بيانات العملاء أو تحديثها بما يعزز من دقة المعلومات المتاحة.",
    "priority": "عالي",
    "acceptance_criteria": [
      "يجب أن يكون التكامل عبر واجهات API آمنة.",
      "يجب أن يدعم النظام المزامنة في كلا الاتجاهين.",
      "يمكن تعيين جداول زمنية لعمليات المزامنة.",
      "يجب أن يسجل النظام جميع عمليات التكامل.",
      "يمكن التعامل مع أخطاء التكامل عبر تنبيهات فورية."
    ],
    "diagrams": [
      {
        "name": "مخطط تسلسل التكامل مع قواعد البيانات",
        "description": "",
        "url": ""
      }
    ]
  },
  {
    "id": "fr_11",
    "title": "دعم اللغات المتعددة",
    "description": "يجب أن يدعم النظام واجهات مستخدم متعددة اللغات مع إمكانية التبديل بسهولة لتلبية احتياجات العملاء المتنوعين.",
    "priority": "متوسط",
    "acceptance_criteria": [
      "يمكن للمستخدم اختيار اللغة من قائمة الإعدادات.",
      "تتوفر الترجمات لجميع عناصر الواجهة.",
      "يجب أن تكون الترجمة دقيقة وسليمة لغوياً.",
      "يمكن تبديل اللغة دون التأثير على البيانات.",
      "يجب أن تدعم تقارير النظام لغات متعددة."
    ],
    "diagrams": [
      {
        "name": "مخطط واجهة دعم اللغات",
        "description": "",
        "url": ""
      }
    ]
  },
  {
    "id": "fr_12",
    "title": "إدارة الصلاحيات",
    "description": "يجب أن يتيح النظام تخصيص الصلاحيات للمستخدمين بدقة وفقاً لدور كل مستخدم أو قسم.",
    "priority": "عالي",
    "acceptance_criteria": [
      "يمكن تعيين الصلاحيات بشكل فردي أو جماعي.",
      "يجب أن يسجل النظام أي تغيير في الصلاحيات.",
      "يمكن للإدارة مراجعة الصلاحيات بشكل دوري.",
      "يمكن تعليق أو إلغاء صلاحيات المستخدمين عند الحاجة.",
      "يجب أن يدعم النظام نماذج أمان متعددة."
    ],
    "diagrams": [
      {
        "name": "مخطط الصلاحيات",
        "description": "",
        "url": ""
      }
    ]
  },
  {
    "id": "fr_13",
    "title": "إدارة المكالمات",
    "description": "يجب أن يسجل النظام جميع المكالمات الواردة والصادرة ويربطها بالتذاكر لتتبع الاتصالات بشكل كامل.",
    "priority": "عالي",
    "acceptance_criteria": [
      "يجب تسجيل وقت وتاريخ المكالمة.",
      "يجب ربط المكالمة بالتذكرة تلقائياً.",
      "يمكن تشغيل التسجيلات عند الحاجة.",
      "يجب أن يتم حفظ التسجيلات بشكل آمن.",
      "يمكن تصنيف المكالمات حسب النوع أو القسم."
    ],
    "diagrams": [
      {
        "name": "مخطط النشاط لإدارة المكالمات",
        "description": "",
        "url": ""
      }
    ]
  },
  {
    "id": "fr_14",
    "title": "إدارة الشكاوى",
    "description": "يجب أن يدعم النظام تسجيل شكاوى العملاء بشكل منفصل عن الطلبات العادية مع توفير آليات لتصعيدها بسرعة.",
    "priority": "عالي",
    "acceptance_criteria": [
      "يمكن للوكلاء تمييز التذكرة كشكوى.",
      "يجب أن يرسل النظام إشعاراً فورياً للمشرف.",
      "يجب أن تكون هناك إجراءات تصعيد مخصصة للشكاوى.",
      "يمكن للمدير مراجعة تقارير خاصة بالشكاوى.",
      "يجب أن يسجل النظام مراحل معالجة الشكوى كاملة."
    ],
    "diagrams": [
      {
        "name": "مخطط تسلسل إدارة الشكاوى",
        "description": "",
        "url": ""
      }
    ]
  },
  {
    "id": "fr_15",
    "title": "لوحات التحكم التفاعلية",
    "description": "يجب أن يدعم النظام لوحات تحكم تفاعلية تعرض مؤشرات الأداء الرئيسية بشكل مباشر وتتيح التخصيص للمستخدمين.",
    "priority": "متوسط",
    "acceptance_criteria": [
      "يمكن للمستخدم تخصيص عناصر اللوحة.",
      "يجب أن تعرض البيانات بشكل مباشر في الزمن الحقيقي.",
      "يمكن إضافة رسوم بيانية مختلفة.",
      "يمكن تصدير محتوى اللوحة كصورة أو ملف PDF.",
      "يجب أن تكون اللوحات متجاوبة مع جميع الأجهزة."
    ],
    "diagrams": [
      {
        "name": "مخطط واجهة لوحة التحكم",
        "description": "",
        "url": ""
      }
    ]
  },
  {
    "id": "fr_16",
    "title": "إدارة الأداء",
    "description": "يجب أن يتيح النظام للإدارة متابعة أداء الوكلاء من خلال مقاييس مثل عدد التذاكر المغلقة، سرعة الاستجابة، ومستوى رضا العملاء.",
    "priority": "عالي",
    "acceptance_criteria": [
      "يمكن إنشاء تقارير فردية عن أداء كل وكيل.",
      "يمكن مقارنة أداء الأقسام المختلفة.",
      "يجب أن تعرض البيانات بشكل يومي أو شهري.",
      "يمكن استخدام البيانات في تقييم الأداء الوظيفي.",
      "يجب أن تكون المقاييس قابلة للتخصيص."
    ],
    "diagrams": [
      {
        "name": "مخطط النشاط لإدارة الأداء",
        "description": "",
        "url": ""
      }
    ]
  },
  {
    "id": "fr_17",
    "title": "تكامل مع البريد الإلكتروني",
    "description": "يجب أن يدعم النظام التكامل مع منصات البريد الإلكتروني بحيث يمكن إنشاء التذاكر تلقائياً من رسائل العملاء.",
    "priority": "متوسط",
    "acceptance_criteria": [
      "يمكن إنشاء تذكرة من أي بريد وارد.",
      "يجب ربط البريد بالتذكرة بشكل تلقائي.",
      "يمكن للوكلاء الرد من داخل النظام.",
      "يجب أن يدعم النظام البريد الإلكتروني متعدد القنوات.",
      "يمكن فرز البريد حسب الكلمات المفتاحية."
    ],
    "diagrams": [
      {
        "name": "مخطط تسلسل تكامل البريد الإلكتروني",
        "description": "",
        "url": ""
      }
    ]
  }]
  },
  "nonfunctional_requirements": {
    "meta": {
      "id": "nonfunctional_requirements",
      "name": "Non-Functional Requirements - المتطلبات غير الوظيفية"
    },
    "requirements": [
      {
        "id": "nfr_01",
        "type": "الأداء",
        "description": "النظام يجب أن يدعم معالجة الطلبات في الوقت الفعلي بدون تأخير."
      },
      {
        "id": "nfr_02",
        "type": "الأمان",
        "description": "يجب على النظام استخدام الجدران النارية لمنع الوصول غير المصرح به."
      },
      {
        "id": "nfr_03",
        "type": "قابلية الاستخدام",
        "description": "يجب أن تكون واجهة المستخدم سهلة الاستخدام وتوفر تجربة سلسة للمستخدم."
      }
    ]
  },
  "use_cases": {
  "meta": {
    "id": "use_cases",
    "name": "Use Cases - حالات الاستخدام"
  },
  "items": [
    {
      "id": "uc_01",
      "name": "إدارة المهام للمستخدم",
      "description": "هذه الحالة تُمكّن مسؤول النظام من تنظيم المهام الخاصة بالمستخدمين بطريقة ديناميكية ومرنة. العملية لا تقتصر فقط على التعيين أو إلغاء التعيين، بل تشمل كذلك مراجعة الحالة، ضبط الأولويات، توزيع الحمل الوظيفي بعدالة، ومتابعة الأداء الفردي لكل مستخدم. الهدف النهائي هو ضمان انسيابية العمل، تقليل التكرار، وتحقيق أقصى استفادة من الموارد البشرية داخل النظام.",
      "actors": [
        "مسؤول النظام"
      ],
      "preconditions": [
        "النظام نشط ويعمل دون أعطال",
        "المستخدمون قد تم تعريفهم مسبقاً في قاعدة البيانات",
        "صلاحيات المسؤول مفعلة بشكل كامل"
      ],
      "steps": [
        "مسؤول النظام يفتح وحدة إدارة المهام من القائمة الرئيسية.",
        "النظام يعرض قائمة شاملة بالمهام الحالية مرتبة حسب الأولوية والحالة.",
        "المسؤول يختار مستخدم محدد ويضيف أو يعدل مهمة جديدة.",
        "النظام يتحقق من الصلاحيات ويقوم بتنفيذ الإجراء.",
        "النظام يرسل إشعاراً فورياً إلى المستخدم المرتبط بالمهمة.",
        "المسؤول يؤكد عملية الحفظ ويتم تحديث قاعدة البيانات بشكل فوري.",
        "النظام يولد تقريراً دورياً يوضح التوزيع الحالي للمهام."
      ],
      "business_rules": [
        { "id": "br_01", "rule": "يجب أن يكون للمسؤول صلاحيات كاملة على إدارة المهام." },
        { "id": "br_02", "rule": "لا يمكن أن تتجاوز المهام الجديدة الحد الأقصى لكل مستخدم." },
        { "id": "br_03", "rule": "يجب حفظ كل تعديل مع تسجيل وقت وتاريخ التنفيذ." },
        { "id": "br_04", "rule": "لن يتم اعتماد أي تغيير إلا بعد تحقق النظام من الصلاحيات." }
      ],
      "ui": [
        {
          "name": "شاشة إدارة المهام",
          "description": "تصميم واجهة لإدارة المهام يشمل قائمة بالمهام، قوائم منسدلة لاختيار المستخدمين، أزرار للتعيين والإلغاء، ولوحة إشعارات لحظية. يجب أن يكون التصميم متجاوب وحديث باستخدام Material Design.",
          "url": "https://brd-qi0f.onrender.com/static/2fc86179bc7f4f44ae1233bf86d89a7a.png"
        }
      ],
      "diagrams": [
        {
          "name": "مخطط نشاط إدارة المهام",
          "description": "Activity Diagram يوضح تدفق العمل: فتح وحدة المهام → اختيار المستخدم → تعيين/إلغاء مهمة → تحقق الصلاحيات → تحديث الحالة → إشعار المستخدم.",
          "url": "https://brd-qi0f.onrender.com/static/077cc0b4329140b192d9149d87e2d227.svg"
        }
      ]
    },
    {
      "id": "uc_02",
      "name": "فتح تذكرة جديدة",
      "description": "تصف هذه الحالة كيفية قيام الوكيل بفتح تذكرة جديدة سواء عبر المكالمات أو القنوات الرقمية مثل البريد الإلكتروني أو الدردشة. الغرض الأساسي هو توثيق طلب العميل بشكل كامل، بما في ذلك بياناته الشخصية، تفاصيل الاتصال، القسم المعني، والأولوية. هذا يضمن أن كل طلب يتم التعامل معه بشكل رسمي ومؤسسي مع إمكانية تتبعه ومراجعته لاحقاً.",
      "actors": [
        "وكيل الاتصال"
      ],
      "preconditions": [
        "نظام الاتصال التفاعلي IVR يعمل بكفاءة",
        "قنوات الاتصال (هاتف، بريد، دردشة) فعالة",
        "صلاحيات الوكيل صالحة"
      ],
      "steps": [
        "الوكيل يتلقى اتصالاً أو رسالة من العميل.",
        "النظام يعرض بيانات المتصل تلقائياً من قاعدة البيانات.",
        "الوكيل يدخل تفاصيل الطلب ويحدد القسم المناسب.",
        "النظام ينشئ تذكرة جديدة ويربطها بالعميل.",
        "الوكيل يؤكد حفظ التذكرة في قاعدة البيانات.",
        "النظام يرسل إشعاراً للعميل بتسجيل التذكرة."
      ],
      "business_rules": [
        { "id": "br_05", "rule": "جميع التذاكر يجب أن تحتوي على بيانات العميل كاملة." },
        { "id": "br_06", "rule": "يجب التحقق من هوية العميل قبل إنشاء التذكرة." },
        { "id": "br_07", "rule": "التذاكر الجديدة يجب أن تتضمن القسم، الوقت، والأولوية." }
      ],
      "ui": [
        {
          "name": "شاشة فتح التذكرة",
          "description": "واجهة حديثة تعرض بيانات العميل تلقائياً مع حقول لإدخال تفاصيل الطلب، قائمة منسدلة لاختيار القسم، وزر للتأكيد والحفظ.",
          "url": "https://brd-qi0f.onrender.com/static/a42db69b8830480e8bbeea60fd0af102.png"
        }
      ],
      "diagrams": [
        {
          "name": "مخطط تسلسل فتح التذكرة",
          "description": "Sequence Diagram يوضح التفاعل: الوكيل يتلقى مكالمة → النظام يعرض بيانات المتصل → إنشاء التذكرة → تأكيد وحفظ → إشعار العميل.",
          "url": "https://brd-qi0f.onrender.com/static/2394a0e825fb43859432529585ae3136.svg"
        }
      ]
    },
    {
      "id": "uc_03",
      "name": "تحديث البيانات البيانية للعميل",
      "description": "تُمكّن هذه الحالة وكلاء الاتصال وموظفي الدعم من تحديث بيانات العملاء وتفاصيلهم الحيوية بشكل ثنائي الاتجاه بين قاعدة البيانات ونظام التذاكر. هذا يضمن أن جميع الأطراف ترى أحدث المعلومات في الزمن الحقيقي، مما يحسن دقة المعالجة ويعزز رضا العملاء.",
      "actors": [
        "وكيل الاتصال",
        "موظف الدعم الفني"
      ],
      "preconditions": [
        "النظام نشط",
        "العميل موجود في قاعدة البيانات",
        "صلاحيات التعديل مفعلة"
      ],
      "steps": [
        "الموظف يفتح صفحة تفاصيل العميل.",
        "النظام يسترجع البيانات الحالية من القاعدة.",
        "الموظف يجري التعديلات المطلوبة (مثل الهاتف، البريد).",
        "النظام يتحقق من صحة البيانات المدخلة.",
        "النظام يحدث البيانات في قاعدة البيانات ونظام التذاكر معاً.",
        "يظهر إشعار نجاح بإتمام التحديث."
      ],
      "business_rules": [
        { "id": "br_08", "rule": "جميع التعديلات يجب أن تلتزم بسياسات حماية البيانات." },
        { "id": "br_09", "rule": "يجب أن تتم المزامنة بشكل فوري ودون تأخير." },
        { "id": "br_10", "rule": "التحديثات يجب أن تكون مرئية لجميع الأطراف ذات الصلاحيات." }
      ],
      "ui": [
        {
          "name": "شاشة تحديث العميل",
          "description": "واجهة تتضمن حقول بيانات العميل مع زر تحديث وحالة المزامنة. تصميم حديث يركز على سهولة الاستخدام.",
          "url": "https://brd-qi0f.onrender.com/static/810b6664248a43a09145338ff3c727ab.png"
        }
      ],
      "diagrams": [
        {
          "name": "مخطط نشاط تحديث العميل",
          "description": "Activity Diagram يوضح التدفق: الموظف يفتح البيانات → يعدلها → النظام يتحقق → التزامن مع القاعدة والتذاكر → إشعار نجاح.",
          "url": "https://brd-qi0f.onrender.com/static/a5e8306877cd4b4bbbf06cc181fefcfd.svg"
        }
      ]
    },
    {
      "id": "uc_04",
      "name": "إغلاق التذكرة",
      "description": "توضح هذه الحالة كيفية إغلاق التذكرة بعد تنفيذ الحل. الهدف الأساسي هو التأكد من أن جميع الخطوات قد تمت، وأن العميل حصل على الدعم المطلوب. كل عملية إغلاق يجب أن تتضمن ملخص تقرير، ويتم توثيقها في الأرشيف لاستخدامها لاحقاً في التحليل وتحسين الأداء.",
      "actors": [
        "وكيل الاتصال"
      ],
      "preconditions": [
        "التذكرة مفتوحة",
        "الحل قد تم تطبيقه",
        "صلاحيات الوكيل مفعلة"
      ],
      "steps": [
        "الوكيل يفتح تفاصيل التذكرة المفتوحة.",
        "النظام يعرض الحالة الحالية مع كافة التحديثات السابقة.",
        "الوكيل يتحقق من استكمال جميع الإجراءات.",
        "الوكيل يحدد خيار الإغلاق ويكتب ملخصاً للحالة.",
        "النظام يرسل إشعاراً للأطراف ذات الصلة بالإغلاق.",
        "النظام يحفظ التذكرة في الأرشيف مع التصنيف المناسب."
      ],
      "business_rules": [
        { "id": "br_11", "rule": "لا يمكن إغلاق أي تذكرة إلا بعد مراجعة كاملة." },
        { "id": "br_12", "rule": "يجب تسجيل جميع خطوات المعالجة ضمن السجل." },
        { "id": "br_13", "rule": "الإغلاق لا يتم إلا من وكلاء مخولين." }
      ],
      "ui": [
        {
          "name": "شاشة إغلاق التذكرة",
          "description": "واجهة تعرض تفاصيل التذكرة مع خيارات الإغلاق، إدخال ملخص، وزر تأكيد. تصميم متدرج وحديث لتسريع تدفق العمل.",
          "url": "https://brd-qi0f.onrender.com/static/79785c7d0e1442ada3c7b41862a236de.png"
        }
      ],
      "diagrams": [
        {
          "name": "مخطط نشاط إغلاق التذكرة",
          "description": "Activity Diagram يوضح الخطوات: مراجعة التذكرة → تحديد الإغلاق → كتابة الملخص → إشعار المشاركين → أرشفة.",
          "url": "https://brd-qi0f.onrender.com/static/f7d15e99ffe64011896e1d58e4871c42.svg"
        }
      ]
    },
    {
      "id": "uc_05",
      "name": "تصميم التقارير ولوحات الأداء",
      "description": "في هذه الحالة يقوم المديرون والمشرفون بإعداد تقارير ولوحات بيانات لمراقبة الأداء وجودة الخدمة. الهدف هو الحصول على رؤية شاملة في الزمن الحقيقي حول العمليات لتسهيل اتخاذ قرارات استراتيجية. النظام يدعم تقارير رسومية، إحصائية، ولوحات تفاعلية مع إمكانية التخصيص والتصدير.",
      "actors": [
        "مدير",
        "مشرف"
      ],
      "preconditions": [
        "النظام نشط",
        "البيانات متوفرة وحديثة"
      ],
      "steps": [
        "المستخدم يفتح وحدة التقارير.",
        "النظام يعرض خيارات متعددة لتخصيص التقرير.",
        "المستخدم يحدد المعايير والفترة الزمنية.",
        "النظام يقوم بمعالجة وتجميع البيانات.",
        "النظام يعرض النتائج في جداول ورسوم بيانية.",
        "المستخدم يمكنه تعديل وتصدير التقرير بصيغ مختلفة."
      ],
      "business_rules": [
        { "id": "br_14", "rule": "يجب أن تكون التقارير محمية من الوصول غير المصرح." },
        { "id": "br_15", "rule": "التقارير يجب أن تعتمد على بيانات زمن حقيقي." },
        { "id": "br_16", "rule": "يجب إرفاق كل تقرير بتوقيع زمني." }
      ],
      "ui": [
        {
          "name": "شاشة تصميم التقارير",
          "description": "واجهة احترافية تتيح اختيار المعايير، عرض مخططات تفاعلية، أزرار تصدير، وفلاتر زمنية. تعتمد تصميم حديث متجاوب.",
          "url": "https://brd-qi0f.onrender.com/static/ffe8c668a4254d17b4f589a51df82a99.png"
        }
      ],
      "diagrams": [
        {
          "name": "مخطط تسلسل تصميم التقارير",
          "description": "Sequence Diagram يوضح التفاعل: المستخدم يحدد معايير → النظام يعالج البيانات → يولد الرسوم → يتيح التصدير.",
          "url": "https://brd-qi0f.onrender.com/static/17c8880cc05944ed938c0c4c9c24cdb8.svg"
        }
      ]
    }
  ]
},

  "conclusion": {
    "meta": {
      "id": "conclusion",
      "name": "Conclusion - الخاتمة"
    },
    "paragraphs": "يمثل هذا المشروع نقلة نوعية في منظومة خدمة العملاء لدى الجزيرة كابيتال، حيث وفر إطارًا متكاملًا يجمع بين نظام مركز الاتصال ونظام التذاكر وقاعدة بيانات العملاء في منصة واحدة. من خلال هذا التكامل، أصبح بالإمكان تسريع الاستجابة لاحتياجات العملاء ورفع مستوى رضاهم، وتحسين الكفاءة التشغيلية عبر الأتمتة وآليات التصعيد الذكية، مع تعزيز الحوكمة والامتثال من خلال التوثيق الشامل وإدارة الصلاحيات. كما أتاح المشروع توفير مؤشرات أداء دقيقة تدعم متخذي القرار في تطوير الخدمات باستمرار. لقد صُمم النظام ليكون مرنًا وقابلًا للتوسع، مع توفير التدريب اللازم للمستخدمين وضمان توافقه مع أفضل الممارسات في السوق. وبذلك، لا يُعد المشروع مجرد تطوير تقني، بل يمثل خطوة استراتيجية لترسيخ تجربة عملاء أكثر تميزًا واستدامة، تدعم رؤية الشركة في تعزيز موقعها الريادي في القطاع المالي."
  }
}