{
    "general_info": {
    "meta": {
      "id": "general_info",
      "name": "General Information - معلومات عامة"
    },
    "rows": [
      {
        "id": "pi_01",
        "name": "اسم المشروع - Project Name",
        "value": "Smart-Dine | منصة ذكية لطلب وتوصيل الطعام"
      },
      {
        "id": "pi_02",
        "name": "الجهة المالكة - Owner",
        "value": ""
      },
      {
        "id": "pi_03",
        "name": "مدير المشروع - Manager",
        "value": ""
      },
      {
        "id": "pi_04",
        "name": "محلل المشروع - Analyst",
        "value": ""
      },
      {
        "id": "pi_05",
        "name": "معد التقرير - Author",
        "value": ""
      },
      {
        "id": "pi_06",
        "name": "معتمد التقرير - Approver",
        "value": ""
      },
      {
        "id": "pi_07",
        "name": "تاريخ البداية - Start Date",
        "value": ""
      },
      {
        "id": "pi_08",
        "name": "تاريخ الانتهاء - End Date",
        "value": ""
      },
      {
        "id": "pi_09",
        "name": "مدة المشروع - Duration",
        "value": ""
      }
    ]
  },
  "revision_history": {
    "meta": {
      "id": "revision_history",
      "name": "Revision History - إدارة الإصدارات"
    },
    "rows": [
      {
        "id": "rev_01",
        "version": "0.1",
        "status": "مسودة",
        "author": "",
        "date": "2025-05-25"
      }
    ]
  },
  "index": {
    "meta": {
      "id": "index",
      "name": "Index - الفهرس"
    },
    "rows": [
      {
        "id": "1",
        "name": "Glossary - جدول المصطلحات",
        "page": 4
      },
      {
        "id": "2",
        "name": "Introduction - مقدمة",
        "page": 5
      },
      {
        "id": "3",
        "name": "Importance - أهمية المشروع",
        "page": 5
      },
      {
        "id": "4",
        "name": "Goals - أهداف المشروع",
        "page": 5
      },
      {
        "id": "5",
        "name": "Scope - نطاق المشروع والمخرجات المتوقعة",
        "page": 5
      },
      {
        "id": "6",
        "name": "Out of Scope - خارج نطاق المشروع",
        "page": 6
      },
      {
        "id": "7",
        "name": "Assumptions and Constraints - الافتراضات والقيود",
        "page": 6
      },
      {
        "id": "8",
        "name": "Dependency and Integration - علاقة المشروع مع الأنظمة الأخرى",
        "page": 7
      },
      {
        "id": "9",
        "name": "Current State - الوضع الحالي والحلول السابقة (الملخص التنفيذي)",
        "page": 7
      },
      {
        "id": "10",
        "name": "System Diagram - الرسم البياني لوضعية عمل النظام",
        "page": 8
      },
      {
        "id": "11",
        "name": "Actors - مستخدمي النظام وخصائصهم",
        "page": 9
      },
      {
        "id": "12",
        "name": "Function Requirements - متطلبات الوظيفة",
        "page": 10
      },
      {
        "id": "13",
        "name": "Use Cases - حالات الاستخدام",
        "page": 11
      },
      {
        "id": "14",
        "name": "Conclusion - الخاتمة",
        "page": 18
      }
    ]
  },
    "glossary": {
        "meta": {
            "id": "glossary",
            "name": "Glossary - جدول المصطلحات"
        },
        "terms": [
            {
                "id": "gl_01",
                "term": "المستخدم - User",
                "definition": "شخص يستعمل التطبيق للتصفح أو الطلب."
            },
            {
                "id": "gl_02",
                "term": "مستخدم ضيف - Guest User",
                "definition": "زائر بدون تسجيل دخول؛ يمكنه التصفح وإضافة عناصر للسلة فقط."
            },
            {
                "id": "gl_03",
                "term": "عميل مسجل - Registered Customer",
                "definition": "مستخدم لديه حساب فعّال ويمكنه الدفع وتتبع الطلبات وإدارة العناوين."
            },
            {
                "id": "gl_04",
                "term": "العنوان - Delivery Address",
                "definition": "موقع تسليم محفوظ مع تحديد خرائطي وإحداثيات وجاهزية للتوصيل."
            },
            {
                "id": "gl_05",
                "term": "تحديد الموقع الجغرافي - Geolocation",
                "definition": "آلية لاكتشاف موقع المستخدم عبر GPS أو اختيار نقطة على الخريطة أو البحث."
            },
            {
                "id": "gl_06",
                "term": "الخريطة - Map",
                "definition": "عرض تفاعلي للمطاعم القريبة مع مسافات وفلاتر مباشرة."
            },
            {
                "id": "gl_07",
                "term": "المطعم - Restaurant",
                "definition": "مزود طعام يعرض قوائم وأسعارًا ورسوم توصيل وساعات عمل."
            },
            {
                "id": "gl_08",
                "term": "الفئة - Category",
                "definition": "تصنيف يجمع مطاعم أو أطباقًا متشابهة لسهولة التصفح."
            },
            {
                "id": "gl_09",
                "term": "القائمة - Menu",
                "definition": "مجموعة من المنتجات داخل مطعم منظّمة في أقسام."
            },
            {
                "id": "gl_10",
                "term": "المنتج/الطبق - Product/Dish",
                "definition": "عنصر قابل للطلب يعرض الاسم والوصف والسعر والتوفر."
            },
            {
                "id": "gl_11",
                "term": "الخيارات والإضافات - Options & Add-ons",
                "definition": "اختيارات تؤثر على المواصفات أو السعر مثل الحجم أو الإكسترا."
            },
            {
                "id": "gl_12",
                "term": "السلة - Cart",
                "definition": "تجميعة عناصر الطلب مع تعديل الكميات واستعراض التسعير الكامل."
            },
            {
                "id": "gl_13",
                "term": "القسيمة/الرمز الترويجي - Coupon/Promo Code",
                "definition": "كود يمنح خصمًا وفق قواعد التحقق وسياسة التراكم."
            },
            {
                "id": "gl_14",
                "term": "الدفع الإلكتروني - Online Payment",
                "definition": "تسديد عبر بوابة دفع باستخدام البطاقات أو المحافظ الرقمية."
            },
            {
                "id": "gl_15",
                "term": "الدفع عند الاستلام - Cash on Delivery",
                "definition": "خيار دفع نقدي عند التسليم إذا كان مفعّلًا للمطعم/المنطقة."
            },
            {
                "id": "gl_16",
                "term": "الطلب - Order",
                "definition": "سجل شراء يتضمن العناصر والأسعار والعنوان وطريقة الدفع."
            },
            {
                "id": "gl_17",
                "term": "تتبع الطلب - Order Tracking",
                "definition": "متابعة حالة الطلب زمنيًا مع خريطة GPS عند الخروج للتسليم."
            },
            {
                "id": "gl_18",
                "term": "حالة الطلب - Order Status",
                "definition": "مراحل مثل: مُنشأ، مؤكد، قيد التحضير، في الطريق، مُسلّم، مُلغى."
            },
            {
                "id": "gl_19",
                "term": "بوابة الدفع - Payment Gateway",
                "definition": "نظام خارجي يعالج المدفوعات ويرجع نجاحًا أو فشلًا."
            },
            {
                "id": "gl_20",
                "term": "خدمة التوصيل - Delivery Service",
                "definition": "مزود لوجستي يقدّم موقع الساعي حيًا ورقم التواصل."
            },
            {
                "id": "gl_21",
                "term": "المراجعات والتقييمات - Ratings & Reviews",
                "definition": "آراء المستخدمين بنظام نجوم ونصوص بعد إكمال الطلب."
            },
            {
                "id": "gl_22",
                "term": "التوصيات - Recommendations",
                "definition": "اقتراحات شخصية مبنية على الموقع والتاريخ والتفضيلات والعروض."
            },
            {
                "id": "gl_23",
                "term": "التوطين والدعم RTL - Localization & RTL Support",
                "definition": "دعم العربية والإنجليزية وتنسيقات العملة والتواريخ وواجهة من اليمين لليسار."
            },
            {
                "id": "gl_24",
                "term": "المفضلة - Favorites",
                "definition": "قائمة مطاعم محفوظة للوصول السريع والإشعارات السياقية."
            }
        ]
    },
    "introduction": {
        "meta": {
            "id": "introduction",
            "name": "Introduction - المقدمة"
        },
        "paragraphs": "تهدف هذه المبادرة إلى بناء نظام موحّد لطلب الطعام عبر الجوال والويب يقدّم تجربة معاصرة وآمنة وسلسة للمستخدمين والمطاعم وشركاء التوصيل. يأتي هذا المشروع استجابةً لازدياد الاعتماد على القنوات الرقمية لتلبية الاحتياجات اليومية، حيث تتقاطع فيه سهولة الاكتشاف مع سرعة الإنجاز ودقّة التتبع.\n\nترتكز الرؤية على أن تصبح المنصة الأكثر موثوقية وملاءمة في المنطقة لطلب الطعام، مع تجربة شخصية ثرية تُحترم فيها الخصوصية، وتتكامل بسلاسة مع مزوّدي الدفع والتوصيل، وتعمل بكفاءة عالية على مختلف الأجهزة واللغات.\n\nالغرض الأساسي هو تمكين المستخدم من العثور على المطاعم القريبة ذات الصلة بتفضيلاته، استكشاف القوائم والمنتجات بسهولة، تكوين سلة مشتريات بشفافية تسعيرية، وإتمام الدفع والتتبع في الزمن الحقيقي حتى تسليم الطلب، مع دعم كامل لإدارة الحساب والعناوين والتقييمات.\n\nينطلق المشروع من سياق سوق تنافسي سريع التطور، حيث ينتظر العملاء أداءً مرتفعًا، وتفاعلات فورية، وتوصيات ذكية، وتجربة مبسّطة تقلّل عدد النقرات وتعزّز الثقة. كما يواجه المزوّدون حاجةً إلى أدوات ترويج ديناميكية وبيانات موحّدة لاتخاذ قرارات أفضل.\n\nيعتمد النظام على مقاربة متعددة المنصات تشمل تطبيقات iOS وAndroid إضافة إلى واجهة ويب متجاوبة، مع الاستفادة من قدرات كل جهاز مثل الإشعارات الفورية والاتصال الهاتفي على الهواتف، وضمان تجربة موحّدة في الشكل والمحتوى والأداء.\n\nيخدم الحل فئتين رئيسيتين من المستخدمين النهائيين: الزائر الذي يمكنه الاستكشاف وإضافة العناصر إلى السلة قبل التسجيل، والعميل المسجّل الذي يتمتع بكامل المزايا من الدفع والتتبع وسجل الطلبات والتقييمات وإدارة المفضّلة والإشعارات.\n\nيوفّر النظام للمستخدم النهائي قيمة عملية تتمثل في اكتشاف محدود بالموقع وتفضيلات ذكية، بحث وتصفية مرتكزين على الأداء، تسعير واضح بكل الرسوم والضرائب والرسوم الإضافية، وتتبّع حيّ لمراحل الطلب والموصل إن توفّر.\n\nبالنسبة للمطاعم والشركاء، يعرض المشروع قناة رقمية فعّالة لاكتساب العملاء، وإدارة القوائم وتوافر المنتجات بالزمن الحقيقي، وإبراز العروض والترويج الموجّه، وجمع التعليقات المنظمة لتحسين الجودة والخدمة.\n\nيرتكّز نطاق المنتج الوظيفي على محاور أساسية: الوصول والحساب، تحديد الموقع والخرائط، الاستكشاف والبحث والتصنيفات، تفاصيل المطاعم والقوائم والمنتجات، السلة والدفع، الطلبات والتتبّع، المفضّلة والتوصيات، التقييمات والمراجعات، الإشعارات، والعروض والكوبونات.\n\nتجربة تحديد الموقع مصممة لتكون مرنة وشاملة: عبر GPS بموافقة المستخدم، أو اختيار نقطة على الخريطة، أو البحث بحسب المدينة والمنطقة، مع حفظ التفضيلات لاستخدامها لاحقًا، وإظهار المطاعم القريبة والمسافة التقديرية.\n\nيُعدّ التوطين ركيزة أساسية؛ إذ يدعم النظام العربية والإنجليزية بشكل كامل بما في ذلك اتجاه الكتابة من اليمين إلى اليسار، مع تنسيقات محليّة للأرقام والتواريخ والعملات، وعرض المسافات بالكيلومترات بشكل افتراضي.\n\nتوظّف المنصة محركات توصية تعتمد على الموقع والسلوك والطلبات السابقة والتقييمات والعروض النشطة لإبراز أقسام ديناميكية مثل الأقرب، الموصى به، المتصدرون، والمنتجات الرائجة، بما يعزز الاكتشاف ويزيد معدلات التحويل.\n\nيعالج النظام جانب الأمان والخصوصية بصرامة من خلال التشفير الكامل لحركة البيانات، وإدارة الجلسات بأفضل الممارسات، وتجزئة كلمات المرور، وحماية من الهجمات الشائعة، إلى جانب إدارة موافقات الخصوصية والالتزام باللوائح المعمول بها.\n\nيركّز التصميم على الأداء وتجربة المستخدم من خلال ترقيم صفحات فعّال وتمرير لا نهائي وتخزين مؤقّت مدروس، مع واجهات بحث وتصفية سريعة بمدخلات مؤجلة، وحالات تحميل واضحة، وأخطاء مقروءة، وواجهات قابلة للوصول.\n\nتُعدّ قابلية الوصول عنصرًا أساسيًا في الواجهة، مع دعم تباين عالٍ، وتكبير النص، والتنقّل بلوحة المفاتيح على الويب، وتسميات لمُسرّعات القراءة الصوتية، لضمان تجربة عادلة وشاملة لمختلف احتياجات المستخدمين.\n\nيوفّر النظام قناة إشعارات مدروسة عبر دفع فوري على الجوال وتنبيهات داخل التطبيق على الويب، مع احترام أذونات المنصة وتفضيلات المستخدم، مع توصية بإبقاء إشعارات حالة الطلب فعّالة لضمان شفافية الرحلة.\n\nتغطي تجربة الحساب والعناوين إدارة بيانات المستخدم الأساسية وتفضيلات الإشعارات واللغة، وسجل عناوين متعدد مع تعيين عنوان افتراضي وترميز جغرافي لكل عنوان لضمان أوقات توصيل دقيقة والتحقق من الخدمة.\n\nيقدّم مسار الشراء تجربة تسعير شفافة وشاملة لعناصر السلة والإضافات والضرائب والرسوم وكوبونات الخصم، مع فرض قواعد الحد الأدنى للمطعم والتحقق من تغطية التوصيل قبل اختيار وسيلة الدفع.\n\nيُدار الدفع عبر تكامل مع بوابة موثوقة لمدفوعات البطاقات وغيرها من القنوات الإلكترونية المتاحة، مع دعم نقدي عند التسليم عندما تسمح السياسات، وتعامل رشيد مع حالات الفشل والاسترداد وفقًا للسياسات.\n\nيوفّر نظام الطلبات وتتبعها مخططًا زمنيًا واضحًا لحالة الطلب من الإنشاء حتى التسليم أو الإلغاء، مع تتبع GPS مباشر للساعي عند توفره، وخيارات تواصل مناسبة للجوال، وتحديثات فورية للحالة.\n\nتُعدّ التقييمات والمراجعات عنصرًا محوريًا لبناء الثقة، إذ يسمح النظام بتقييم المطاعم والمنتجات بعد إتمام الطلب، مع ضوابط مكافحة الرسائل المزعجة، وقياسات موحّدة للدرجات، وإتاحة الوسائط عند الحاجة.\n\nعلى مستوى الحوكمة، يوفّر المشروع لجهات التشغيل أدوات لإدارة التصنيفات والمطاعم والقوائم والأسعار والتوافر والعروض، إضافةً إلى آليات جدولة الأشرطة الترويجية واستهدافها والاطلاع على التقارير.\n\nتشتمل الخريطة التقنية على واجهات برمجة عالية الأداء لفهارس كبيرة مع فلاتر وفرز مفهرسين، وتوزيع الصور عبر شبكة توصيل محتوى، وتكامل خرائط للترميز الجغرافي والقياسات، مع تصميم قابل للتوسع أفقيًا.\n\nيضع المشروع معايير واضحة للنجاح تشمل معدلات التحويل، زمن الاستجابة للصفحات والقوائم والبحث، دقة التسليم والتتبّع، رضى المستخدمين، وتبني الميزات كالاشتراك في الإشعارات وإعادة الطلب.\n\nتم تحديد مجموعة من المخاطر والافتراضات مثل توافر بيانات آنية للمطاعم، واكتمال تغطية الخرائط، واعتمادية مزوّد الدفع، وإمكانية الحصول على أذونات الموقع والإشعارات، مع خطط تلطيف مناسبة.\n\nيستند التنفيذ إلى نهج تدريجي عبر مراحل واضحة: الأساسيات الوظيفية للاكتشاف والسلة والدفع، ثم التتبع الحيّ والتوصيات المتقدمة، ثم أدوات الترويج والحوكمة المتقدمة، مع تحسينات أداء مستمرة.\n\nتتطلّب الجودة عمليات اختبار متعددة المستويات تشمل قابلية الاستخدام، الأداء تحت ضغط، أمن التطبيقات، دقّة التوطين، وسلامة تكاملات الطرف الثالث، مع مراقبة وتشخيص حي للحوادث.\n\nمن منظور تجربة المحتوى، يؤكد المشروع على اتساق التسميات، وصور عالية الجودة، ووصف غني للمنتجات، وشعارات واضحة للعناصر الخاصة مثل الحار والنباتي والأكثر مبيعًا، ما يعزّز اتخاذ القرار بسرعة.\n\nسيؤسس المشروع إطارًا للخصوصية والشفافية يشرح كيفية التعامل مع البيانات الشخصية، وخيارات المستخدم للتحكم بالتتبّع والإشعارات، وشروط الخدمة وسياسة الخصوصية المعروضة في نقاط ذات صلة.\n\nأخيرًا، يجمع هذا التصوّر بين رؤية طموحة وتجربة عملية قابلة للقياس والتنفيذ، ليقدّم منصة طلب طعام موثوقة، سريعة، قابلة للتوسّع، ومحليّة الطابع، تُرضي توقعات المستخدم النهائي وتمكّن الشركاء من النمو."
    },
    "importance": {
        "meta": {
            "id": "importance",
            "name": "Importance - أهمية المشروع"
        },
        "points": [
            "توسيع الحصة السوقية عبر قناة رقمية موحّدة تعمل على iOS/Android والويب، ما يقلّل الاعتماد على الطلبات الهاتفية أو الوسطاء ويزيد الوصول إلى شرائح جديدة.",
            "زيادة الإيرادات من خلال اكتشاف مطاعم قريبة وتوصيات مخصّصة وقسم “إعادة الطلب” والعروض المستهدفة، بما يرفع معدّل التحويل ويقلّل التخلي.",
            "رفع متوسط قيمة الطلب عبر إدارة خيارات المنتج والإضافات المدفوعة والقسائم والحزم المقترحة، مع إظهار أثر الأسعار بشكل واضح قبل الدفع.",
            "تحسين الكفاءة التشغيلية بتقليل الأخطاء البشرية بفضل التحققات الآلية (حد أدنى للطلب، نطاق الخدمة، الرسوم) وتحديثات التوفر الفورية للأصناف.",
            "تعزيز تجربة المستخدم بسرعة التصفح والبحث والتصفية والفرز والتمرير اللانهائي، مع دعم كامل للعربية/الإنجليزية وواجهة RTL لزيادة الراحة والقبول.",
            "تقليل أعباء الدعم من خلال شفافية التتبع اللحظي لحالة الطلب وGPS عند التوصيل وإشعارات فورية، ما يقلّل الاستفسارات والمكالمات الواردة.",
            "تحسين الاحتفاظ والولاء عبر المفضلات، إعادة الطلب بنقرة واحدة، التقييمات والمراجعات، وتخصيص الإشعارات وفق الموقع والسلوك والتفضيلات.",
            "تمكين قرارات أعمال قائمة على البيانات عبر مؤشرات الأداء مثل تكرار الشراء، فعالية القسائم، المطاعم/الأصناف الرائجة، وأوقات الذروة لتوزيع الموارد.",
            "تعزيز الأمان والامتثال للخصوصية عبر HTTPS وتجزئة كلمات المرور وإدارة الجلسات والموافقات، ما يبني الثقة ويخفّض المخاطر القانونية.",
            "رفع قابلية التوسع والأداء بتبنّي التخزين المؤقت وCDN والصفحات المتدرجة، لضمان استقرار التجربة عند الذروة والمواسم العالية الطلب.",
            "زيادة نسب إتمام الدفع عبر توفير خيارات مرنة (دفع إلكتروني ونقد عند التسليم حيثما أمكن) ورسائل أخطاء واضحة عند فشل المعاملات.",
            "تحسين التنسيق مع شركاء التوصيل بفضل تكامل GPS وإتاحة الاتصال بالسائق على الجوال، وتقدير أدق لأوقات التسليم ورفع الالتزام بمستويات الخدمة.",
            "تعظيم عائد التسويق من خلال لافتات ترويجية موجهة واستهداف حسب الموقع والاهتمامات، مع تتبّع النقرات والتحويلات لتحسين الإنفاق الإعلاني.",
            "توسيع قاعدة المستخدمين عبر الالتزام بإمكانية الوصول (تباين مناسب، دعم قارئ الشاشة، تنقّل لوحة المفاتيح)، ما يرفع الشمولية والامتثال.",
            "تمكين التوسع الجغرافي بسهولة عبر التوطين الكامل للغة والعملات وصيغ التاريخ والمسافات، ما يقلّل كلفة وزمن دخول أسواق جديدة.",
            "تقليل الاعتماد على منصات التجميع الطرف ثالث عبر امتلاك قناة الطلب المباشرة وبيانات العملاء، مما يحسّن الهوامش ويقوّي العلاقة مع العميل.",
            "تحسين إدارة الخدمة والشكاوى بفضل سجل طلبات شامل، مسارات إلغاء مضبوطة بالسياسة، وتوثيق واضح للأسعار والرسوم، ما يقلّل النزاعات.",
            "تمكين فرق التشغيل والإدارة من التحكم السريع بالقوائم والتسعير والتوافر والعروض من لوحة واحدة، ما يختصر زمن إطلاق التغييرات ويزيد المرونة."
        ]
    },
    "goals": {
        "meta": {
            "id": "goals",
            "name": "Goals - أهداف المشروع"
        },
        "points": [
            "إطلاق النسخة الأولى (iOS/Android والويب) خلال 6 أشهر مع دعم 10 مدن وضم 50 مطعماً شريكاً وتفعيل 100 قائمة طعام.",
            "تحقيق زمن استجابة لواجهات API الأساسية (المطاعم، القوائم، السلة) ≤ 400 مللي ثانية عند p95 خلال 4 أشهر من الإطلاق.",
            "خفض زمن تحميل الشاشة الرئيسية وقائمة المطاعم إلى ≤ 2.5 ثانية عند p75 و≤ 4 ثوان عند p95 على الجوال خلال 4 أشهر.",
            "الوصول إلى معدل تحويل من إضافة المنتجات إلى السلة حتى إتمام الدفع ≥ 55% خلال 6 أشهر، ونجاح عمليات الدفع الإلكترونية ≥ 95% وتقليل فشل البوابة إلى ≤ 0.5%.",
            "تمكين إشعارات حالة الطلب بحيث تُرسل خلال ≤ 5 ثوان (p90) من استلام تحديث الحالة، وبلوغ معدل تسليم إشعارات ≥ 98% خلال 3 أشهر.",
            "توفير تتبع GPS مباشر لمرحلة «خارج للتسليم» في ≥ 80% من الطلبات في المدن المدعومة خلال 9 أشهر، مع توافر خدمة الخريطة ≥ 99.5% شهرياً.",
            "إنجاز دعم كامل للعربية والإنجليزية بنسبة تغطية نصوص 100% مع RTL صحيح وخلوّ من أخطاء بصرية حرجة عند الإطلاق.",
            "رفع معدل النقر على التوصيات المخصصة إلى ≥ 8% وزيادة متوسط قيمة الطلب بنسبة 10% خلال 9 أشهر عبر خوارزميات التخصيص والعروض المستهدفة.",
            "تحسين البحث والتصفية لإرجاع النتائج الأولى خلال ≤ 500 مللي ثانية عند p90، مع دعم الفرز الصاعد/الهابط والترقيم اللامتناهي، خلال 4 أشهر.",
            "تحقيق استقرار التطبيقات بمعدل انهيار < 0.5% للجلسات وتوافر المنصة ≥ 99.9% شهرياً خلال أول 3 أشهر بعد الإطلاق.",
            "اجتياز تدقيق أمني خارجي وفق OWASP ASVS L2 خلال 6 أشهر، مع فرض HTTPS بنسبة 100% وتفعيل حماية CSRF وتقليل محاولات الاختراق بالقوة عبر محددات الدخول.",
            "رفع نسبة نجاح الترميز الجغرافي للعناوين إلى ≥ 98% وتقليل أخطاء «خارج نطاق الخدمة» إلى < 1% بزمن معالجة ≤ 800 مللي ثانية خلال 4 أشهر.",
            "تحقيق نسبة الطلبات المكتملة التي ينتج عنها تقييم ≥ 20% خلال 9 أشهر، مع زمن نشر للمراجعات ≤ 5 دقائق ومعدل إساءة مرفوضة < 2%.",
            "الوصول إلى 100,000 مستخدم مسجّل و20,000 مستخدم نشط شهرياً و5,000 طلب يومي خلال 12 شهراً، مع نسبة احتفاظ شهرية ≥ 40%."
        ]
    },
    "scope": {
        "meta": {
            "id": "scope",
            "name": "Scope - نطاق المشروع"
        },
        "included": [
            {
                "title": "الوصول والمصادقة وإدارة الحساب",
                "describtion": [
                    "تسجيل مستخدمين جدد وتسجيل الدخول وتسجيل الخروج الآمن.",
                    "إعادة تعيين كلمة المرور عبر البريد الإلكتروني أو الرسائل النصية.",
                    "إدارة الجلسات وتخزين آمن لكلمات المرور وحماية من محاولات الاختراق."
                ]
            },
            {
                "title": "الملف الشخصي والإعدادات",
                "describtion": [
                    "تعديل الاسم ورقم الهاتف والبريد الإلكتروني وتغيير كلمة المرور.",
                    "إدارة تفضيلات الإشعارات والخصوصية والموافقة.",
                    "اختيار اللغة (العربية/الإنجليزية) مع دعم RTL الكامل للعربية."
                ]
            },
            {
                "title": "العناوين وتحديد الموقع الجغرافي",
                "describtion": [
                    "إضافة وتعديل وحذف عناوين متعددة مع تعيين عنوان افتراضي.",
                    "تحديد الموقع عبر GPS أو اختيار نقطة على الخريطة أو البحث بالمدينة/المنطقة.",
                    "جيوكود لكل عنوان وحفظ الموقع للجلسات اللاحقة."
                ]
            },
            {
                "title": "الخرائط والاستكشاف القريب",
                "describtion": [
                    "عرض المطاعم القريبة على الخريطة مع المسافة.",
                    "التصفية والفرز مباشرة على الخريطة.",
                    "فتح تفاصيل المطعم بالنقر على العلامة."
                ]
            },
            {
                "title": "تجربة الصفحة الرئيسية الديناميكية",
                "describtion": [
                    "عرض بطاقة الطلب الجاري مع اختصار التتبع.",
                    "أقسام مدفوعة بالبيانات: الأقرب، سبق الطلب، موصى لك، الرائج، أفضل الفئات.",
                    "بانرات ترويجية قابلة للجدولة والاستهداف، وإعادة الطلب السريع."
                ]
            },
            {
                "title": "إدارة الفئات",
                "describtion": [
                    "عرض الفئات كبطاقات بالصور والعناوين والأوصاف.",
                    "بحث بالاسم وفرز حسب الاسم أو عدد المطاعم تصاعدياً/تنازلياً.",
                    "تمرير لانهائي وتحميل كسول وفتح قائمة المطاعم/القوائم ضمن الفئة."
                ]
            },
            {
                "title": "اكتشاف المطاعم وتفاصيلها",
                "describtion": [
                    "مرشحات: الفئة، الاسم، زمن التوصيل، مستوى السعر، المدينة/المنطقة، مفتوح الآن.",
                    "فرز: الاسم، التقييم، الفئة، السعر، الأقرب، زمن التوصيل؛ مع ترقيم صفحات لانهائي.",
                    "تفاصيل شاملة: وصف، صور، تقييمات ومراجعات، أنواع المطبخ، الحد الأدنى والرسوم والوقت، ساعات العمل، الموقع والمسافة، خيارات التوصيل/الاستلام، ومعلومات الاتصال (اتصال عبر الجوال فقط)."
                ]
            },
            {
                "title": "القوائم والمنتجات والخيارات",
                "describtion": [
                    "تصفية حسب القائمة أو اسم المنتج وفرز بالاسم/التقييم/السرعة/السعر.",
                    "تفاصيل المنتج: اسم، وصف، سعر، معرض صور، تقييم، شارات (حار/نباتي/الأكثر مبيعاً/جديد/موصى به).",
                    "خيارات ومتغيرات وإضافات مع تأثيرات سعرية والتحقق من الخيارات الإلزامية وحالة التوفر."
                ]
            },
            {
                "title": "سلة المشتريات والتسعير",
                "describtion": [
                    "تجميع العناصر حسب المطعم مع تعديل الكميات والخيارات وإزالة العناصر.",
                    "عرض تفصيلي للتسعير: المجاميع الفرعية، الإضافات، الضرائب، رسوم التوصيل والخدمة، خصومات القسائم، والإجمالي.",
                    "تطبيق والتحقق من القسائم مع رسائل نجاح/خطأ وفرض حد أدنى للطلب لكل مطعم."
                ]
            },
            {
                "title": "إتمام الشراء والدفع",
                "describtion": [
                    "ملخص نهائي للطلب مع تقدير زمن التوصيل.",
                    "اختيار عنوان التوصيل أو إضافة عنوان جديد والتحقق من قابلية الخدمة.",
                    "اختيار طريقة الدفع (بوابة إلكترونية على الأقل، نقد عند التسليم اختياري) وإدخال القسائم وقبول الشروط."
                ]
            },
            {
                "title": "إدارة الطلبات وتتبع التوصيل",
                "describtion": [
                    "قائمة الطلبات مع الحالة والتاريخ والمطعم والإجمالي.",
                    "تفاصيل الطلب: العناصر والخيارات والتسعير والعنوان وطريقة الدفع والقسائم.",
                    "خط زمني للحالات وتتبع GPS مباشر عند الخروج للتسليم واتصال بالساعي على الجوال وإعادة الطلب والإلغاء وفق السياسات وتحديثات آنية."
                ]
            },
            {
                "title": "المفضلة والتوصيات المخصصة",
                "describtion": [
                    "إضافة/إزالة المطاعم المفضلة والوصول السريع إليها.",
                    "توصيات مخصصة على الصفحة الرئيسية وصفحة المطاعم استناداً إلى الموقع والتفضيلات والسجل والعروض.",
                    "إبراز المطاعم ذات العروض النشطة."
                ]
            },
            {
                "title": "التقييمات والمراجعات",
                "describtion": [
                    "تقييمات مجمعة للمطاعم والمنتجات مع عرضها على البطاقات والصفحات.",
                    "تمكين العملاء الموثقين من إضافة تقييمات ومراجعات بعد إتمام الطلب فقط.",
                    "مقياس 1–5 نجوم مع صور اختيارية وآليات مكافحة الرسائل المزعجة والمراجعة."
                ]
            },
            {
                "title": "الإشعارات عبر الجوال والويب",
                "describtion": [
                    "إشعارات دفع للجوال لحالات الطلب والتوصيات والعروض.",
                    "إشعارات داخل التطبيق على الويب وويب-دفع اختياري بموافقة المستخدم.",
                    "تفضيلات إشعار قابلة للتحكم واحترام أذونات الجهاز والمتصفح."
                ]
            },
            {
                "title": "الإعلانات والقسائم الترويجية",
                "describtion": [
                    "بانرات ترويجية على الصفحة الرئيسية مع جدولة واستهداف وتتبع النقرات.",
                    "إدارة القسائم أثناء الدفع مع قواعد التكديس وسياسات التحقق.",
                    "تمييز المطاعم ذات العروض ضمن القوائم والصفحات."
                ]
            },
            {
                "title": "التدويل والتوطين",
                "describtion": [
                    "دعم كامل للعربية والإنجليزية مع واجهة RTL للعربية.",
                    "تنسيقات أرقام وتواريخ محلية وعرض العملة حسب المنطقة.",
                    "عرض المسافات بالكيلومتر مع تخزين بوحدات قياسية."
                ]
            },
            {
                "title": "الأداء وتجربة المستخدم",
                "describtion": [
                    "تمرير لانهائي مع ترقيم فعّال وتخزين مؤقت وحالات تحميل واضحة.",
                    "بحث وفلاتر وفرز سريع مع إلغاء الاهتزاز (debounce).",
                    "تجارب بديلة عند رفض الموقع ومعايير إتاحة الوصول على الويب والجوال."
                ]
            },
            {
                "title": "الأمن والخصوصية والامتثال",
                "describtion": [
                    "جميع الاتصالات عبر HTTPS وإدارة جلسات آمنة.",
                    "تجزئة كلمات المرور وحماية من القوة الغاشمة وCSRF على الويب.",
                    "إدارة الموافقات وتقليل البيانات والامتثال للأنظمة ذات الصلة."
                ]
            },
            {
                "title": "التكاملات مع الأنظمة الخارجية",
                "describtion": [
                    "بوابة دفع لمعالجة المدفوعات وإرجاع حالات النجاح/الفشل.",
                    "مزود خرائط/موقع للجيوكود وعكسه وبلاطات الخرائط وحساب المسافات.",
                    "تكامل مع خدمة التوصيل لتحديثات GPS للساعي ورقم الاتصال، وCDN للصور."
                ]
            },
            {
                "title": "الحدود والافتراضات التشغيلية",
                "describtion": [
                    "المنصات: تطبيقات iOS/Android وموقع ويب متجاوب (قدرات الجوال مثل الإشعارات والاتصال).",
                    "نوع الطلب: التوصيل أساسي والاستلام اختياري من بعض المطاعم.",
                    "مجموعة حالات الطلب الأساسية، قواعد الحد الأدنى والرسوم، وسياسات الاسترداد وفشل الدفع."
                ]
            }
        ],
        "diagrams": [
            {
                "description": "Context Diagram: Central Food Ordering System connected to Mobile/Web Users (browse, cart, checkout, notifications), Payment Gateway (online payments and callbacks), Map/Geolocation Provider (geocoding, reverse geocoding, tiles, distance), Delivery Service (courier GPS updates and phone), Admin Operator (restaurants, menus, pricing, availability, promotions), and CDN/Media (images, banners). Data stores include users, addresses, restaurants, menus/products, orders, reviews, favorites, and coupons."
            }
        ]
    },
    "out_of_scope": {
        "meta": {
            "id": "out_of_scope",
            "name": "Out of Scope - خارج نطاق المشروع"
        },
        "excluded": [
            "تطبيق أو بوابة للسائقين وإدارة أسطول التوصيل (تعيين الطلبات والمسارات والحضور).",
            "نظام ولاء أو محفظة رصيد داخلية.",
            "حجوزات الطاولات أو الطلب داخل الصالة (Dine-in).",
            "الطلبات المجدولة للمستقبل أو تحديد وقت تسليم لاحق.",
            "دردشة فورية داخل التطبيق مع المطعم أو السائق.",
            "الاتصال بسائق التوصيل عبر الويب (المكالمات مقتصرة على تطبيقات الجوال).",
            "مدفوعات بعملات رقمية أو تقسيط أو تقسيم المدفوعات بين عدة عملاء.",
            "لوحة مطبخ ومخزون متقدمة للمطاعم (KDS، إدارة مشتريات ومستودعات).",
            "إدارة لوجستية متقدمة للتوصيل (تحسين مسارات وتتبع أسطول داخلي).",
            "تكاملات مع أنظمة نقاط بيع أو ERP غير المذكورة صراحة.",
            "إصدار فواتير ضريبية إلكترونية متوافقة مع متطلبات حكومية خاصة.",
            "إدارة عمولات وفوترة مالية بين المنصة والمطاعم.",
            "دعم لغات إضافية غير العربية والإنجليزية.",
            "وضع عمل دون اتصال بالإنترنت أو مزامنة كاملة بدون شبكة.",
            "محتوى مستخدمين إضافي بخلاف التقييمات والمراجعات بعد إتمام الطلب.",
            "أتمتة حملات تسويقية خارجية متقدمة أو إدارة بريد تسويقي واسعة.",
            "سوق سائقين مستقلين أو توصيل بين المستخدمين (peer-to-peer).",
            "استردادات تلقائية داخل التطبيق خارج سياسات بوابة الدفع.",
            "ضمانات جودة الطعام أو التأمين على الطلبات.",
            "إدارة أجهزة المستخدم أو صلاحيات نظام التشغيل على أجهزتهم.",
            "إنشاء خرائط مخصصة أو استخدام مزوّد خرائط بديل غير المدعوم.",
            "مكالمات صوت عبر الإنترنت داخل التطبيق (VoIP).",
            "رفع وسائط كبيرة أو غير مقيدة ضمن المراجعات دون سياسات ومراجعة.",
            "تعدد العملات داخل الطلب الواحد؛ العملة تُحدد حسب المنطقة فقط.",
            "قدرات PWA متقدمة مثل مزامنة خلفية معقدة خارج الإشعارات الويب الاختيارية."
        ]
    },
    "assumptions_constraints": {
        "meta": {
            "id": "assumptions_constraints",
            "name": "Assumptions & Constraints - الافتراضات والقيود"
        },
        "assumptions": [
            "المستخدمون يمتلكون اتصال إنترنت مستقر أثناء استخدام التطبيق عبر الويب أو الموبايل.",
            "أغلب المستخدمين يسمحون بالوصول للموقع الجغرافي، ومن يرفض يمكنه اختيار مدينة/منطقة أو نقطة على الخريطة.",
            "تبديل اللغة بين العربية والإنجليزية متاح ويغطي النصوص والرسائل بالكامل مع دعم RTL للعربية.",
            "المطاعم وشركاء الإدارة يزوّدون النظام ببيانات دقيقة ومحدّثة عن القوائم، الأسعار، التوافر، ورسوم التوصيل في شبه وقت حقيقي.",
            "يوجد تكامل فعّال مع بوابة دفع واحدة على الأقل قادرة على إعادة حالات النجاح والفشل بموثوقية عالية.",
            "سياسة الكوبونات والعروض تُدار مركزياً وتُرسل قواعدها إلى واجهة المستخدم لحساب الخصومات محلياً بدقة.",
            "شريك التوصيل يرسل على الأقل تحديثات حالة الطلب النصية، وفي العديد من الحالات يوفّر أيضاً إحداثيات GPS لحظية.",
            "الصور والملفات الثابتة مخدّمة عبر شبكة توزيع محتوى (CDN) لتسريع التحميل.",
            "تسجيل الدخول مطلوب لإتمام الشراء بينما يمكن التصفح وإضافة عناصر للسلة كضيف.",
            "المستخدمون يقبلون شروط الخدمة وسياسة الخصوصية عند التسجيل أو في صفحة الدفع.",
            "العناوين تُحفظ مع إحداثيات جيومكانية بعد عملية الجيوكودينغ لضمان دقة التحقق من نطاق الخدمة.",
            "خوارزميات التوصية تعتمد على تاريخ الطلبات، التقييمات، الموقع، والعروض الحالية ويمكن تعديلها دون تغيير واجهات العرض.",
            "تنسيقات العملة والتواريخ والمسافات تُعرض محلياً بحسب إعدادات اللغة/المنطقة.",
            "لا يُسمح بنشر تقييمات إلا بعد إتمام طلب فعلي مرتبط بالمطعم أو المنتج."
        ],
        "constraints": [
            "جميع الاتصالات تتم عبر HTTPS مع إدارة جلسات آمنة وتجزئة كلمات المرور وحماية CSRF على الويب.",
            "تتبع GPS المباشر يعتمد على قدرات شريك التوصيل؛ عند عدم توفره يقتصر العرض على حالات الحالة الزمنية دون خريطة حية.",
            "الاتصال الهاتفي بمندوب التوصيل أو المطعم متاح على تطبيقات الموبايل فقط وغير متاح على الويب.",
            "يجب الحصول على موافقات صريحة لاستخدام الموقع الجغرافي والإشعارات؛ وعند الرفض يُفرض مسار بديل لا يعتمد على GPS أو Push.",
            "الحد الأدنى لقيمة الطلب ورسوم التوصيل تطبق لكل مطعم/منطقة ويمنع إتمام الدفع إن لم تتحقق الشروط.",
            "خاصية الدفع عند الاستلام متاحة فقط إذا كانت مفعّلة للمطعم أو للمنطقة؛ وإلا تقتصر طرق الدفع على أونلاين.",
            "نظام المراجعات خاضع للمراجعة ومكافحة الرسائل المزعجة، ويُسمح بالنشر فقط لطلبات مكتملة، ولا يمكن تقييم الطلبات الملغاة.",
            "أداء واجهات القوائم والبحث يجب أن يدعم ترقيمًا لا نهائيًا مع فلاتر وفرز بفهرسة مناسبة؛ زمن الاستجابة المستهدف أقل من 3 ثوانٍ لـ 95% من الطلبات.",
            "البحث متعدد اللغات غير حسّاس لحالة الأحرف والعلامات التشكيلية ويعمل عبر العربية والإنجليزية.",
            "تعرض المسافات بالكيلومترات في الواجهة الأمامية؛ بينما التخزين الداخلي يستخدم وحدات قياسية ثابتة.",
            "بيانات المستخدم الشخصية تُخزّن بالحد الأدنى ووفق القوانين المحلية لحماية البيانات، مع توفير آليات الموافقة وإدارة الخصوصية.",
            "إشعارات التسويق اختيارية وقابلة للتعطيل من المستخدم؛ إشعارات حالة الطلب تحترم إعدادات النظام وقد تُحجب إذا سُحب الإذن.",
            "لا يمكن إكمال الدفع دون تسجيل الدخول والتحقق من خدمة التوصيل للعنوان المختار.",
            "الاعتماد على أنظمة خارجية (خرائط، دفع، توصيل) يفرض حدود توفرها وSLA؛ عند فشل خدمة خارجية يجب توفير مسار تدهور وظيفي ورسائل خطأ واضحة."
        ]
    },
    "current_state": {
        "meta": {
            "id": "current_state",
            "name": "Current State - الوضع الحالي"
        },
        "points": "التجربة موزعة بين موقع قديم غير متجاوب وتطبيقات غير محدثة؛ واجهات الاستخدام غير موحدة وتفتقر للاتساق.استلام الطلبات يعتمد على مكالمات هاتفية ورسائل واتساب؛ إدخال البيانات يتم يدوياً مع أخطاء متكررة في الأسعار وتأكيد الطلب.لا يوجد تحديد موقع تلقائي؛ المستخدم يكتب العناوين يدوياً دون إحداثيات أو حفظ لعناوين متعددة أو تعيين عنوان افتراضي.غياب التتبع اللحظي للطلبات؛ تحديث الحالة يتم يدوياً من المطاعم وغالباً ما يتأخر أو لا يُحدث إطلاقاً.خيارات البحث والتصفية والفرز محدودة؛ الأداء ضعيف والبحث لا يدعم العربية بشكل كامل من حيث إزالة التشكيل وعدم حساسية الحالة.القوائم والأسعار والمخزون غير متزامنة؛ نفاد المنتجات أو توقفها لا ينعكس فوراً للمستخدمين مما يؤدي لإلغاء الطلبات بعد الدفع.لا توجد عربة موحدة متعددة المطاعم؛ كل مطعم يعالج الطلب منفصلاً مع غياب تطبيق تلقائي لقواعد الحد الأدنى للطلب والرسوم.الدفع الإلكتروني محدود أو متعثر؛ التكامل مع بوابة الدفع غير مستقر ولا توجد معالجة آلية لفشل الدفع أو طلبات الاسترداد.لا يوجد نظام قسائم وكوبونات فعال؛ العروض تدار يدوياً دون قواعد صلاحية أو استهداف أو تقارير عن الأداء.التوصيات الشخصية غير متوفرة؛ الأقسام على الصفحة الرئيسية ثابتة ولا تراعي الموقع أو السلوك أو التفضيلات.نظام التقييمات والمراجعات بدائي؛ لا يتم التحقق من أن المراجع قد أتم طلباً فعلياً ولا توجد أدوات فعالة لمكافحة الإساءة أو الإغراق.الإشعارات تقتصر على رسائل نصية قصيرة عامة؛ لا توجد إشعارات دفع على الهواتف ولا مركز تفضيلات للتحكم بالأنواع.الأداء العام ضعيف؛ لا يوجد تمرير لا نهائي أو تخزين مؤقت فعال؛ تحميل الصور بطيء لغياب شبكة توزيع المحتوى.قصور في الأمان والخصوصية؛ كلمات المرور قد تكون مخزنة أو منقولة بشكل غير آمن؛ غياب حماية من هجمات التخمين القسري ومن طلبات التزوير عبر المواقع على الويب.الدعم اللغوي غير مكتمل؛ العربية غير شاملة مع غياب دعم اتجاه من اليمين إلى اليسار وتنسيقات أرقام وتواريخ محلية.لوحة التحكم الإدارية محدودة؛ لا توجد صلاحيات دقيقة للمستخدمين ولا تقارير فورية عن المبيعات والأداء وسلوك المستخدم.التكامل مع خدمة التوصيل غير قياسي؛ مشاركة موقع المندوب تتم عبر روابط خارجية وغير مدمجة مع خريطة داخل التطبيق.لا توجد خريطة تفاعلية لعرض المطاعم القريبة؛ لا يمكن الفرز حسب المسافة أو وقت التوصيل مباشرة على الخريطة.إدارة العناوين غير موجودة عملياً؛ لا يوجد دفتر عناوين ولا حفظ للموقع للجلسات التالية ولا تحقق تلقائي من نطاق الخدمة.سياسات الإلغاء والاسترجاع غير واضحة؛ لا تُطبق قواعد حسب حالة الطلب مما يؤدي لنزاعات متكررة وتجربة عميل سيئة."
    },
    "actors": {
        "meta": {
            "id": "actors",
            "name": "Actors - الأطراف المشاركة"
        },
        "rows": [
            {
                "id": "ac_01",
                "role": "الزائر (مستخدم غير مسجل)",
                "description": "الزائر هو المستخدم الذي يتفاعل مع التطبيق دون إنشاء حساب. دوره الأساسي هو استكشاف المطاعم القريبة، تصفح الفئات والقوائم، ومعرفة الأسعار ووقت التوصيل التقديري قبل اتخاذ قرار التسجيل. من مسؤولياته ضبط اللغة (العربية/الإنجليزية)، تحديد الموقع عبر GPS أو اختيار موقع على الخريطة أو البحث بالمدينة، واستخدام البحث والتصفية والفرز لاكتشاف المطاعم والمنتجات. نطاق تفاعله يشمل صفحات الرئيسية والخريطة والفئات وقائمة المطاعم وتفاصيل المطعم والمنتج والسلة (مع قيود على الإتمام)، بالإضافة إلى الاطلاع على العروض. يعتمد الزائر على مزود الخرائط لتحديد الموقع والقياس بالمسافة، ويستفيد من التخزين المؤقت والأداء لتجربة تمرير لانهائي سلسة؛ ولا يتكامل مع بوابة الدفع حتى يُنشئ حسابًا. يضيف هذا الممثل قيمة تجارية بكونه رأس قمع التحويل، حيث تم تصميم التجربة لتشجيعه على التسجيل وإتمام الطلبات لاحقًا. كما أن بيانات تفاعله (المفضلات المؤقتة، عمليات البحث، المناطق المهتم بها) تساعد في تحسين خوارزميات التوصية والترند. ويحترم النظام تفضيلات الخصوصية والموافقة للزائر، خاصة في خدمات الموقع والإشعارات على الويب."
            },
            {
                "id": "ac_02",
                "role": "العميل المسجل",
                "description": "العميل المسجل هو المستخدم الذي يمتلك حسابًا ومصدق الهوية داخل المنصة. دوره الأساسي تنفيذ رحلة الشراء الكاملة من إضافة المنتجات إلى السلة وحتى الدفع وتتبع التوصيل ثم التقييم. من مسؤولياته إدارة الملف الشخصي وتغيير كلمة المرور وتفضيلات الإشعارات، وإدارة دفتر العناوين مع التحديد على الخريطة وتعيين عنوان افتراضي، بالإضافة إلى حفظ المطاعم المفضلة وإعادة الطلب واسترداد القسائم. يمتد نطاق تفاعله إلى جميع الوحدات تقريبًا: الصفحة الرئيسية المُخصصة، المطاعم والقوائم، السلة والدفع، الطلبات وسجلها، التتبع الحي على الخريطة، التقييمات والمراجعات، والإعدادات. يتكامل العميل مع بوابة الدفع لإتمام المدفوعات عبر بطاقات الائتمان أو غيرها، ومع مزود الخرائط لعمليات الترميز الجغرافي وحساب المسافات، ويتلقى تحديثات من مزود خدمة التوصيل عند الخروج للتسليم. يمثل هذا الممثل مصدر الإيرادات الأساسي ويقود مقاييس التكرار والاحتفاظ وقيمة الطلب المتوسط. كما يتيح جمع ملاحظاته وتقييماته تحسين الجودة واكتشاف المشكلات التشغيلية مبكرًا. وتؤمن المنصة خصوصيته عبر التشفير وإدارة الجلسات وسياسات الموافقة."
            },
            {
                "id": "ac_03",
                "role": "مشغّل المطعم/الشريك",
                "description": "مشغّل المطعم/الشريك هو الجهة المسؤولة عن وجود المطعم ومحتواه وعملياته على المنصة. دوره الأساسي نشر القوائم والمنتجات والأسعار والوفر، وضمان قبول الطلبات ومعالجتها ضمن أوقات العمل المحددة. من مسؤولياته تحديث ساعات العمل وخيارات الخدمة (توصيل/استلام)، ضبط رسوم التوصيل والحد الأدنى للطلب، إدارة العروض الخاصة والقسائم المرتبطة بمطعمه، ومتابعة الطلبات لتغيير حالاتها إلى مؤكد/قيد التحضير/خرج للتوصيل. يمتد نطاق تفاعله لوحدات إدارة المطاعم والقوائم والمنتجات والطلبات والتقارير الأساسية حول الأداء. يتكامل مع مزود خدمة التوصيل لإسناد السائقين وإرسال موقعهم عند توفر ذلك، ويتأثر بإعدادات مسؤول النظام مثل سياسات المراجعات والترويج، كما تعتمد دقته على مزود الخرائط لتموضع الفرع ونطاق الخدمة. يوفر هذا الممثل قيمة تجارية محورية عبر توفير العرض والوفرة وجودة التجربة النهائية للمستخدمين. كما أن قدرته على تحديث المخزون والأسعار لحظيًا تقلل الإلغاءات بسبب نفاد المخزون وتحسن هوامش الربح. وتتيح له المنصة زيادة الوصول والعملاء عبر الظهور في الأقسام الرائجة والمُوصى بها."
            },
            {
                "id": "ac_04",
                "role": "مسؤول النظام/المحتوى",
                "description": "مسؤول النظام/المحتوى هو الدور الداخلي الذي يحكم التهيئة العامة للمنصة وجودة المحتوى والامتثال. دوره الأساسي إدارة التصنيفات العامة، الإعلانات والبنرات، سياسات الخصوصية، وإعدادات اللغات والأذونات. من مسؤولياته أيضًا الإشراف على تقييمات ومراجعات العملاء، معالجة البلاغات وإزالة المحتوى المخالف، إدارة انضمام المطاعم والشركاء، وضبط قواعد القسائم والتسعير الترويجي. يغطي نطاق تفاعله وحدات الفئات والمطاعم والإعلانات والإشعارات وإعدادات الأمان والامتثال، بالإضافة إلى تقارير الأداء والمراقبة. يتكامل مع بوابة الدفع لضبط المفاتيح وإعدادات الأمان والتسويات، ومع مزود الخرائط لإدارة المفاتيح والحصص، ومع شركاء التوصيل لتكوين قنوات التتبع، كما يعتمد على البنية السحابية وCDN للوسائط. يحقق قيمة أعمال عبر ضمان الاستقرار والسرعة والامتثال القانوني، وتحسين الاكتشاف والطلب عبر حملات مستهدفة. كما يقلل المخاطر التشغيلية عبر سياسات الحماية من الاحتيال وإدارة الحقوق. ويضمن تجربة ثنائية اللغة متسقة بما في ذلك دعم RTL الكامل."
            },
            {
                "id": "ac_05",
                "role": "مزود خدمة التوصيل",
                "description": "مزود خدمة التوصيل هو جهة خارجية تقدم تعيين السعاة وتحديثات الموقع في الزمن الحقيقي. دوره الأساسي تمكين مرحلة \"خرج للتوصيل\" عبر إرسال إحداثيات السائق وحالته ورقم الاتصال عندما تكون الطلبات في الطريق. من مسؤولياته توفير واجهات تكامل آمنة لاستقبال تفاصيل الشحنة من المنصة أو من مشغّل المطعم، وتحديث الحالة حتى التسليم، والإبلاغ عن الأعطال أو التأخيرات. نطاق تفاعله يرتبط بوحدة الطلبات والتتبع والخرائط، ولا يتدخل في الدفع أو التسعير. يتكامل مع مزود الخرائط لحساب المسارات وتقدير زمن الوصول، ويتبادل البيانات مع المطعم حول الاستلام، كما يعتمد على سياسات المنصة لتقييد ظهور رقم السائق للعميل على تطبيقات الجوال فقط. يقدم هذا الممثل قيمة عالية بتحسين الشفافية وثقة المستخدم وتقليل مكالمات الدعم عبر التتبع الحي. كما يتيح تحسين العمليات عبر بيانات الأداء والوقت في الطريق. ويُمكّن إعادة الطلب والولاء عبر تجربة تسليم موثوقة ومتسقة."
            },
            {
                "id": "ac_06",
                "role": "بوابة الدفع",
                "description": "بوابة الدفع هي نظام خارجي يعالج المدفوعات الإلكترونية بأمان. دورها الأساسي تفويض وتحصيل المدفوعات وإرجاع حالات النجاح أو الفشل، مع دعم ثلاثية الأبعاد الآمنة عند اللزوم. من مسؤولياتها التعامل مع التحققات الاحتيالية، إدارة عمليات الإلغاء/الرد الجزئي وفق السياسات، وإصدار إشعارات الويب للمنصة لإغلاق الطلب أو إبطاله. نطاق تفاعلها يتركز في مرحلة الدفع ضمن عملية السداد، لكنه يمتد إلى إدارة طرق الدفع وإظهار رسائل الأخطاء والتحديات للعملاء. تتكامل البوابة مباشرة مع العميل المسجل أثناء الخروج، وترسل ردودًا للخادم لضمان تزامن الحالة مع الطلب، كما يتعامل مسؤول النظام مع إعداداتها ومفاتيحها. توفر قيمة تجارية عبر تمكين التحصيل الآمن، تقليل نسبة فشل المعاملات، والامتثال لمعايير PCI DSS، مما يزيد الإيرادات الصافية. كما تدعم سيناريوهات الدفع عند الاستلام غير الإلكترونية عبر تسجيل حالة \"نقد\" دون المعالجة لديها حين تكون مفعّلة."
            },
            {
                "id": "ac_07",
                "role": "مزود الخرائط وتحديد الموقع",
                "description": "مزود الخرائط وتحديد الموقع هو خدمة خارجية تقدم الخرائط والجيكودينغ وحساب المسافات. دوره الأساسي تمكين اكتشاف المطاعم حسب القرب، حفظ العناوين بدقة، وعرض تتبع الساعي على الخريطة عند توفره. من مسؤولياته تقديم واجهات برمجية للترميز الجغرافي العكسي، عرض طبقات الخرائط وصور التجزئة، وحساب المسافة بالكيلومترات وفق الإعدادات المحلية. يمتد نطاق تفاعله ليشمل إعداد الموقع في البداية، دفتر العناوين، صفحة المطاعم للفرز بحسب الأقرب، وتتبع الطلبات في الزمن الحقيقي. يتكامل مع أجهزة المستخدم للحصول على إحداثيات GPS، ومع مزود خدمة التوصيل لاستعراض المسار، كما يضبطه مسؤول النظام عبر المفاتيح والحصص ومحددات الاستخدام. يقدم قيمة أعمال حاسمة عبر تحسين الدقة والسياق المحلي، ما يرفع معدلات التحويل واكتشاف المطاعم المناسبة. كما يقلل الأخطاء في التوصيل عبر عناوين مُرمّزة بدقة ويعزز تجربة المستخدم في البيئات ثنائية اللغة."
            }
        ],
        "diagrams": [
            {
                "name": "مخطط استخدام: المصادقة وإدارة الحسابات",
                "description": "Use Case Diagram illustrating how the Guest and Registered Customer interact with account lifecycle operations. The Guest triggers Register, Login, and Reset Password, where Register extends to Verify Email/SMS. The Registered Customer manages Profile, Notification Preferences, and Address Book; Manage Addresses includes Geocode/Reverse Geocode, which connects to the Map & Geolocation Provider actor. The System/Admin actor governs Create/Deactivate Account, Enforce Password Policies, and Manage Privacy Terms which influence user flows. Associations show that all secure actions require authenticated sessions, and constraints like CSRF and password hashing are applied by the system.",
                "url": ""
            },
            {
                "name": "مخطط استخدام: تحديد الموقع والخريطة والبحث",
                "description": "Use Case Diagram focusing on location discovery and map-based exploration. Guest and Registered Customer can Detect Current Location (GPS), Choose Location on Map, and Search by City/Area; Persist Selected Location ensures the setting is stored for future sessions. Show Nearby Restaurants on Map includes Calculate Distance and Render Map Tiles provided by the Map & Geolocation Provider actor. Users can Filter and Sort directly on the map, and Open Restaurant Details extends from the map selection. The diagram emphasizes graceful fallback when GPS is denied and the dependency on accurate geocoding for proximity features.",
                "url": "https://brd-qi0f.onrender.com/static/b6c21139ea5c41fca3ace04226452b44.svg"
            },
            {
                "name": "مخطط استخدام: استكشاف المطاعم والقوائم والمنتجات",
                "description": "Use Case Diagram depicting how users discover supply. Guest and Registered Customer Browse Categories, List Restaurants with Filters/Sorting, and View Restaurant Details; View Details includes Compute ETA, Delivery Fee, and Distance leveraging the Map & Geolocation Provider. Browse Menu and View Product Details expose availability, badges, and pricing; Add to Cart is available to both, while Checkout requires authentication. The Restaurant Operator supports these use cases via Maintain Menu & Availability and Configure Opening Hours, which the listing depends on. Infinite Scrolling and Caching are included behaviors to ensure performance at scale.",
                "url": ""
            },
            {
                "name": "مخطط استخدام: السلة والدفع وإتمام الطلب",
                "description": "Use Case Diagram for cart and checkout orchestration. The Registered Customer Reviews Cart, Edits Quantities, Applies Coupon, and Proceeds to Checkout; Checkout includes Validate Minimum Order, Verify Address Serviceability (using Map & Geolocation Provider), and Select Payment Method. Process Online Payment is handled by the Payment Gateway, which returns success/failure and possibly 3DS challenges. Upon successful authorization, Confirm Order notifies the Restaurant Operator and creates an order record with an initial status. Error paths show coupon validation errors and payment declines feeding back into the edit/selection use cases.",
                "url": ""
            },
            {
                "name": "مخطط استخدام: تتبّع الطلب الحي وإدارة الحالة",
                "description": "Use Case Diagram outlining post-checkout operations. The Restaurant Operator updates order states (confirmed, preparing, out for delivery), while the Delivery Service Provider publishes courier GPS and contact phone. The Registered Customer views the Order Status Timeline and Live Courier Tracking; Live Tracking relies on Map & Geolocation Provider to render courier movement. Call Courier (mobile-only) is an extension use case available when status is out for delivery. The diagram also includes Cancel Order (subject to business rules and status) and Reorder, with real-time status notifications keeping the user informed.",
                "url": "https://brd-qi0f.onrender.com/static/9b351c2df1b14c998a22e32d588673f9.svg"
            },
            {
                "name": "مخطط استخدام: التقييمات والمراجعات والحوكمة",
                "description": "Use Case Diagram covering feedback and moderation. The Registered Customer can Submit Rating and Write Review with optional photos; this use case is permitted only after Order Delivered. The System/Admin performs Moderate Review, Approve/Reject, and Handle Abuse Reports, which gate whether reviews are published. The Restaurant Operator may Reply to Review to engage customers and provide service recovery. Publish Aggregated Ratings is an included behavior that updates restaurant and product scores displayed across listings.",
                "url": "https://brd-qi0f.onrender.com/static/6149d4aebcb241f6aaba4cc949974b02.svg"
            },
            {
                "name": "مخطط استخدام: العروض والقسائم والتخصيص",
                "description": "Use Case Diagram for promotions and personalization. The System/Admin creates Promo Banners, Schedules Campaigns, and defines global coupon rules; the Restaurant Operator creates restaurant-specific offers and coupons. The Registered Customer views targeted banners on Home and enters coupon codes during checkout; Validate Coupon checks eligibility, stacking, and expiration before Apply Discount. Apply Discount influences the final amount sent to the Payment Gateway in Process Online Payment. Personalized Recommendations are generated based on location, history, and preferences, affecting what the customer sees on Home and Restaurant pages.",
                "url": "https://brd-qi0f.onrender.com/static/15762a75afb24dad822f142d91027f87.svg"
            }
        ]
    },
    "dependency_and_integration": {
        "meta": {
            "id": "dependency_and_integration",
            "name": "Dependencies & Integrations - التبعيات والتكامل"
        },
        "description": "يعتمد نظام طلب الطعام على مجموعة تبعيات خارجية وتكاملات داخلية لضمان الدفع الآمن، تحديد الموقع، الإشعارات، والتتبع اللحظي، كما يلي:\n1) بوابة الدفع الإلكتروني: معالجة المدفوعات عبر بطاقات الائتمان والخصم مع دعم 3D Secure، التفويض والقبض والاسترداد، وويب هوكس لحالات النجاح أو الفشل. يستخدم REST عبر HTTPS ومفاتيح API منفصلة للبيئة التجريبية والإنتاج، مع مفاتيح إديمبوتنسي وتقليل نطاق الامتثال الأمني.\n2) مزود الخرائط والجيوكودينغ: خدمات تحديد وإرجاع الإحداثيات، إكمال العناوين، خرائط تفاعلية، ومصفوفة المسافات لحساب الزمن المقدر للتسليم. يتطلب مفاتيح منصّية، سياسات تحديد المعدل، وتخزين مؤقت للنتائج مع احترام الخصوصية والموافقة.\n3) خدمات الإشعارات الفورية: APNs لأجهزة iOS وFCM لأندرويد والويب لإرسال تنبيهات حالة الطلب والعروض. إدارة رموز الأجهزة، تخصيص مواضيع للإشعارات التسويقية مقابل الحرجة، ودعم إلغاء التكرار والأولوية العالية.\n4) مزود الرسائل القصيرة والبريد الإلكتروني: إرسال أكواد التحقق وإعادة تعيين كلمة المرور، وإيصالات الطلب وتحديثاته عبر قوالب عربية وإنجليزية. تكامل عبر SMTP أو API، إعدادات SPF/DKIM/DMARC، وتتبع حالات البلوك والارتداد عبر ويب هوكس.\n5) واجهة شريك التوصيل: استقبال تحديثات حالة الطلب وتتبع GPS للساعي على خريطة حية. تكامل عبر ويب هوكس موقّعة أو OAuth2، وآلية استقصاء احتياطية، مع مشاركة إحداثيات ومعلومات الاتصال للساعي على الجوال فقط وفق الأذونات.\n6) شبكة توصيل المحتوى CDN: تسليم صور المطاعم والمنتجات والبنرات مع تصغير وتحويل الصيغ، عناوين URL موقعة، وتجاوز تخزين مؤقت للصور لتحديثات المخزون والعروض.\n7) التحليلات والمراقبة: مزود تحليلات وأدوات تتبع الأعطال والأداء مع تفعيل حسب الموافقة، وعزل بيانات الإنتاج عن الاختبار، ولوحات مراقبة زمنية.\n8) نظام إدارة المحتوى الداخلي: لوحة إدارية لإدارة المطاعم والقوائم والتوفر والمراجعات، تكامل آمن عبر واجهات داخلية مع التحكم في الصلاحيات وتدقيق الإجراءات.\n9) التخزين المؤقت والرسائل: Redis للتخزين المؤقت للجلسات والقوائم والبحث المفلتر، ووسيط رسائل لنشر الأحداث مثل تحديثات الحالة وإرسال الإشعارات لضمان المرونة والموثوقية.",
        "diagrams": [
            {
                "name": "مخطط المكونات: تكامل الخدمات الخارجية الأساسية",
                "description": "Component Diagram: The Food Ordering System is composed of Client Apps (Mobile App and Web SPA), an API Gateway, and backend microservices: Auth Service, User/Profile Service, Address/Geo Service, Catalog Service (Categories, Restaurants, Menus, Products), Cart Service, Order Service, Payment Orchestrator, Notification Service, and Review Service. Integration Adapters connect the backend to external systems: Payment Gateway Adapter (handles tokenization, 3DS flows, capture/refund via REST and webhooks), Map/Geocoding Adapter (geocode, reverse geocode, distance matrix, map tiles), Push Adapter (APNs/FCM), SMS/Email Adapter, and Delivery Partner Adapter (webhooks/polling). Shared components include Redis Cache, Message Broker, and a Relational Database. Interactions: Clients call the API Gateway; the Order Service orchestrates pricing via Catalog, validates minimum order, reserves items, invokes Payment Orchestrator to create payment intents, subscribes to webhooks via Webhook Receiver; Notification Service sends transactional events via Push/SMS/Email; Address/Geo Service uses Map Adapter for ETA and distance. Error handling flows back through the Gateway with idempotency and retries.",
                "url": ""
            },
            {
                "name": "مخطط المكونات: دورة حياة الطلب والتتبع اللحظي",
                "description": "Component Diagram: Focused on the order lifecycle. The sequence includes: Cart Service emits a CheckoutRequested event to the Message Broker; Order Service validates rules (minimum order, availability via Catalog), then requests Payment Orchestrator to authorize payment through the Payment Gateway Adapter. Upon payment authorization, Order Service transitions status to confirmed and publishes OrderConfirmed. Restaurant/Kitchen Integration (internal admin portal or partner API) acknowledges preparation; when dispatched, Delivery Partner Adapter registers the delivery job and subscribes to courier location updates. A Webhook Receiver component ingests delivery status and GPS pings, normalizes them, and pushes updates to a Realtime Gateway (WebSocket/SSE). Notification Service sends stage-based push notifications. If payment fails or cancellation occurs before dispatch, Payment Orchestrator triggers void/refund and Order Service compensates state, emitting OrderCanceled. Data stores: Orders DB (ACID), Cache for active order lookups, and Audit Log for compliance.",
                "url": "https://brd-qi0f.onrender.com/static/3621a5091d1e40c78d6c115120b98275.svg"
            },
            {
                "name": "مخطط النشر: بنية الإنتاج الآمنة وعزل الشبكات",
                "description": "Deployment Diagram: Nodes include End-User Devices (iOS/Android Mobile, Web Browser) connecting over the Internet to DNS, CDN/WAF, and a Layer-7 Load Balancer. Inside a cloud VPC, there is a Public Subnet hosting the API Gateway/Ingress and a Private Subnet hosting an Auto-Scaling Group of Application Servers running backend services in containers. Supporting nodes: Relational Database Cluster (Primary/Replica) in a Data Layer subnet, Redis Cache cluster, and a Message Broker cluster. A Webhook Receiver service is exposed via a secure endpoint. Outbound-secured connections go to External Nodes: Payment Gateway (HTTPS with mutual TLS or HMAC), Map Provider (HTTPS with API keys and rate limits), APNs and FCM (platform-specific endpoints), SMS/Email Provider (HTTPS/SMTP with TLS), and Delivery Partner API (HTTPS, webhooks). Security controls: WAF filters, TLS termination at Load Balancer, service-to-service mTLS inside the mesh, security groups narrowing ports, secrets in a vault, and observability agents sending metrics/logs to a Monitoring SaaS.",
                "url": ""
            },
            {
                "name": "مخطط النشر: قناة التتبع الحي والإشعارات",
                "description": "Deployment Diagram: Nodes are Delivery Partner Webhook Endpoint (external), Internet, Webhook Receiver in the DMZ, Event Processor workers in a private compute cluster, Redis Pub/Sub and Message Broker for fan-out, Realtime Gateway (WebSocket/SSE) behind the Load Balancer, and Client Devices (mobile/web) maintaining persistent connections. The Webhook Receiver validates signatures and enqueues location/status messages. Event Processor enriches messages (order context, ETA via Map Provider) and publishes to Redis channels keyed by order ID. Realtime Gateway delivers updates to subscribed clients; Notification Service concurrently sends push notifications via APNs/FCM for critical state transitions. Failure paths include dead-letter queues and replay workers. Data persistence of tracking breadcrumbs is stored in a Time-Series table for short-term history and auditing.",
                "url": "https://brd-qi0f.onrender.com/static/8b96e3df2cc14dac86f95459a4093723.svg"
            }
        ]
    },
    "architecture": {
        "meta": {
            "id": "architecture",
            "name": "Architecture - هيكلية النظام"
        },
        "diagrams": [
            {
                "name": "مخطط تدفق تسجيل الدخول والمصادقة متعددة العوامل",
                "description": "Flow chart showing the end-to-end login process across Mobile App and Web UI hitting the Auth API behind an API Gateway, with a Rate Limiter and WAF at the edge. Elements include UI forms, Auth Service, Identity Store (users, passwords, MFA secrets), Session Service, Redis cache for throttling counters, and Email/SMS providers for OTP. The control flow branches on credential validation (valid/invalid), on whether MFA is enabled (TOTP/SMS), and on lockout thresholds after repeated failures; loops allow limited retry attempts with CAPTCHA escalation. Data flows include password hash verification against the Identity Store, generation of JWT access tokens and refresh tokens, and storage of session metadata with device and IP. The layering is explicit: Presentation (Mobile/Web), Edge (WAF/API Gateway), Business (Auth/Session), Data (User DB/Redis), and External (Email/SMS). Error handling covers expired OTPs, clock drift for TOTP, revoked refresh tokens, and disabled accounts. The business purpose is to provide secure, user-friendly authentication that resists brute force, supports MFA, and produces portable session tokens for subsequent authorized calls.",
                "url": ""
            },
            {
                "name": "هيكلية النظام الشاملة متعددة المنصات",
                "description": "System architecture diagram detailing clients (iOS, Android, Web) communicating via an API Gateway to domain services such as Auth, Catalog, Search, Cart, Pricing, Orders, Payments, Notifications, Reviews, Recommendation, and Localization. Components include a Postgres cluster for transactional data, Redis for caching and sessions, Elasticsearch for search and filtering, an object storage/CDN for images, and Kafka/RabbitMQ as the event bus. Connections show synchronous REST/gRPC calls through the Gateway, asynchronous event publishing to the bus, and integrations with external Payment Gateway, Map/Geocoding provider, and Push Notification service. The design layers are Presentation (clients), Edge (CDN, WAF, API Gateway), Services (microservices), Data (DBs, caches, search), and External (payments, maps, push). Cross-cutting modules like Observability (logs, metrics, traces), Feature Flags, and Config/Secrets Manager are annotated, with circuit breakers and retries for resilience. The business purpose is to scale reliably across platforms, enable rapid feature evolution per domain, and isolate external dependencies while ensuring performance and security.",
                "url": ""
            },
            {
                "name": "مخطط الفئات لإدارة الحساب والعناوين",
                "description": "Full class diagram including User, Profile, Address, AddressGeo, Session, NotificationPreference, LanguageSetting, and ConsentRecord. User has attributes (id, email, phone, status, createdAt) and methods (changePassword(), disable(), verifyContact()) with a one-to-one association to Profile and one-to-many to Address and Session. Address aggregates AddressGeo holding lat/long, geocode accuracy, and placeId; Address exposes methods (setDefault(), validateServiceability()) and flags for isDefault and label. NotificationPreference includes categories (orderStatus, promotions) and channels (push, web, email) with methods (enable(), disable()) and a composition relation with User; LanguageSetting stores locale and RTL flag. Session holds device info, refreshTokenId, expiry, and revocation status; ConsentRecord tracks privacy and notification consents with timestamps and versions. The layering reflects Domain (entities/value objects), Application (services manipulating these classes), and Infrastructure (repositories against Postgres/Redis). The business purpose is to formalize user identity, preferences, and addresses with clean relations that support secure sessions and accurate delivery locations.",
                "url": ""
            },
            {
                "name": "تدفق إعادة تعيين كلمة المرور عبر البريد وSMS",
                "description": "Flow chart covering password reset initiation from Web/Mobile UI to the Auth Service with a choice between Email Link or SMS OTP channels. Elements include Reset Controller, Token Store (short-lived reset tokens), Email/SMS providers, Password Policy Validator, and Rate Limiter. Decision nodes branch on whether the user account exists, whether the channel is verified, whether the token/OTP is valid and unexpired, and whether policy checks (length, complexity, reuse) pass; loops allow limited retries for OTP input. Control flow shows generating and storing a one-time token with expiry, sending notifications, receiving user input for new password, and invalidating tokens after use. Layers include Presentation (UI), Business (Auth Reset, Token issuance), Data (Token store in Redis and User DB for password hash), and External (Email/SMS gateways). Error handling covers nonexistent accounts (generic response), throttled requests, expired tokens, and delivery failures with user-facing messages and support guidance. The business purpose is to offer a secure yet convenient recovery path that minimizes account enumeration and enforces strong password hygiene.",
                "url": ""
            },
            {
                "name": "هيكلية خدمات الموقع والخريطة",
                "description": "Architecture diagram for Location Service integrating Mobile GPS, Web Geolocation API, Map Picker UI, and a Geocoding/Reverse Geocoding provider. Components include a Location Aggregator, Serviceability Checker, Distance Calculator, and a Cache (Redis) for geocode results and tile metadata, plus a Postgres table for persisted addresses. Flows show clients sending coordinates or search text to the API, which queries the provider, normalizes results (placeId, address lines, geohash), and stores them while returning precise coordinates. Decision logic in the Serviceability Checker determines if the selected address lies within the restaurant delivery polygon or radius and branches to either proceed or display “out of range”. Layers are Presentation (Map UI), Services (Location, Serviceability), Data (Address store/cache), and External (Maps/Geocoding). Error handling covers permission denial, geocoding failures, ambiguous addresses (prompt for refinement), and stale GPS readings (freshness threshold). The business purpose is to anchor discovery and delivery validity to accurate, cached geospatial data and to ensure consistent map behavior across platforms.",
                "url": ""
            },
            {
                "name": "تدفق اكتشاف المطاعم والبحث مع ترشيح وفرز وتمرير لانهائي",
                "description": "Flow chart describing how users search and browse restaurants with filters and sorts using a debounced query builder. Elements include the Restaurants UI, Debounce Controller, Search API, Elasticsearch index, and a Cursor-based Paginator. The flow branches on whether a location is available to compute distance and “open now” filters, and whether filters such as category, price level, and ETA are applied; loops fetch additional pages on scroll until no more results. Data flows show the UI constructing a query DSL, the Search Service translating it into ES filters/sorts, and returning IDs resolved by the Catalog Service for enriched data. Layering includes Presentation (filters UI), Services (Search/Catalog), Data (ES index and Postgres for authoritative data), and Cache (popular queries). Error handling covers empty results (suggest relax filters), index timeouts (fallback to cached popular lists), and invalid inputs (sanitized and normalized). The business purpose is to provide fast, relevant discovery while supporting complex combinations of filters and stable pagination for consistent UX.",
                "url": ""
            },
            {
                "name": "مخطط الفئات لكاتالوج المطاعم والقوائم والمنتجات",
                "description": "Class diagram capturing Restaurant, Cuisine, Category, Menu, MenuSection, Product, ProductOptionGroup, ProductOption, AddOn, Badge, AvailabilityWindow, PriceVariant, and InventoryItem. Restaurant aggregates Menus, references Cuisine and Category many-to-many, and maintains attributes for deliveryFee, minOrder, openingHours, and service flags (delivery, pickup). Product includes attributes (id, title, description, basePrice, rating, images) and supports multiple PriceVariant entries (e.g., sizes) and AvailabilityWindow to reflect time-based availability. ProductOptionGroup defines required/optional rules, min/max selections, and price impacts via ProductOption or AddOn links; methods validateSelection() ensure cart compliance. InventoryItem tracks stock status and threshold alerts; Badge provides UI flags like spicy, vegan, bestseller, and recommended. Repositories and services around these classes map to the Catalog and Inventory services in the application layer, backed by Postgres and an image CDN. The business purpose is to model a flexible, rule-rich catalog that drives accurate pricing, availability, and filtering in the storefront.",
                "url": ""
            },
            {
                "name": "هيكلية سلة التسوق ومحرك التسعير والقسائم",
                "description": "Architecture diagram outlining the Cart Service working with a Pricing Engine, Tax Service, Fees Calculator, Coupon Validator, and Currency/Localization module. Clients send cart mutations to the API, which persists cart state in Redis (for speed) and references Catalog for authoritative product and option pricing while applying rules. The Pricing Engine composes line items, options, taxes, delivery fees, service fees, and coupon discounts, with idempotent recalculation on every change; control flows indicate optimistic locking on cart versions. External dependencies include Coupon/Promotion service for validation and usage limits, and a Rules Registry for region-specific tax logic. Layers include Presentation (cart UI), Services (Cart, Pricing, Coupon), Data (Redis for carts, Postgres for coupons), and External (tax tables if externalized). Error handling addresses invalid option selections, expired or ineligible coupons, minimum order enforcement, and concurrency conflicts with rollback to last valid version. The business purpose is to guarantee transparent, correct totals and a responsive editing experience that reflects business rules consistently.",
                "url": ""
            },
            {
                "name": "مخطط تدفق الدفع والدفع النهائي (Checkout)",
                "description": "Flow chart mapping the end-to-end checkout: summary review, address selection/creation, serviceability check, payment method selection, promo validation, and final confirmation. Elements include Checkout Controller, Address Validator, Serviceability Checker, Payment Orchestrator, Payment Gateway, and Order Service. Decisions branch on serviceability (in/out of delivery area), restaurant minimum order compliance, payment method availability (online, COD), 3-D Secure requirements, and payment response (success, failure, requires_action). The flow creates a PaymentIntent, handles customer authentication if required, and upon success atomically creates the Order, reserves inventory if configured, and records timeline events; on failure it offers retry or fallback to COD when allowed. Layering spans Presentation (checkout UI), Services (Address, Order, Payment, Pricing), Data (Postgres for orders/payments, Redis locks), and External (payment gateway, notifications). Error handling covers stale cart prices (recalculate), address verification failure, payment timeouts, and double-click protection via idempotency keys. The business purpose is to ensure reliable conversion with clear user feedback and robust transactional integrity across payment outcomes.",
                "url": ""
            },
            {
                "name": "هيكلية إدارة الطلبات والتتبع مع تكامل شركة التوصيل",
                "description": "Architecture diagram for Order Management including Order Service, Status Timeline Service, Delivery Integration Adapter, GPS Aggregator, Real-time Gateway (WebSockets/SSE), and Notification Service. The Order Service stores core order data, emits events (placed, confirmed, preparing, out_for_delivery, delivered, canceled) to the event bus, and updates the Timeline. Delivery Integration consumes partner webhooks for courier assignment and location updates, normalizes them, and publishes courier positions to the GPS Aggregator. Connections show Web and Mobile clients subscribing to live updates via Real-time Gateway and viewing maps populated from the GPS stream; the system falls back to status polling when GPS is unavailable. Layers include Services (Order, Tracking), Data (Postgres for orders, time-series store or Redis for GPS), Edge (real-time gateway), and External (delivery providers). Error handling covers out-of-sequence webhooks, provider downtime (circuit breaker with queued retries), and privacy redaction after delivery completion. The business purpose is to deliver trustworthy, real-time visibility into order progress and courier location while cleanly abstracting diverse delivery partners.",
                "url": ""
            },
            {
                "name": "مخطط الفئات للطلب وعناصره والدفع والتوصيل",
                "description": "Class diagram modeling Order, OrderItem, OptionSelection, AppliedCoupon, Payment, Transaction, Delivery, Courier, TimelineEvent, and Refund. Order aggregates OrderItem (productId, quantity, unitPrice, option totals) and OptionSelection linking to ProductOption with pricing impact; methods include calculateTotals(), canCancel(), and transitionStatus(). Payment references Transactions (authorization, capture, void) with amounts, gatewayResponse, and idempotencyKey; Refund references a Payment and has reason, status, and processedAt. Delivery contains address, ETA, fee, and a relation to Courier (name, phone, providerId), with methods updateLocation() and complete(). TimelineEvent records status changes with actor (system, restaurant, courier) and metadata; AppliedCoupon contains couponId, discount value, and conditions matched. Repositories per aggregate map to Order and Payment schemas, with event publishing on mutations to keep projections and notifications in sync. The business purpose is to maintain a cohesive order aggregate that supports pricing integrity, payment lifecycle, and delivery tracking.",
                "url": "https://brd-qi0f.onrender.com/static/6e801f90580e4ed8b0b6883b8742ef00.svg"
            },
            {
                "name": "تدفق الإشعارات والدفع اللحظي والخيارات",
                "description": "Flow chart depicting notification orchestration from domain events to user-facing channels with respect to preferences and permissions. Elements include Event Producer (order status, promotions, recommendations), Notification Orchestrator, Preference Store, Channel Dispatchers (Mobile Push, Web In-app), and Mobile/Web Permission Checkers. Decision nodes branch on user opt-in per category, device permission status, do-not-disturb windows, and operational throttling; loops handle retry attempts for transient push gateway failures with exponential backoff. Data flows retrieve localized templates from the Localization Service and merge user and order data before dispatch. The layered view has Services (Notification Orchestrator, Template Engine), Data (Preference Store in Postgres/Redis), Edge (push services), and External (APNs/FCM). Error handling includes dead-letter queues for undeliverable messages, suppression lists for invalid tokens, and deduplication to avoid spam. The business purpose is to deliver timely, personalized, and compliant notifications that improve engagement without violating user consent.",
                "url": ""
            },
            {
                "name": "هيكلية التقييمات والمراجعات والاعتدال",
                "description": "Architecture diagram for Reviews and Ratings comprising Reviews Service, Moderation Service, ML Scoring service, Media Storage/CDN, and Admin Console. Clients submit reviews post-delivery, the Reviews Service validates order ownership and schedules moderation, storing text and ratings in Postgres and images in object storage. The Moderation pipeline fetches items, runs ML spam/toxicity scoring, virus scans images, and applies automated rules before placing items into an admin queue. Connections show accepted reviews being published to the Catalog for aggregate ratings and search index updates, while rejected items generate user notifications with reasons. Layers: Presentation (user review UI, admin console), Services (Reviews, Moderation, ML), Data (Postgres, CDN), and External (AV scanning, optional ML). Error handling covers duplicate reviews, excessive edits, oversized media, and appeals workflow in the admin console. The business purpose is to ensure trustworthy, policy-compliant content that informs users and protects brand integrity.",
                "url": ""
            },
            {
                "name": "تدفق إدارة المفضلة مع واجهة متفائلة وعدم التكرار",
                "description": "Flow chart for Favorites management where users add or remove restaurants with optimistic UI updates and idempotent operations. Elements are Favorite UI Controller, Favorites API, Idempotency Store, and a Read Model cache for quick retrieval. Decision nodes check authentication status, existence of the favorite pair (user, restaurant), and deduplication via idempotency keys; loops handle retry on network failures with conflict detection. The control flow applies an immediate local update, sends the request with an idempotency key, and reconciles with the server response, rolling back UI state on definitive errors. Layers include Presentation (UI state), Services (Favorites, Idempotency), Data (Postgres for records, Redis cache), and Edge (API Gateway). Error handling covers offline mode (queue and later sync), rate limits for abuse, and consistency repair jobs to reconcile cache and source of truth. The business purpose is to keep favorites responsive and reliable while preventing duplicates and maintaining a consistent list across devices.",
                "url": ""
            },
            {
                "name": "هيكلية التدويل والتموضع (i18n/L10n) والاتجاه من اليمين لليسار",
                "description": "Architecture diagram for Internationalization/Localization including Localization Service, Resource Bundle Store, Formatting Library (number/date/currency), and RTL Layout Engine. Clients request strings by key and locale, with fallback chains (ar → ar-EG → en) and runtime variable interpolation; the service returns localized assets including images if needed. Connections highlight integration with Catalog content fields supporting bilingual entries and with Notifications Template Engine for localized pushes. Layers involve Presentation (RTL-capable UI, font selection), Services (Localization API), Data (resource bundles in storage with versioning), and Admin tools for translation management. Error handling includes missing key fallbacks, pluralization rules, and cached bundles invalidation strategies. The business purpose is to ensure complete Arabic/English coverage with proper RTL support and culturally correct formatting, improving accessibility and conversion.",
                "url": ""
            },
            {
                "name": "تدفق إدارة الجلسة وتحديث الرموز وتأمين CSRF",
                "description": "Flow chart detailing session lifecycle with JWT access tokens and refresh tokens across Web and Mobile. Elements include Session Service, Token Issuer, Refresh Token Store, CSRF Protection for Web (same-site cookies and double-submit token), and Revocation List. Decision nodes branch on token expiry, refresh validity, device mismatch, and revocation status; loops allow controlled refresh attempts with backoff to mitigate token theft attempts. Data flows show issuing tokens at login, rotating refresh tokens on each refresh, persisting device metadata, and embedding claims like roles and locale. Layers are Presentation (clients storing tokens securely), Services (Auth/Session), Data (Refresh store in Postgres/Redis, revocation cache), and Edge (WAF/Rate limiter). Error handling includes forced logout on anomaly detection (impossible travel), CSRF failures on unsafe web requests, and session kill on password change. The business purpose is to balance security and usability by providing stable sessions, safe refresh, and web-specific CSRF protection.",
                "url": ""
            },
            {
                "name": "هيكلية التحليلات والتوصيات الشخصية",
                "description": "Architecture diagram for Analytics and Recommendations, with Event Collection SDK, Stream Ingestion (Kafka), Stream Processing (Flink/Spark), Feature Store, Model Training (offline) and Model Serving API. Clients emit events for views, clicks, cart actions, orders, and ratings; processors aggregate features like recency, frequency, monetary value, cuisine affinity, and location context. Connections show the Recommendation Service querying the Feature Store and Model Serving to render sections like Trending, Recommended for You, and Nearest, with A/B testing via Experiment Service. Layers include Presentation (widgets), Services (Recommendation, Experiment), Data (Data Lake, Feature Store, Warehouse), and External (ML platform). Error handling covers late/duplicate events (exactly-once semantics), model fallback to popularity baselines, and privacy filters removing PII before storage. The business purpose is to deliver personalized, measurable experiences that increase discovery and conversion while respecting privacy.",
                "url": ""
            },
            {
                "name": "هيكلية الأمان والخصوصية والمراقبة",
                "description": "Security architecture diagram covering WAF, API Gateway with OAuth2 scopes, IAM for service-to-service auth, Secrets Manager, KMS for encryption, and Audit Logging with SIEM integration. Data at rest is encrypted in Postgres and object storage, TLS enforces in-transit security, and token introspection is applied on sensitive endpoints. Connections include rate limiting, IP reputation checks, and anomaly detection feeding alerts to on-call with dashboards in Observability stack. Layers span Edge (WAF/Gateway), Services (authz middleware, data access), Data (encrypted stores, audit logs), and External (payment PCI environment, threat intel). Decision points enforce PII minimization, data retention windows, and access reviews; break-glass procedures are logged and time-limited. The business purpose is to reduce breach risk, comply with regulations, and create actionable visibility into system health and security events.",
                "url": "https://brd-qi0f.onrender.com/static/7abfddb295084847bc1e4166a6d6dec5.svg"
            },
            {
                "name": "تدفق إدارة العنوان مع تحديد على الخريطة والتحقق الجغرافي",
                "description": "Flow chart for Address management allowing users to add/edit/delete addresses with map pin selection and geocoding. Elements include Address Form UI, Map Picker, Geocoding Service, Duplicate Detector, and Serviceability Checker. Decision nodes branch on GPS permission, geocode confidence (high/medium/low), duplicate detection (same geohash and label), and serviceability (inside delivery zones); loops allow users to refine the pin or search terms. Data flows persist the normalized address with placeId, coordinates, and formatted lines, marking default address if chosen and recalculating nearest restaurants cache. Layers are Presentation (form and map), Services (Location, Address Book), Data (Postgres for addresses, Redis cache), and External (Maps provider). Error handling includes permission denial fallback to city/area selection, ambiguous addresses prompting clarification, and validation errors for missing fields. The business purpose is to ensure accurate, deduplicated addresses that enable reliable delivery and relevant discovery.",
                "url": ""
            },
            {
                "name": "مخطط الفئات لنظام المدفوعات والاستردادات والإيصالات",
                "description": "Class diagram for Payments domain including PaymentMethod, PaymentIntent, Transaction, Capture, Refund, Dispute, Receipt, GatewayProvider, and WebhookEvent. PaymentMethod stores card tokenization references or COD flags, with methods for verify() and setDefault(); PaymentIntent represents the intent with amount, currency, status, and 3DS requirements. Transaction records authorization/capture/void with gatewayResponse, idempotencyKey, and timestamps, while Capture references the intent and supports partial amounts; Refund links to Transaction and includes reason, status, and reconciliationId. Dispute tracks chargebacks with evidence links and deadlines; Receipt composes line items, taxes, and totals with localization and is associated to Order and Payment. GatewayProvider encapsulates vendor-specific parameters and retry rules; WebhookEvent persists inbound gateway notifications for reconciliation and out-of-order handling. Repositories and services implement a state machine across these entities, ensuring consistency with Orders. The business purpose is to model complex payment lifecycles cleanly, supporting partial captures, refunds, disputes, and compliant receipt generation.",
                "url": ""
            }
        ]
    },
    "functional_requirements": {
        "meta": {
            "id": "functional_requirements",
            "name": "Functional Requirements - المتطلبات الوظيفية"
        },
        "items": [
            {
                "id": "fr_001",
                "title": "تسجيل المستخدم",
                "description": "الغرض: تمكين المستخدمين من إنشاء حساب للاستفادة من الخدمات. النطاق: يشمل التسجيل بالبريد أو الهاتف ويستبعد التسجيل الاجتماعي. سير العمل: يدخل البيانات ويتلقى رمز تحقق ويؤكد الحساب. التفاعلات: المستخدم والواجهة وخدمة الهوية وقاعدة البيانات ومزود الرسائل. النواتج: حساب مُنشأ أو أخطاء تحقق مع رسائل واضحة.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "يسمح بإدخال بريد أو هاتف صحيح.",
                    "إرسال رمز تحقق خلال ثوان.",
                    "رفض الرموز المنتهية أو الخاطئة.",
                    "إنشاء الحساب وتخزين البيانات الأساسية.",
                    "عرض رسالة نجاح أو سبب الفشل."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل التسجيل",
                        "description": "Sequence Diagram: User→UI→Auth Service→DB→SMS/Email Gateway→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_002",
                "title": "تسجيل الدخول",
                "description": "الغرض: تمكين الوصول الآمن للوظائف المحمية. النطاق: يشمل البريد أو الهاتف وكلمة المرور ويستبعد التعامل كضيف. سير العمل: يدخل الاعتماديات، يتحقق النظام، يُنشئ جلسة صالحة. التفاعلات: المستخدم والواجهة وخدمة الهوية وقاعدة البيانات. النواتج: جلسة مفعلة أو رسائل خطأ وإقفال مؤقت بعد محاولات.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "تحقق من البريد/الهاتف بصيغة صحيحة.",
                    "التحقق من كلمة المرور المرمزة.",
                    "إرجاع توكن جلسة صالح.",
                    "قفل الحساب بعد محاولات فاشلة.",
                    "عرض سبب الرفض بوضوح."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل الدخول",
                        "description": "Sequence Diagram: User→UI→Auth Service→DB→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_003",
                "title": "إعادة تعيين كلمة المرور",
                "description": "الغرض: استعادة الوصول عند نسيان كلمة المرور. النطاق: يشمل البريد أو الهاتف والتحقق ويستبعد الدعم اليدوي. سير العمل: يطلب الاستعادة، يستلم رمزاً، يحدد كلمة جديدة. التفاعلات: المستخدم والواجهة وخدمة الهوية ومزود الرسائل. النواتج: كلمة محدثة أو أخطاء تحقق مع إرشادات.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "طلب رمز استعادة بنجاح.",
                    "إرسال رمز لمرة واحدة.",
                    "رفض رموز منتهية.",
                    "تعيين كلمة جديدة بمعايير أمان.",
                    "تأكيد نجاح العملية."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل الاستعادة",
                        "description": "Sequence Diagram: User→UI→Auth Service→SMS/Email Gateway→DB→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_004",
                "title": "إدارة الجلسات",
                "description": "الغرض: ضمان جلسات آمنة ومستقرة للمستخدمين. النطاق: يشمل إنشاء، تحديث، إنهاء، وانتهاء تلقائي للجلسات. سير العمل: يُصدر توكن، يُنعش عند النشاط، ينتهي بالخمول. التفاعلات: الواجهة وخدمة الهوية ومخزن الجلسات. النواتج: توكن صالح أو انتهاء مع إعادة تسجيل.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "إصدار توكن عند الدخول.",
                    "انتهاء التوكن بعد فترة خمول.",
                    "إمكانية تسجيل الخروج الفوري.",
                    "منع استخدام توكن منتهي.",
                    "تجديد التوكن عند النشاط."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل الجلسات",
                        "description": "Sequence Diagram: User→UI→Auth Service→Session Store→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_005",
                "title": "ملف المستخدم وتحديث البيانات",
                "description": "الغرض: تمكين إدارة البيانات الشخصية والتفضيلات. النطاق: يشمل الاسم والبريد والهاتف وكلمة المرور والإشعارات. سير العمل: يعرض البيانات، يعدل الحقول، يحفظ التغييرات بعد تحقق. التفاعلات: المستخدم والواجهة وخدمة الملف وقاعدة البيانات. النواتج: بيانات محدثة أو أخطاء تحقق مع توضيح الحقول.",
                "priority": "متوسط",
                "acceptance_criteria": [
                    "عرض البيانات الحالية بدقة.",
                    "تحقق من صيغ البريد والهاتف.",
                    "حفظ التغييرات المصرح بها.",
                    "إشعار المستخدم بنجاح الحفظ.",
                    "رفض الحقول غير الصالحة."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل تحديث الملف",
                        "description": "Sequence Diagram: User→UI→Profile Service→DB→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_006",
                "title": "إدارة العناوين",
                "description": "الغرض: تسهيل حفظ عناوين التوصيل بدقة. النطاق: يشمل إضافة، تعديل، حذف، وتعيين الافتراضي. سير العمل: يدخل العنوان، يُحوّل جغرافيًا، يحفظ مع وسم افتراضي. التفاعلات: المستخدم والواجهة وخدمة العناوين وواجهة خرائط وقاعدة البيانات. النواتج: عنوان محفوظ أو خطأ تحقق أو فشل جغرافي.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "إضافة عنوان مع تحديد موقع.",
                    "تعيين عنوان افتراضي واحد.",
                    "تحرير وحذف العناوين بنجاح.",
                    "فشل الجغرفة يظهر رسالة مفهومة.",
                    "تخزين الإحداثيات بدقة."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل العناوين",
                        "description": "Sequence Diagram: User→UI→Address Service→Geocoding API→DB→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_007",
                "title": "تحديد الموقع عبر GPS",
                "description": "الغرض: توفير تجربة قريبة جغرافيًا تلقائيًا. النطاق: يشمل طلب إذن واستخدام GPS ويستبعد التتبع الدائم. سير العمل: يطلب الإذن، يقرأ الإحداثيات، يعيّن الموقع الحالي. التفاعلات: المستخدم والجهاز والواجهة وخدمة الموقع ومزود الخرائط. النواتج: موقع محدد أو رسائل توضيحية عند رفض الإذن.",
                "priority": "متوسط",
                "acceptance_criteria": [
                    "طلب إذن الموقع وفق السياسات.",
                    "تحديد الإحداثيات بدقة مقبولة.",
                    "تحديث العنوان الحالي تلقائيًا.",
                    "توفير بدائل عند الرفض.",
                    "حفظ الموقع للجلسة."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل تحديد GPS",
                        "description": "Sequence Diagram: User→Device GPS→UI→Location Service→Map API→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_008",
                "title": "تحديد الموقع عبر الخريطة",
                "description": "الغرض: تمكين اختيار موقع دقيق يدويًا. النطاق: يشمل سحب المؤشر والبحث بالخريطة ويستبعد GPS. سير العمل: يفتح الخريطة، يضع دبوسًا، يؤكد العنوان. التفاعلات: المستخدم والواجهة ومكتبة الخرائط وخدمة العناوين. النواتج: موقع محفوظ أو تحذير بعدم إمكانية الخدمة.",
                "priority": "متوسط",
                "acceptance_criteria": [
                    "فتح خريطة قابلة للتكبير.",
                    "إسقاط دبوس وتحريكه.",
                    "عكس جغرافي لاسم العنوان.",
                    "تحقق الخدمة للمنطقة المحددة.",
                    "حفظ الاختيار للاستخدام."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل اختيار الخريطة",
                        "description": "Sequence Diagram: User→UI→Map SDK→Address Service→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_009",
                "title": "اختيار المدينة أو المنطقة",
                "description": "الغرض: دعم التصفح دون إذن موقع. النطاق: يشمل قائمة مدن ومناطق قابلة للبحث. سير العمل: يكتب اسمًا، يختار عنصرًا، تُحدث التصفية. التفاعلات: المستخدم والواجهة وخدمة المواقع وقاعدة البيانات. النواتج: موقع محدد أو رسالة خلو التغطية.",
                "priority": "متوسط",
                "acceptance_criteria": [
                    "عرض قائمة قابلة للبحث.",
                    "اختيار مدينة يحدث النتائج.",
                    "حفظ الاختيار للجلسة.",
                    "رسالة واضحة عند عدم التغطية.",
                    "إمكانية تغيير الاختيار بسهولة."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل اختيار المدينة",
                        "description": "Sequence Diagram: User→UI→Location Service→DB→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_010",
                "title": "تبديل اللغة عربي/إنجليزي",
                "description": "الغرض: تقديم واجهة ثنائية اللغة متكاملة. النطاق: يشمل النصوص والاتجاه والتواريخ والعملات. سير العمل: يختار اللغة، تُحمّل الموارد، تُطبق الإعدادات. التفاعلات: المستخدم والواجهة وخدمة الترجمة ومخزن الإعدادات. النواتج: لغة مفعلة أو رسالة فشل تحميل.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "تبديل فوري دون إعادة تشغيل.",
                    "دعم RTL عند العربية.",
                    "تعريب الرسائل والتواريخ.",
                    "حفظ اللغة للمستخدم.",
                    "معالجة فشل الموارد بسلاسة."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل تبديل اللغة",
                        "description": "Sequence Diagram: User→UI→I18n Service→Resource Store→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_011",
                "title": "الإعدادات وتفضيلات الإشعارات",
                "description": "الغرض: تمكين التحكم بالخصوصية والتنبيهات. النطاق: يشمل أصناف الإشعارات والموافقة والأصوات. سير العمل: يفتح الإعدادات، يغيّر الخيارات، يحفظ التفضيلات. التفاعلات: المستخدم والواجهة وخدمة الإشعارات وقاعدة البيانات. النواتج: تفضيلات محفوظة وتطبيق فوري أو رسائل خطأ.",
                "priority": "متوسط",
                "acceptance_criteria": [
                    "تبديل تشغيل/إيقاف لكل فئة.",
                    "حفظ التغييرات فورًا.",
                    "احترام صلاحيات الجهاز.",
                    "إشعار بنجاح الحفظ.",
                    "رجوع افتراضي عند الفشل."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل تفضيلات الإشعارات",
                        "description": "Sequence Diagram: User→UI→Notification Service→DB→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_012",
                "title": "بحث عالمي بالمطاعم والأطباق",
                "description": "الغرض: تسريع العثور على خيارات مناسبة. النطاق: يشمل البحث بالنص والترشيح والفرز. سير العمل: يدخل استعلامًا، تُطبّق فلاتر، تُعرض النتائج. التفاعلات: المستخدم والواجهة وخدمة البحث وقاعدة البيانات. النواتج: نتائج دقيقة أو رسالة لا توجد مطابقات.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "دعم العربية والإنجليزية.",
                    "تطبيق فلاتر متعددة معاً.",
                    "فرز حسب الصلة أو التقييم.",
                    "إظهار حالة التحميل.",
                    "لا نتائج تعرض اقتراحات."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل البحث",
                        "description": "Sequence Diagram: User→UI→Search Service→DB→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_013",
                "title": "خريطة المطاعم القريبة",
                "description": "الغرض: عرض المطاعم حسب المسافة بصريًا. النطاق: يشمل دبابيس، مسافات، فلاتر مباشرة. سير العمل: يحسب المسافات، يعرض الدبابيس، يفتح التفاصيل. التفاعلات: المستخدم والواجهة وخدمة المطاعم وواجهة الخرائط. النواتج: قائمة خرائط محدثة أو رسائل فشل الموقع.",
                "priority": "متوسط",
                "acceptance_criteria": [
                    "حساب المسافة بالكيلومترات.",
                    "فلترة على الخريطة مباشرة.",
                    "فتح بطاقة مطعم عند النقر.",
                    "تحديث فوري عند تغيير الموقع.",
                    "معالجة أخطاء الخرائط."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل خريطة المطاعم",
                        "description": "Sequence Diagram: User→UI→Restaurant Service→Map API→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_014",
                "title": "الصفحة الرئيسية الديناميكية",
                "description": "الغرض: تقديم محتوى مخصص وجذاب. النطاق: يشمل أقسام قريبة، موصى بها، رائجة، وإعلانات. سير العمل: يجلب البيانات، يرتب الأقسام، يعرض البطاقات. التفاعلات: المستخدم والواجهة وخدمة التوصيات وخدمة الإعلانات. النواتج: بطاقات محدثة أو رسائل نقص بيانات.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "جلب أقسام متعددة بكفاءة.",
                    "إظهار طلب قيد التنفيذ إن وجد.",
                    "دعم إعادة الطلب السريع.",
                    "تحميل كسول للصور.",
                    "التعامل مع فشل قسم مستقل."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل الصفحة الرئيسية",
                        "description": "Sequence Diagram: User→UI→Recommendation Service→Ads Service→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_015",
                "title": "قوائم الفئات بالترشيح والفرز",
                "description": "الغرض: تنظيم اكتشاف الأطعمة حسب الفئات. النطاق: يشمل بحث بالاسم وفرز متعدد. سير العمل: يجلب الصفحات، يطبق الترشيح، يعرض النتائج. التفاعلات: المستخدم والواجهة وخدمة الفئات وقاعدة البيانات. النواتج: قائمة مصفاة أو رسالة لا عناصر.",
                "priority": "متوسط",
                "acceptance_criteria": [
                    "بحث نصي غير حساس للحالة.",
                    "فرز بالاسم أو عدد المطاعم.",
                    "ترقيم صفحات لانهائي.",
                    "مؤشرات تحميل ظاهرة.",
                    "تعامل مع نهاية المحتوى."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل فئات الطعام",
                        "description": "Sequence Diagram: User→UI→Category Service→DB→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_016",
                "title": "تفاصيل الفئة وعرض مطاعمها",
                "description": "الغرض: ربط الفئات بمطاعمها بوضوح. النطاق: يشمل معلومات الفئة وقائمة المطاعم المرتبطة. سير العمل: يفتح الفئة، يجلب المطاعم، يطبق فلاتر. التفاعلات: المستخدم والواجهة وخدمات الفئات والمطاعم. النواتج: قائمة ملائمة أو إشعار عدم توفر.",
                "priority": "متوسط",
                "acceptance_criteria": [
                    "عرض وصف وصورة الفئة.",
                    "جلب المطاعم التابعة.",
                    "دعم الفلاتر الأساسية.",
                    "التصفح اللامتناهي فعال.",
                    "التعامل مع عدم النتائج."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل تفاصيل الفئة",
                        "description": "Sequence Diagram: User→UI→Category Service→Restaurant Service→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_017",
                "title": "قائمة المطاعم مع فلاتر",
                "description": "الغرض: تسهيل إيجاد مطاعم مناسبة بسرعة. النطاق: يشمل فلاتر زمن التوصيل والسعر والتقييم والموقع. سير العمل: يحدد الفلاتر، يطبق الفرز، يتصفح الصفحات. التفاعلات: المستخدم والواجهة وخدمة المطاعم وقاعدة البيانات. النواتج: نتائج مطابقة أو رسائل لا مطابقات.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "فلتر مفتوح الآن يعمل.",
                    "فرز حسب الأقرب.",
                    "دمج عدة فلاتر بدون تعارض.",
                    "دعم تصاعدي/تنازلي.",
                    "عرض عدد النتائج."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل قائمة المطاعم",
                        "description": "Sequence Diagram: User→UI→Restaurant Service→DB→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_018",
                "title": "تفاصيل المطعم ومعلوماته",
                "description": "الغرض: تقديم معلومات شاملة قبل الطلب. النطاق: يشمل وصفًا، ساعات العمل، الرسوم، والاتصال. سير العمل: يفتح الصفحة، يجلب البيانات، يعرض القوائم. التفاعلات: المستخدم والواجهة وخدمات المطاعم والقوائم والخرائط. النواتج: تفاصيل كاملة أو رسائل نقص معلومات.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "عرض تقييمات ومراجعات.",
                    "إظهار رسوم التوصيل والحد الأدنى.",
                    "إتاحة الاتصال على الجوال فقط.",
                    "إظهار التوفر والفتح.",
                    "عرض الموقع والمسافة."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل تفاصيل المطعم",
                        "description": "Sequence Diagram: User→UI→Restaurant Service→Menu Service→Map API→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_019",
                "title": "تصفح قوائم المطعم والمنتجات",
                "description": "الغرض: تسهيل اختيار الأطباق من القوائم. النطاق: يشمل فلاتر حسب القائمة والاسم. سير العمل: يختار القائمة، يطبق بحثًا، يستعرض المنتجات. التفاعلات: المستخدم والواجهة وخدمة القوائم وقاعدة البيانات. النواتج: قائمة منتجات محدثة أو رسالة لا نتائج.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "فلترة حسب قائمة نشطة.",
                    "بحث باسم الطبق يعمل.",
                    "فرز بالسعر أو التقييم.",
                    "تحميل تدريجي للنتائج.",
                    "مؤشرات نفاد المخزون واضحة."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل قوائم المطعم",
                        "description": "Sequence Diagram: User→UI→Menu Service→DB→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_020",
                "title": "تفاصيل المنتج والخيارات",
                "description": "الغرض: عرض تفاصيل دقيقة وتمكين التخصيص. النطاق: يشمل خيارات وبدائل وتأثيرات السعر. سير العمل: يختار الخيارات المطلوبة، يتحقق النظام، يحسب السعر. التفاعلات: المستخدم والواجهة وخدمة المنتجات ومحرك التسعير. النواتج: عنصر صالح أو رسائل نقص اختيار.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "التحقق من الخيارات الإجبارية.",
                    "تحديث السعر فور التغيير.",
                    "عرض شارات مثل حار ونباتي.",
                    "إظهار التقييمات بوضوح.",
                    "رفض الإضافة بدون اختيارات مطلوبة."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل تفاصيل المنتج",
                        "description": "Sequence Diagram: User→UI→Product Service→Pricing Engine→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_021",
                "title": "إضافة إلى السلة وتعديلها",
                "description": "الغرض: إدارة عناصر الطلب بسهولة. النطاق: يشمل إضافة، تعديل، حذف، وتغيير الكميات. سير العمل: يضيف عنصرًا، يحرر الخيارات، يحدث الكمية. التفاعلات: المستخدم والواجهة وخدمة السلة وقاعدة البيانات. النواتج: سلة محدثة أو رسالة تعذر العملية.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "تجميع العناصر حسب المطعم.",
                    "تعديل الكميات فورياً.",
                    "حذف عنصر يعمل دائماً.",
                    "حفظ الخيارات المختارة.",
                    "مزامنة السلة مع الحساب."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل إدارة السلة",
                        "description": "Sequence Diagram: User→UI→Cart Service→DB→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_022",
                "title": "حساب الأسعار والضرائب والرسوم",
                "description": "الغرض: تقديم شفافية كاملة في التسعير. النطاق: يشمل الضرائب والرسوم ورسوم التوصيل. سير العمل: يجمع العناصر، يحسب التكاليف، يعرض التفصيل. التفاعلات: الواجهة ومحرك التسعير وخدمة الرسوم وقاعدة البيانات. النواتج: إجمالي صحيح أو رسائل خطأ الحسبة.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "إظهار المجاميع الفرعية بدقة.",
                    "احتساب ضرائب حسب المنطقة.",
                    "تطبيق رسوم التوصيل المناسبة.",
                    "تحديث فوري عند تعديل السلة.",
                    "توافق الإجمالي بين الشاشات."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل التسعير",
                        "description": "Sequence Diagram: UI→Pricing Engine→Fees Service→DB→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_023",
                "title": "تطبيق كوبونات الخصم",
                "description": "الغرض: تمكين الاستفادة من العروض الترويجية. النطاق: يشمل إدخال الكود والتحقق وقواعد التراكم. سير العمل: يدخل الكود، يتحقق النظام، يطبق الخصم. التفاعلات: المستخدم والواجهة وخدمة القسائم ومحرك التسعير. النواتج: خصم مطبق أو رسالة سبب الرفض.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "قبول أكواد صالحة فقط.",
                    "منع التراكم حسب السياسة.",
                    "تحديث الإجماليات فوراً.",
                    "عرض نسبة أو قيمة الخصم.",
                    "رسائل واضحة للأخطاء."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل القسائم",
                        "description": "Sequence Diagram: User→UI→Coupon Service→Pricing Engine→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_024",
                "title": "التحقق من حد الطلب الأدنى",
                "description": "الغرض: فرض سياسات المطعم للحد الأدنى. النطاق: يشمل تحقق لكل مطعم في السلة. سير العمل: يحسب المجاميع، يقارن الحد، يمنع التقدم إن لزم. التفاعلات: الواجهة وخدمة السلة وخدمة المطاعم ومحرك التسعير. النواتج: سماح بالمتابعة أو تحذير مع المبلغ المتبقي.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "حساب حد لكل مطعم.",
                    "منع السداد عند عدم الاستيفاء.",
                    "عرض المبلغ المتبقي.",
                    "تحديث فوري بعد إضافة عناصر.",
                    "احترام سياسات المناطق."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل حد الطلب",
                        "description": "Sequence Diagram: UI→Cart Service→Restaurant Service→Pricing Engine→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_025",
                "title": "البدء بعملية السداد",
                "description": "الغرض: إكمال الطلب بسلاسة وأمان. النطاق: يشمل ملخص الطلب والزمن المتوقع والشروط. سير العمل: يعرض الملخص، يسمح بالتعديلات، يتابع لخطوات الدفع. التفاعلات: المستخدم والواجهة وخدمة الطلب ومحرك التسعير. النواتج: انتقال ناجح أو رسائل تحقق ناقصة.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "عرض ملخص مفصل للعناصر.",
                    "إظهار الزمن المتوقع للتسليم.",
                    "قبول تعديلات طفيفة للسلة.",
                    "تأكيد قبول الشروط.",
                    "منع التقدم عند نواقص."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل بدء السداد",
                        "description": "Sequence Diagram: User→UI→Order Service→Pricing Engine→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_026",
                "title": "اختيار العنوان في السداد",
                "description": "الغرض: ضمان توصيل للعنوان الصحيح. النطاق: يشمل اختيار أو إضافة عنوان جديد. سير العمل: يحدد العنوان، يتحقق نطاق التوصيل، يحفظ الاختيار. التفاعلات: المستخدم والواجهة وخدمة العناوين وخدمة المناطق. النواتج: قبول العنوان أو تحذير بعدم الخدمة.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "عرض العناوين المحفوظة.",
                    "إضافة عنوان جديد سريعاً.",
                    "تحقق التغطية قبل المتابعة.",
                    "حفظ العنوان المختار للطلب.",
                    "رسالة واضحة عند عدم التغطية."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل عنوان السداد",
                        "description": "Sequence Diagram: User→UI→Address Service→Delivery Zone Service→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_027",
                "title": "اختيار طريقة الدفع",
                "description": "الغرض: توفير خيارات دفع ملائمة وآمنة. النطاق: يشمل بطاقة عبر بوابة والدفع نقداً عند التمكين. سير العمل: يختار الطريقة، يُحوَّل للبوابة، يعود بالحالة. التفاعلات: المستخدم والواجهة وخدمة الدفع وبوابة الدفع. النواتج: حالة دفع ناجحة أو فاشلة مع إرشاد.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "إظهار الطرق المتاحة فقط.",
                    "تحويل آمن للبوابة.",
                    "التقاط حالات النجاح والفشل.",
                    "حفظ مرجع العملية.",
                    "إتاحة نقداً عند السماح."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل اختيار الدفع",
                        "description": "Sequence Diagram: User→UI→Payment Service→Payment Gateway→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_028",
                "title": "تأكيد الطلب النهائي",
                "description": "الغرض: إنشاء طلب ملزم وإطلاق التحضير. النطاق: يشمل التحقق الأخير والدفع والتسعير النهائي. سير العمل: يثبت السلة، يؤكد الدفع، ينشئ الطلب. التفاعلات: الواجهة وخدمات السلة والدفع والطلبات وقاعدة البيانات. النواتج: رقم طلب وتفاصيل أو إلغاء منظم عند الفشل.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "التحقق من سلة نهائية.",
                    "تأكيد الدفع قبل الإنشاء.",
                    "إنشاء سجل الطلب بنجاح.",
                    "إرسال إشعار تأكيد.",
                    "تراجع آمن عند الإخفاق."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل تأكيد الطلب",
                        "description": "Sequence Diagram: UI→Cart Service→Payment Service→Order Service→DB→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_029",
                "title": "قائمة الطلبات وحالتها",
                "description": "الغرض: تمكين متابعة تاريخ الطلبات بسرعة. النطاق: يشمل ترقيم صفحات وفرز حسب التاريخ والحالة. سير العمل: يجلب القائمة، يطبق الفرز، يعرض الملخصات. التفاعلات: المستخدم والواجهة وخدمة الطلبات وقاعدة البيانات. النواتج: قائمة دقيقة أو رسالة لا طلبات.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "عرض حالة كل طلب.",
                    "فرز بالتاريخ تنازلياً.",
                    "ترقيم صفحات فعال.",
                    "رابط تفاصيل لكل طلب.",
                    "دعم إعادة الطلب المختصرة."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل قائمة الطلبات",
                        "description": "Sequence Diagram: User→UI→Order Service→DB→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_030",
                "title": "تفاصيل الطلب وتتبع مباشر",
                "description": "الغرض: تقديم متابعة شفافة للحالة والتوصيل. النطاق: يشمل الزمن، العناصر، العنوان، وخريطة الساعي. سير العمل: يعرض التفاصيل، يحدث الحالة، يظهر موقع الساعي. التفاعلات: المستخدم والواجهة وخدمة الطلبات وشريك التوصيل والخرائط. النواتج: تتبع حي أو تحديثات نصية عند غياب GPS.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "إظهار تسلسل الحالة زمنيًا.",
                    "تحديث لحظي عند التغير.",
                    "خريطة حية عند التوصيل.",
                    "زر اتصال بالساعي على الجوال.",
                    "رسائل بديلة بلا خريطة."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل تتبع الطلب",
                        "description": "Sequence Diagram: User→UI→Order Service→Delivery Partner API→Map API→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_031",
                "title": "إعادة الطلب من التاريخ",
                "description": "الغرض: تسريع تكرار الطلبات المفضلة. النطاق: يشمل نسخ العناصر المتاحة فقط. سير العمل: يختار طلبًا، يتحقق التوفر، يضيف للسلة. التفاعلات: المستخدم والواجهة وخدمة الطلبات وخدمة السلة وخدمة المخزون. النواتج: عناصر مضافة أو تنبيهات للعناصر غير المتاحة.",
                "priority": "متوسط",
                "acceptance_criteria": [
                    "استبعاد عناصر غير متاحة.",
                    "تحديث الأسعار الحالية.",
                    "إضافة العناصر دفعة واحدة.",
                    "عرض ملخص الاختلافات.",
                    "نجاح مع إشعار مختصر."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل إعادة الطلب",
                        "description": "Sequence Diagram: User→UI→Order Service→Inventory Service→Cart Service→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_032",
                "title": "المفضلة وإدارتها",
                "description": "الغرض: حفظ مطاعم مفضلة للوصول السريع. النطاق: يشمل إضافة وإزالة وعرض قائمة المفضلة. سير العمل: ينقر القلب، يحدث السجل، تُعرض القائمة. التفاعلات: المستخدم والواجهة وخدمة المفضلة وقاعدة البيانات. النواتج: حالة محدثة أو رسالة فشل العملية.",
                "priority": "متوسط",
                "acceptance_criteria": [
                    "إضافة مطعم للمفضلة فوراً.",
                    "إزالة تعمل بدون تأخير.",
                    "عرض قائمة مرتبة حديثاً.",
                    "مزامنة عبر الأجهزة.",
                    "رسائل واضحة للأخطاء."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل المفضلة",
                        "description": "Sequence Diagram: User→UI→Favorites Service→DB→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_033",
                "title": "التوصيات الشخصية والعروض",
                "description": "الغرض: تعزيز الاكتشاف بمحتوى مخصص. النطاق: يشمل التاريخ والموقع والتفضيلات والعروض النشطة. سير العمل: يحلل البيانات، يولد توصيات، يعرض البطاقات. التفاعلات: الواجهة وخدمة التوصية وخدمة العروض وقاعدة البيانات. النواتج: توصيات ملائمة أو افتراضيات عامة عند نقص البيانات.",
                "priority": "متوسط",
                "acceptance_criteria": [
                    "استخدام الموقع والتاريخ بموافقة.",
                    "تحديث دوري للتوصيات.",
                    "إبراز عروض فعالة.",
                    "إخفاء المطاعم غير المتاحة.",
                    "قياس نقرات للتعلم."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل التوصيات",
                        "description": "Sequence Diagram: UI→Recommendation Service→Offers Service→DB→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_034",
                "title": "التقييمات والمراجعات بعد الطلب",
                "description": "الغرض: جمع آراء العملاء لتحسين الخدمة. النطاق: يشمل تقييم نجوم ونص وصور اختيارية. سير العمل: يتحقق الأهلية، يجمع التقييم، يرسل للمراجعة. التفاعلات: المستخدم والواجهة وخدمة التقييم وخدمة المراجعة. النواتج: مراجعة منشورة أو مؤجلة مع سبب الرفض.",
                "priority": "متوسط",
                "acceptance_criteria": [
                    "السماح فقط لطلبات مُسلمة.",
                    "التقييم من 1 إلى 5.",
                    "نص مراجعة محدود الطول.",
                    "إمكانية إرفاق صور.",
                    "حالة مراجعة ظاهرة للمستخدم."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل التقييمات",
                        "description": "Sequence Diagram: User→UI→Rating Service→Moderation Service→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_035",
                "title": "إشعارات الحالة والعروض",
                "description": "الغرض: إبقاء المستخدم محدثًا بالأحداث المهمة. النطاق: يشمل حالات الطلب وعروضًا مخصصة. سير العمل: يحدد الحدث، يُبنى الإشعار، يُرسل للقناة المناسبة. التفاعلات: خدمة الأحداث وخدمة الإشعارات ومزودي القنوات والأجهزة. النواتج: إشعار مستلم أو سجل فشل مع إعادة محاولة.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "إرسال فوري لحالات الطلب.",
                    "احترام تفضيلات المستخدم.",
                    "دعم دفع الويب والمحمول.",
                    "إعادة محاولة عند الفشل.",
                    "إظهار تاريخ الإشعار."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل الإشعارات",
                        "description": "Sequence Diagram: Event Service→Notification Service→Push/Web Channels→Device→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_036",
                "title": "لافتات ترويجية مجدولة",
                "description": "الغرض: عرض حملات إعلانية موجهة بزمن مناسب. النطاق: يشمل جدولة واستهداف وروابط نقر. سير العمل: يجلب الصالح، يرتب حسب الأولوية، يعرض اللافتات. التفاعلات: الواجهة وخدمة الإعلانات وقاعدة البيانات. النواتج: لافتات صحيحة أو تجاهل منتهي الصلاحية.",
                "priority": "متوسط",
                "acceptance_criteria": [
                    "عرض ضمن الفترة المحددة.",
                    "استهداف حسب الموقع أو السلوك.",
                    "تتبع النقرات للقياس.",
                    "فتح الرابط الصحيح.",
                    "إخفاء عند انتهاء الحملة."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل الإعلانات",
                        "description": "Sequence Diagram: UI→Ads Service→DB→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_037",
                "title": "دعم RTL والتعريب الكامل",
                "description": "الغرض: تقديم تجربة عربية سليمة وسهلة. النطاق: يشمل الاتجاه، الترجمات، والتنسيقات المحلية. سير العمل: يحدد اللغة، يطبق RTL، يحمل الموارد. التفاعلات: الواجهة وخدمة الترجمة ومخزن الموارد. النواتج: واجهة معربة أو رسائل فقد ترجمة.",
                "priority": "متوسط",
                "acceptance_criteria": [
                    "تطبيق RTL لكل المكونات.",
                    "ترجمة كاملة للنصوص.",
                    "تنسيق تواريخ وأرقام محلي.",
                    "بدائل للنصوص المفقودة.",
                    "حفظ اختيار اللغة."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل التعريب",
                        "description": "Sequence Diagram: UI→I18n Service→Resource Store→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_038",
                "title": "الخصوصية والموافقة على الأذونات",
                "description": "الغرض: احترام خصوصية المستخدم والامتثال للقوانين. النطاق: يشمل موافقات الموقع والإشعارات والتحليلات. سير العمل: يطلب الموافقة، يسجل القرار، يطبق القيود. التفاعلات: المستخدم والواجهة وخدمة الخصوصية ومخزن الإعدادات. النواتج: أذونات مفعلة أو معطلة مع لافتات تذكير.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "طلبات أذونات وفق التوقيت السياقي.",
                    "تسجيل حالة الموافقة.",
                    "احترام الرفض دون تكرار مزعج.",
                    "إمكانية تعديل الموافقات لاحقاً.",
                    "عرض سياسة الخصوصية."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل الموافقات",
                        "description": "Sequence Diagram: User→UI→Privacy Service→Settings Store→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_039",
                "title": "الأمان والمصادقة الآمنة",
                "description": "الغرض: حماية الحسابات والبيانات من التهديدات. النطاق: يشمل تشفير، حجب محاولات، وCSRF للويب. سير العمل: يتحقق الطلب، يطبق الضوابط، يسجل الأحداث. التفاعلات: الواجهة وخدمة الأمن وجدار الحماية وقاعدة البيانات. النواتج: طلبات مقبولة آمنة أو رفض مسوغ.",
                "priority": "عالي",
                "acceptance_criteria": [
                    "جميع الاتصالات عبر HTTPS.",
                    "حماية من القوة الغاشمة.",
                    "رموز CSRF صالحة بالويب.",
                    "تسجيل محاولات مشبوهة.",
                    "رسائل خطأ غير كاشفة."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل الضوابط الأمنية",
                        "description": "Sequence Diagram: UI→Security Service→Firewall→DB→UI.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "fr_040",
                "title": "التصفح اللامتناهي وتحسين الأداء",
                "description": "الغرض: توفير تجربة سلسة وسريعة بالقوائم. النطاق: يشمل ترقيم صفحات كسول وتخزين مؤقت. سير العمل: يطلب دفعات، يخزن محلياً، يحدث العرض. التفاعلات: الواجهة وخدمة القوائم وخدمة التخزين المؤقت. النواتج: تحميل سريع أو رجوع لطلب لاحق عند الفشل.",
                "priority": "متوسط",
                "acceptance_criteria": [
                    "تحميل تدريجي دون انقطاعات.",
                    "مؤشرات نهاية المحتوى.",
                    "Caching يقلل الطلبات.",
                    "Debounce لمدخلات البحث.",
                    "تعافٍ تلقائي عند فشل الشبكة."
                ],
                "diagrams": [
                    {
                        "name": "تسلسل التصفح اللامتناهي",
                        "description": "Sequence Diagram: UI→List Service→Cache Service→UI.",
                        "url": ""
                    }
                ]
            }
        ]
    },
    "nonfunctional_requirements": {
        "meta": {
            "id": "nonfunctional_requirements",
            "name": "Non-Functional Requirements - المتطلبات غير الوظيفية"
        },
        "requirements": [
            {
                "id": "nfr_01",
                "type": "الأداء",
                "description": "زمن استجابة واجهات القراءة (قوائم/بحث) عند الوسيط P50 <= 300 مللي ثانية وP95 <= 800 مللي ثانية."
            },
            {
                "id": "nfr_02",
                "type": "الأداء",
                "description": "زمن معالجة إنشاء الطلب وتأكيده داخلياً P95 <= 2 ثانية (باستثناء رحلة بوابة الدفع الخارجية)."
            },
            {
                "id": "nfr_03",
                "type": "الأداء",
                "description": "قدرة الاستيعاب لا تقل عن 500 طلب/ثانية بشكل مستمر، مع تحمل اندفاعات حتى 2000 طلب/ثانية لمدة 5 دقائق دون فقدان بيانات."
            },
            {
                "id": "nfr_04",
                "type": "الاعتمادية والتوافر",
                "description": "توافر الخدمات الشهرية >= 99.9% للواجهات الأمامية والـ API."
            },
            {
                "id": "nfr_05",
                "type": "الاعتمادية والتوافر",
                "description": "أهداف التعافي: RPO <= 15 دقيقة وRTO <= 60 دقيقة مع نسخ احتياطية مشفرة ومجربة دورياً."
            },
            {
                "id": "nfr_06",
                "type": "الأمان",
                "description": "جميع الاتصالات عبر HTTPS/TLS 1.2+ مع تفعيل HSTS وتعطيل الخوارزميات الضعيفة."
            },
            {
                "id": "nfr_07",
                "type": "الأمان",
                "description": "تخزين كلمات المرور باستخدام Argon2id أو bcrypt بمعامل كلفة مناسب؛ إيقاف مؤقت للحساب بعد 5 محاولات فاشلة خلال 15 دقيقة."
            },
            {
                "id": "nfr_08",
                "type": "الأمان",
                "description": "حماية CSRF على الويب، وتعقيم مدخلات ومنع XSS/SQLi وفق OWASP ASVS المستوى 2 على الأقل."
            },
            {
                "id": "nfr_09",
                "type": "الأمان",
                "description": "عدم تخزين بيانات بطاقات الدفع؛ استخدام ترميز عبر بوابة الدفع والالتزام بـ PCI DSS SAQ A."
            },
            {
                "id": "nfr_10",
                "type": "الخصوصية",
                "description": "إدارة صريحة للموافقة على الموقع والإشعارات والتحليلات؛ تقليل جمع البيانات؛ تشفير البيانات الحساسة والنسخ الاحتياطية أثناء السكون."
            },
            {
                "id": "nfr_11",
                "type": "قابلية الاستخدام وإمكانية الوصول",
                "description": "التوافق مع WCAG 2.1 AA؛ دعم RTL كامل؛ تباين ألوان >= 4.5:1؛ تنقل عبر لوحة المفاتيح ودعم قارئات الشاشة."
            },
            {
                "id": "nfr_12",
                "type": "قابلية الاستخدام وإمكانية الوصول",
                "description": "بحث وتصفية سريعة مع تأخير إدخالي (debounce) <= 300 مللي ثانية وتمرير لانهائي مع مؤشرات تحميل واضحة."
            },
            {
                "id": "nfr_13",
                "type": "القابلية للتوسع",
                "description": "قابلية توسع أفقية بدون توقف؛ الخدمات عديمة الحالة وتدعم التوسعة التلقائية وتوزيع الحمل."
            },
            {
                "id": "nfr_14",
                "type": "القابلية للصيانة",
                "description": "نشر عبر CI/CD بأسلوب كاناري/بلو-جرين؛ تهيئة نسخة إنتاج جديدة <= 10 دقائق؛ تغطية اختبارات آلية >= 70%."
            },
            {
                "id": "nfr_15",
                "type": "المراقبة والقابلية للرصد",
                "description": "تجميع مركزي للسجلات والمقاييس وتتبع موزع؛ تنبيهات على تجاوز SLO؛ سجلات تدقيق للطلبات والمدفوعات والتعديلات الإدارية."
            },
            {
                "id": "nfr_16",
                "type": "التوافقية",
                "description": "دعم آخر نسختين رئيسيتين من iOS وAndroid وأحدث نسختين من Chrome/Edge/Safari/Firefox."
            },
            {
                "id": "nfr_17",
                "type": "الدولية والتعريب",
                "description": "تغطية عربية/إنجليزية كاملة بما في ذلك الرسائل والتحقق؛ تنسيقات محلية للأرقام/التواريخ والعملة؛ عرض المسافات بالكيلومتر افتراضياً."
            },
            {
                "id": "nfr_18",
                "type": "المرونة والتدهور السليم",
                "description": "عند تعذر GPS أو مزود الخرائط/التوصيل، يعتمد النظام على اختيار المدينة/المنطقة ويعرض تحديثات حالة بدون خريطة."
            },
            {
                "id": "nfr_19",
                "type": "سلامة المعاملات",
                "description": "استخدام مفاتيح عدم التكرار للطلبات والمدفوعات مع إعادة محاولات آمنة ومتسامحة مع التكرار لمنع الشحن المزدوج."
            },
            {
                "id": "nfr_20",
                "type": "حدود وأداء الوسائط",
                "description": "تسليم الصور عبر CDN مع ضغط حديث وTTL مناسب؛ حجم الصورة المرفوعة <= 5 ميجابايت؛ زمن تحميل الصور الحرجة P95 <= 1 ثانية على شبكة 4G."
            }
        ]
    },
    "use_cases": {
        "meta": {
            "id": "use_cases",
            "name": "Use Cases - حالات الاستخدام"
        },
        "items": [
            {
                "id": "uc_001",
                "name": "تسجيل حساب جديد",
                "description": "الغرض: تمكين المستخدمين من إنشاء حساب آمن للوصول الكامل. النطاق: يشمل إدخال البيانات والتحقق وإرسال رمز تأكيد؛ يستثني إعدادات متقدمة. التفاعلات: المستخدم والتطبيق وخدمة المصادقة وبوابة البريد أو الرسائل. القيود/الافتراضات: اتصال مستقر، بريد أو هاتف صالح، دعم لغتين. النتيجة: إنشاء الحساب أو إظهار أخطاء واضحة وتوجيه للإصلاح.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "خدمة المصادقة",
                    "بوابة الرسائل"
                ],
                "preconditions": [
                    "اتصال إنترنت متاح",
                    "التطبيق يعمل دون أخطاء",
                    "لا يوجد حساب سابق بنفس البريد أو الهاتف",
                    "قبول شروط الخصوصية"
                ],
                "steps": [
                    "يفتح المستخدم شاشة التسجيل، فيعرض النظام نموذج المعلومات.",
                    "يدخل المستخدم الاسم والبريد أو الهاتف وكلمة المرور، فيتحقق النظام لحظيًا.",
                    "يختار المستخدم اللغة، فيحفظها النظام كتفضيل.",
                    "يضغط المستخدم إنشاء حساب، فينشئ النظام طلب التحقق.",
                    "يرسل النظام رمز تحقق عبر البريد أو الرسائل، ويعرض حقل الإدخال.",
                    "يدخل المستخدم الرمز، فيتحقق النظام من صحته وصلاحيته.",
                    "ينشئ النظام الحساب ويولد جلسة آمنة.",
                    "يعرض النظام صفحة ترحيب مع إكمال الملف الشخصي."
                ],
                "business_rules": [
                    {
                        "id": "br_uc001_01",
                        "rule": "يجب أن تستوفي كلمة المرور سياسة التعقيد الدنيا وطولًا آمناً."
                    },
                    {
                        "id": "br_uc001_02",
                        "rule": "لا يُسمح بتكرار البريد الإلكتروني أو رقم الهاتف لحسابين."
                    },
                    {
                        "id": "br_uc001_03",
                        "rule": "تنتهي صلاحية رمز التحقق خلال مدة محددة ويُقفل بعد محاولات فاشلة متتالية."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة التسجيل",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط التسلسل",
                        "description": "Sequence Diagram: User, App, Auth Service, and SMS/Email Gateway handle signup, OTP delivery, verification, and session creation.",
                        "url": "https://brd-qi0f.onrender.com/static/a344df638fed4ad9bbdc325cf7284bb0.svg"
                    }
                ]
            },
            {
                "id": "uc_002",
                "name": "تسجيل الدخول الآمن",
                "description": "الغرض: تمكين الوصول السريع والآمن للحساب. النطاق: يشمل إدخال الاعتماد، التحقق، وإدارة الجلسة؛ يستثني التسجيل. التفاعلات: المستخدم، النظام، خدمة المصادقة، ومخزن الجلسات. القيود/الافتراضات: اتصال مستمر ودعم التوطين ثنائي اللغة. النتيجة: دخول ناجح مع إعادة التوجيه أو رسائل خطأ دقيقة ومحاولة جديدة.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "خدمة المصادقة"
                ],
                "preconditions": [
                    "وجود حساب مُفعّل",
                    "اتصال إنترنت متاح",
                    "التطبيق محدث",
                    "عدم بلوغ حد محاولات الفشل"
                ],
                "steps": [
                    "يفتح المستخدم شاشة الدخول، فيعرض النظام حقول البريد وكلمة المرور.",
                    "يدخل المستخدم الاعتماد، فيتحقق النظام من التنسيق.",
                    "يضغط المستخدم دخول، فيرسل النظام الطلب لخدمة المصادقة.",
                    "تتحقق الخدمة من الاعتماد وتعيد رمزاً عند النجاح.",
                    "يولد النظام جلسة آمنة ويخزن رمزاً مؤقتاً.",
                    "يعيد النظام توجيه المستخدم للصفحة الرئيسية.",
                    "يعرض النظام بطاقات مخصصة حسب الحساب.",
                    "يعرض خيار تذكرني وتسجيل الخروج الآمن."
                ],
                "business_rules": [
                    {
                        "id": "br_uc002_01",
                        "rule": "يجب حماية الجلسات برموز قصيرة العمر مع تجديد صامت."
                    },
                    {
                        "id": "br_uc002_02",
                        "rule": "تطبق سياسة إقفال مؤقت بعد محاولات فاشلة متعددة."
                    },
                    {
                        "id": "br_uc002_03",
                        "rule": "يتم تشفير الاعتماد أثناء النقل والتخزين وفق المعايير."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة الدخول",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط التسلسل",
                        "description": "Sequence Diagram: User, App, and Auth Service exchange credentials, issue tokens, and establish session.",
                        "url": "https://brd-qi0f.onrender.com/static/9edf85d5548149eda72a3149220745a4.svg"
                    }
                ]
            },
            {
                "id": "uc_003",
                "name": "إعادة تعيين كلمة المرور",
                "description": "الغرض: استعادة الوصول للحساب عند نسيان كلمة المرور. النطاق: يشمل طلب الرمز والتحقق وإعادة التعيين؛ يستثني التغيير داخل الجلسة. التفاعلات: المستخدم، النظام، خدمة المصادقة، وبوابة الرسائل. القيود/الافتراضات: هوية مملوكة ووسيلة استلام فعالة. النتيجة: تعيين كلمة جديدة أو رفض مع توضيح الأسباب.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "خدمة المصادقة",
                    "بوابة الرسائل"
                ],
                "preconditions": [
                    "وجود حساب مرتبط ببريد أو هاتف",
                    "اتصال إنترنت متاح",
                    "الامتثال للسياسات الأمنية",
                    "عدم تجاوز محاولات التحقق"
                ],
                "steps": [
                    "يفتح المستخدم شاشة نسيت كلمة المرور، فيعرض النظام نموذج الاسترداد.",
                    "يدخل المستخدم البريد أو الهاتف، فيتحقق النظام من الوجود.",
                    "يرسل النظام رمز تحقق إلى القناة المحددة.",
                    "يدخل المستخدم الرمز، فيتحقق النظام من الصلاحية.",
                    "يعرض النظام حقلاً لكلمة مرور جديدة.",
                    "يدخل المستخدم كلمة قوية، فيتحقق النظام من التعقيد.",
                    "يحفظ النظام الكلمة ويُبطل الجلسات القديمة.",
                    "يعرض النظام رسالة نجاح وتوجيه للدخول."
                ],
                "business_rules": [
                    {
                        "id": "br_uc003_01",
                        "rule": "يجب إبطال جميع الجلسات بعد إعادة التعيين لأمان الحساب."
                    },
                    {
                        "id": "br_uc003_02",
                        "rule": "ينبغي فرض حد زمني لرمز الاسترداد مع حماية ضد العشوائية."
                    },
                    {
                        "id": "br_uc003_03",
                        "rule": "يمنع إعادة استخدام آخر كلمات مرور محددة سياسياً."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة الاسترداد",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط النشاط",
                        "description": "Activity Diagram: App validates account, sends OTP via SMS/Email Gateway, verifies input, and updates password through Auth Service.",
                        "url": "https://brd-qi0f.onrender.com/static/3fca58fdfb1c46dea5e6ea4e46f741e6.svg"
                    }
                ]
            },
            {
                "id": "uc_004",
                "name": "إدارة الملف الشخصي",
                "description": "الغرض: تحديث بيانات الحساب وتخصيص التجربة. النطاق: يشمل الاسم، الهاتف، البريد، وكلمة المرور؛ يستثني العناوين. التفاعلات: المستخدم، النظام، خدمة المصادقة، وحدة الإشعارات. القيود/الافتراضات: تحقق هوية قبل التغييرات الحساسة. النتيجة: حفظ ناجح أو أخطاء محددة مع تعليمات.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "خدمة المصادقة"
                ],
                "preconditions": [
                    "المستخدم مسجل الدخول",
                    "اتصال إنترنت مستقر",
                    "توفر بيانات حالية للعرض",
                    "صلاحيات كافية لتعديل الحقول"
                ],
                "steps": [
                    "يفتح المستخدم صفحة الملف، فيجلب النظام البيانات الحالية.",
                    "يعدّل المستخدم الاسم أو البريد، فيتحقق النظام من الصحة.",
                    "يغيّر المستخدم الهاتف، فيرسل النظام رمز تحقق.",
                    "يدخل المستخدم الرمز، فيؤكد النظام الملكية.",
                    "يحدث المستخدم كلمة المرور، فيطبق النظام السياسات.",
                    "يحفظ النظام التغييرات ويحدث الجلسة.",
                    "يعرض النظام رسالة نجاح وتاريخ آخر تعديل.",
                    "يوفر النظام خيار استرجاع الإعدادات القديمة."
                ],
                "business_rules": [
                    {
                        "id": "br_uc004_01",
                        "rule": "يتطلب تغيير البريد أو الهاتف تحقق ملكية عبر رمز صالح."
                    },
                    {
                        "id": "br_uc004_02",
                        "rule": "يجب تسجيل جميع التغييرات الحساسة لأغراض التدقيق."
                    },
                    {
                        "id": "br_uc004_03",
                        "rule": "لا تُعرض كلمة المرور مطلقاً ويُحظر تخزينها بنص صريح."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة الملف الشخصي",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط النشاط",
                        "description": "Activity Diagram: User edits fields, App validates, Auth Service re-verifies sensitive changes, and App persists updates.",
                        "url": "https://brd-qi0f.onrender.com/static/6a63168e37114a2293577b460642ad86.svg"
                    }
                ]
            },
            {
                "id": "uc_005",
                "name": "إدارة دفتر العناوين",
                "description": "الغرض: حفظ عناوين تسليم متعددة بدقة. النطاق: يشمل الإضافة والتعديل والحذف وتعيين الافتراضي. التفاعلات: المستخدم، النظام، مزود الخرائط، وخدمة التكويد الجغرافي. القيود/الافتراضات: دقة الخرائط وحدود المناطق. النتيجة: عنوان صالح قابل للاستخدام أو خطأ مع إرشادات.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "مزود الخرائط"
                ],
                "preconditions": [
                    "المستخدم مسجل الدخول",
                    "اتصال إنترنت متاح",
                    "تم منح صلاحية الموقع أو إدخال يدوي",
                    "دعم المنطقة للتوصيل"
                ],
                "steps": [
                    "يفتح المستخدم صفحة العناوين، فيعرض النظام قائمة حالية.",
                    "ينقر المستخدم إضافة عنوان، فيعرض النظام نموذجاً وخريطة.",
                    "يحدد المستخدم الموقع على الخريطة، فيجلب النظام الإحداثيات.",
                    "يدخل المستخدم التفاصيل، فيتحقق النظام من الإلزامية.",
                    "يحفظ المستخدم العنوان، فيجري النظام تكويداً عكسياً.",
                    "يتحقق النظام من نطاق الخدمة للعنوان.",
                    "يُعيّن المستخدم العنوان كافتراضي، فيحدثه النظام.",
                    "يعرض النظام رسالة نجاح وتحديث القائمة."
                ],
                "business_rules": [
                    {
                        "id": "br_uc005_01",
                        "rule": "لا يُسمح بعنوان خارج نطاق الخدمة لطلبات التوصيل."
                    },
                    {
                        "id": "br_uc005_02",
                        "rule": "يجب حفظ الإحداثيات مع كل عنوان لضمان الدقة."
                    },
                    {
                        "id": "br_uc005_03",
                        "rule": "يتطلب حذف العنوان الافتراضي اختيار بديل أولاً."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة العناوين",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط التسلسل",
                        "description": "Sequence Diagram: User selects map point, App calls Geocoding Service, validates service area, and saves address.",
                        "url": "https://brd-qi0f.onrender.com/static/1fc6205c609f43bcb3f89c18621ff56d.svg"
                    }
                ]
            },
            {
                "id": "uc_006",
                "name": "اختيار اللغة والتبديل",
                "description": "الغرض: توفير تجربة ثنائية اللغة متسقة. النطاق: يشمل التبديل بين العربية والإنجليزية وحفظ التفضيل. التفاعلات: المستخدم، النظام، وحدة التعريب، التخزين المحلي. القيود/الافتراضات: دعم RTL وتهيئة التنسيقات. النتيجة: واجهة محدثة أو رسالة توضح القيود المؤقتة.",
                "actors": [
                    "المستخدم",
                    "النظام"
                ],
                "preconditions": [
                    "التطبيق يدعم اللغتين",
                    "اتصال أو تخزين محلي متاح",
                    "عدم وجود تعارض مع إعدادات الجهاز",
                    "ملفات ترجمة محملة"
                ],
                "steps": [
                    "يفتح المستخدم الإعدادات، فيعرض النظام خيارات اللغة.",
                    "يختار المستخدم العربية أو الإنجليزية، فيقرأ النظام الإعداد.",
                    "يطبق النظام اتجاه الواجهة المناسب.",
                    "يحدث النظام نصوص القوائم والعناوين.",
                    "يخزن النظام التفضيل محلياً وللحساب.",
                    "يعيد النظام تحميل المقاطع المتأثرة.",
                    "يعرض النظام إشعار تغيير اللغة.",
                    "يقدم النظام خيار الرجوع الفوري."
                ],
                "business_rules": [
                    {
                        "id": "br_uc006_01",
                        "rule": "يجب احترام اتجاه RTL بالكامل عند اختيار العربية."
                    },
                    {
                        "id": "br_uc006_02",
                        "rule": "تُخزّن التفضيلات لكل جهاز ولكل حساب على السحابة."
                    },
                    {
                        "id": "br_uc006_03",
                        "rule": "تُترجم رسائل التحقق والأخطاء بالتزامن مع اللغة المختارة."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة اللغة",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط النشاط",
                        "description": "Activity Diagram: User selects locale, App switches RTL/LTR, reloads resources, and persists preference.",
                        "url": "https://brd-qi0f.onrender.com/static/e096c5e73f2f4c68912d536f87cb2a51.svg"
                    }
                ]
            },
            {
                "id": "uc_007",
                "name": "تحديد الموقع عبر GPS",
                "description": "الغرض: تحديد موقع المستخدم تلقائياً لتحسين الاقتراحات. النطاق: يشمل طلب الإذن، قراءة الإحداثيات، وحفظ الموقع. التفاعلات: المستخدم، النظام، مزود الموقع، ومزود الخرائط. القيود/الافتراضات: قد يرفض الإذن أو يكون GPS ضعيفاً. النتيجة: موقع مضبوط أو مسار بديل للاختيار اليدوي.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "مزود الخرائط"
                ],
                "preconditions": [
                    "الجهاز يدعم GPS",
                    "إذن الموقع غير مرفوض نهائياً",
                    "اتصال إنترنت أو GPS متاح",
                    "خدمات الموقع مفعلة"
                ],
                "steps": [
                    "ينقر المستخدم تحديد موقعي، فيطلب النظام الإذن.",
                    "يوافق المستخدم، فيحصل النظام على الإحداثيات.",
                    "يجري النظام تكويداً عكسياً للعنوان.",
                    "يحفظ النظام الموقع الحالي للتفضيلات.",
                    "يعرض النظام المطاعم القريبة مرتبة بالمسافة.",
                    "يوفر النظام خيار تحديث الموقع.",
                    "يعالج النظام حالات الرفض برسالة إرشادية.",
                    "يرشد النظام لاختيار موقع يدوي عند الفشل."
                ],
                "business_rules": [
                    {
                        "id": "br_uc007_01",
                        "rule": "لا تُفعّل خدمات الخلفية بدون موافقة صريحة."
                    },
                    {
                        "id": "br_uc007_02",
                        "rule": "تُخزن الإحداثيات بصورة آمنة وتُحذف عند إلغاء الموافقة."
                    },
                    {
                        "id": "br_uc007_03",
                        "rule": "تُقرب المسافات إلى كيلومترات مع دقة ثابتة."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة تحديد الموقع",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": "https://brd-qi0f.onrender.com/static/fd6331a3bf39404d83892536938f398c.png"
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط التسلسل",
                        "description": "Sequence Diagram: User grants permission, App queries GPS, calls Geocoding, saves coordinates, and refreshes nearby restaurants.",
                        "url": "https://brd-qi0f.onrender.com/static/3bb8ccbfe4e843fc9f438aab3b611c28.svg"
                    }
                ]
            },
            {
                "id": "uc_008",
                "name": "اختيار الموقع على الخريطة",
                "description": "الغرض: تمكين تحديد موقع دقيق يدوياً. النطاق: يشمل سحب الدبوس، البحث بالعنوان، وتأكيد الموقع. التفاعلات: المستخدم، النظام، مزود الخرائط، والتكويد الجغرافي. القيود/الافتراضات: دقة الخرائط وتغطية العناوين. النتيجة: موقع محفوظ أو تنبيه بإخراج النطاق.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "مزود الخرائط"
                ],
                "preconditions": [
                    "الخريطة محملة بنجاح",
                    "اتصال إنترنت متاح",
                    "المنطقة مدعومة بالخدمة",
                    "المستخدم يملك حساباً أو جلسة ضيف"
                ],
                "steps": [
                    "يفتح المستخدم الخريطة، فيعرض النظام الدبوس المركزي.",
                    "يسحب المستخدم الدبوس، فيحدث النظام الإحداثيات.",
                    "يبحث المستخدم عن عنوان، فيقترح النظام نتائج.",
                    "يختار المستخدم النتيجة، فيمركز النظام الخريطة.",
                    "يؤكد المستخدم الموقع، فيحول النظام لإحداثيات.",
                    "يتحقق النظام من نطاق التوصيل.",
                    "يحفظ النظام الموقع كتفضيل.",
                    "يعرض النظام المطاعم المتاحة فوراً."
                ],
                "business_rules": [
                    {
                        "id": "br_uc008_01",
                        "rule": "لا يُسمح بحفظ موقع خارج مناطق الخدمة للتوصيل."
                    },
                    {
                        "id": "br_uc008_02",
                        "rule": "يجب إرفاق اسم مكان وعنوان مختصر مع الإحداثيات."
                    },
                    {
                        "id": "br_uc008_03",
                        "rule": "يتم تحديث المسافات عند كل تغيير موقع."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة خريطة الموقع",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط النشاط",
                        "description": "Activity Diagram: User drags pin or searches, App geocodes, verifies service area, and saves the location.",
                        "url": "https://brd-qi0f.onrender.com/static/250f1c03bb244c61ad1e3b9b9c018dd6.svg"
                    }
                ]
            },
            {
                "id": "uc_009",
                "name": "البحث عن المطاعم",
                "description": "الغرض: العثور على مطاعم مناسبة بسرعة. النطاق: يشمل البحث بالاسم والكلمات المفتاحية مع اقتراحات. التفاعلات: المستخدم، النظام، محرك البحث، ووحدة التوصيات. القيود/الافتراضات: فهرسة محدثة ودعم اللغتين. النتيجة: نتائج مرتبة أو رسالة عدم وجود مطابقات.",
                "actors": [
                    "المستخدم",
                    "النظام"
                ],
                "preconditions": [
                    "اتصال إنترنت متاح",
                    "تحديد موقع المستخدم أو منطقة",
                    "فهرس البحث متاح",
                    "تفعيل اللغة المناسبة"
                ],
                "steps": [
                    "يفتح المستخدم حقل البحث، فيعرض النظام تلميحات.",
                    "يكتب المستخدم الاسم، فيطبق النظام إزالة التشكيل.",
                    "يعرض النظام اقتراحات فورية.",
                    "يختار المستخدم اقتراحاً، فيجلب النظام النتائج.",
                    "يعدل المستخدم الفلاتر، فيطبقها النظام لحظياً.",
                    "يرتب المستخدم النتائج، فيعيد النظام ترتيبها.",
                    "يحفظ النظام آخر عمليات البحث.",
                    "يعرض النظام حالة لا نتائج عند الحاجة."
                ],
                "business_rules": [
                    {
                        "id": "br_uc009_01",
                        "rule": "يجب أن يكون البحث غير حساس لحالة الأحرف والتشكيل."
                    },
                    {
                        "id": "br_uc009_02",
                        "rule": "تُحترم قيود الموقع عند عرض النتائج."
                    },
                    {
                        "id": "br_uc009_03",
                        "rule": "تُخزن عمليات البحث محلياً فقط عند موافقة المستخدم."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة البحث",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": "https://brd-qi0f.onrender.com/static/0f5f8c959aac4def9705b7708e0432bb.png"
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط التسلسل",
                        "description": "Sequence Diagram: User types query, App sends to Search Service, applies filters, and returns ranked restaurants.",
                        "url": "https://brd-qi0f.onrender.com/static/fdd5d8bee7e44f04a49cb9331c4c8556.svg"
                    }
                ]
            },
            {
                "id": "uc_010",
                "name": "تصفح الفئات الرئيسية",
                "description": "الغرض: تسهيل اكتشاف أصناف الطعام. النطاق: يشمل عرض الفئات، التصفية، والتمرير اللامتناهي. التفاعلات: المستخدم، النظام، خدمة المحتوى. القيود/الافتراضات: صور عبر CDN وتجزئة صفحات فعّالة. النتيجة: قائمة فئات محدثة أو إشعار نفاد البيانات.",
                "actors": [
                    "المستخدم",
                    "النظام"
                ],
                "preconditions": [
                    "اتصال إنترنت مستقر",
                    "توفر بيانات الفئات",
                    "اللغة مضبوطة",
                    "المحتوى مخزن مؤقتاً"
                ],
                "steps": [
                    "يفتح المستخدم صفحة الفئات، فيعرض النظام بطاقات.",
                    "يبحث المستخدم بالاسم، فيطبق النظام الفلتر.",
                    "يرتب المستخدم النتائج، فيعيد النظام الترتيب.",
                    "ينزل المستخدم للأسفل، فيحمل النظام صفحة جديدة.",
                    "ينقر المستخدم فئة، فيعرض النظام تفاصيلها.",
                    "يعود المستخدم، فيستعيد النظام الحالة.",
                    "يعرض النظام شارات الأكثر شيوعاً.",
                    "يوضح النظام حالة التحميل بصرياً."
                ],
                "business_rules": [
                    {
                        "id": "br_uc010_01",
                        "rule": "يجب دعم الترتيب تصاعدياً وتنازلياً بالاسم وعدد المطاعم."
                    },
                    {
                        "id": "br_uc010_02",
                        "rule": "تعرض الصور من CDN مع تحسين للأداء."
                    },
                    {
                        "id": "br_uc010_03",
                        "rule": "يحافظ النظام على حالة التمرير بين التنقلات."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة الفئات",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط النشاط",
                        "description": "Activity Diagram: User scrolls categories, App paginates, filters by name, and opens selected category details.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "uc_011",
                "name": "تصفية وترتيب المطاعم",
                "description": "الغرض: تضييق النتائج لاختيار أفضل مطعم. النطاق: يشمل الفلاتر والفرز والمسافة. التفاعلات: المستخدم، النظام، مزود الخرائط، وحدة التوصيات. القيود/الافتراضات: بيانات زمن التسليم والرسوم محدثة. النتيجة: قائمة مطاعم دقيقة أو توضيح لعدم المطابقة.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "مزود الخرائط"
                ],
                "preconditions": [
                    "تحديد موقع صالح",
                    "توفر قائمة مطاعم",
                    "اتصال إنترنت متاح",
                    "تهيئة فلاتر افتراضية"
                ],
                "steps": [
                    "يفتح المستخدم قائمة المطاعم، فيعرض النظام خيارات الفلاتر.",
                    "يحدد المستخدم الفئة، فيطبق النظام الفلتر.",
                    "يضبط المستخدم زمن التسليم، فيعيد النظام النتائج.",
                    "يختار المستخدم مستوى السعر، فيحدّث النظام القائمة.",
                    "يمكّن المستخدم مفتاح مفتوح الآن، فيصفّي النظام.",
                    "يرتب المستخدم حسب الأقرب، فيحسب النظام المسافات.",
                    "يحفظ النظام التفضيلات مؤقتاً.",
                    "يعرض النظام عدد النتائج المتبقية."
                ],
                "business_rules": [
                    {
                        "id": "br_uc011_01",
                        "rule": "يُحسب القرب اعتماداً على آخر موقع محفوظ."
                    },
                    {
                        "id": "br_uc011_02",
                        "rule": "تُعرض المطاعم غير المتاحة مع شارة توضح الحالة فقط."
                    },
                    {
                        "id": "br_uc011_03",
                        "rule": "تُطبق جميع الفلاتر والفرز بصورة تراكمية متسقة."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة فلاتر المطاعم",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": "https://brd-qi0f.onrender.com/static/3f670e77af454f8f9d4277cbe71035ed.png"
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط التسلسل",
                        "description": "Sequence Diagram: User sets filters, App queries Restaurant Service, computes distances via Map Provider, and renders sorted list.",
                        "url": "https://brd-qi0f.onrender.com/static/9c10a6ae897c49e6a98ef2c1f751d4fa.svg"
                    }
                ]
            },
            {
                "id": "uc_012",
                "name": "عرض تفاصيل المطعم",
                "description": "الغرض: تقديم معلومات شاملة لاتخاذ قرار. النطاق: يشمل الصور، الأوقات، الرسوم، والخريطة. التفاعلات: المستخدم، النظام، مزود الخرائط، وحدة المراجعات. القيود/الافتراضات: بيانات محدثة وتقارير تقييمات معتدلة. النتيجة: عرض كامل أو إظهار نُدرة البيانات برسائل واضحة.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "مزود الخرائط",
                    "المطعم"
                ],
                "preconditions": [
                    "المستخدم فتح قائمة المطاعم",
                    "معرف مطعم صالح",
                    "اتصال إنترنت متاح",
                    "المحتوى قابل للعرض"
                ],
                "steps": [
                    "ينقر المستخدم مطعماً، فيجلب النظام تفاصيله.",
                    "يعرض النظام صوراً وتقييمات وآخر العروض.",
                    "يعرض النظام تقدير الزمن والرسوم والحد الأدنى.",
                    "يظهر النظام خريطة وموقع المطعم والمسافة.",
                    "يستعرض المستخدم المراجعات، فيعرض النظام الملخص.",
                    "ينتقل المستخدم للقوائم، فيحمّلها النظام.",
                    "يشارك المستخدم المطعم، فيولد النظام رابطاً.",
                    "يوفر النظام زر اتصال على الجوال فقط."
                ],
                "business_rules": [
                    {
                        "id": "br_uc012_01",
                        "rule": "أزرار الاتصال تعمل على الجوال فقط احتراماً للمنصة."
                    },
                    {
                        "id": "br_uc012_02",
                        "rule": "يجب إظهار حالة الإغلاق مع أوقات العمل الدقيقة."
                    },
                    {
                        "id": "br_uc012_03",
                        "rule": "تُعرض رسوم التوصيل والحد الأدنى بشكل شفاف قبل الإضافة."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة تفاصيل المطعم",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط النشاط",
                        "description": "Activity Diagram: App fetches restaurant detail, images, reviews, and renders map location before navigating to menus.",
                        "url": "https://brd-qi0f.onrender.com/static/8946255cd992459686c0dd023caecc49.svg"
                    }
                ]
            },
            {
                "id": "uc_013",
                "name": "استعراض قوائم المطعم",
                "description": "الغرض: تصفح القوائم والمنتجات بوضوح. النطاق: يشمل الفلاتر حسب القائمة والبحث داخل المطعم. التفاعلات: المستخدم، النظام، خدمة المحتوى. القيود/الافتراضات: توفر صور وأسعار محدثة. النتيجة: عرض منتجات قابلة للاختيار أو توضيح نفاد العناصر.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "المطعم"
                ],
                "preconditions": [
                    "اختيار مطعم صالح",
                    "اتصال إنترنت متاح",
                    "القوائم مفعلة للمطعم",
                    "اللغة مضبوطة"
                ],
                "steps": [
                    "يفتح المستخدم تبويب القوائم، فيعرض النظام الأقسام.",
                    "يبحث المستخدم عن عنصر، فيطبق النظام الفلترة.",
                    "ينتقل المستخدم بين الأقسام، فيحدث النظام العرض.",
                    "يختار المستخدم عنصراً، فيعرض النظام تفاصيله المختصرة.",
                    "يفتح المستخدم المزيد، فيحمل النظام التفاصيل الكاملة.",
                    "يعرض النظام شارات حارة وجديدة ومميزة.",
                    "يظهر النظام توافر العنصر لحظياً.",
                    "يوفر النظام إضافة سريعة للسلة."
                ],
                "business_rules": [
                    {
                        "id": "br_uc013_01",
                        "rule": "تُعرض العناصر غير المتاحة مع تعطيل الإضافة للسلة."
                    },
                    {
                        "id": "br_uc013_02",
                        "rule": "يجب تحديث الأسعار والضرائب فور تبدل الخيارات."
                    },
                    {
                        "id": "br_uc013_03",
                        "rule": "يجب دعم ترتيب سريع حسب السعر أو التقييم داخل القسم."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة قوائم المطعم",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط التسلسل",
                        "description": "Sequence Diagram: App fetches menus, filters products by section or search term, and opens product detail.",
                        "url": "https://brd-qi0f.onrender.com/static/f33a1d1c2f3c44a3906e4df899eb1872.svg"
                    }
                ]
            },
            {
                "id": "uc_014",
                "name": "تصفية وفرز المنتجات",
                "description": "الغرض: العثور على منتجات مناسبة بسرعة. النطاق: يشمل تصفية بالاسم، القسم، والسعر. التفاعلات: المستخدم، النظام، خدمة المحتوى. القيود/الافتراضات: بيانات تقييم وسعر دقيقة. النتيجة: قائمة مفلترة أو توضيح عدم التطابق.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "المطعم"
                ],
                "preconditions": [
                    "اختيار مطعم",
                    "توفر قائمة منتجات",
                    "اتصال إنترنت متاح"
                ],
                "steps": [
                    "يفتح المستخدم أدوات الفرز، فيعرضها النظام.",
                    "يحدد المستخدم السعر، فيطبق النظام النطاق.",
                    "يرتب المستخدم حسب التقييم، فيعيد النظام الترتيب.",
                    "يبحث المستخدم بالاسم، فيصفي النظام النتائج.",
                    "ينقر المستخدم مسح الفلاتر، فيعيد النظام الكل.",
                    "يختار المستخدم قسماً، فيعرض النظام عناصره.",
                    "يحفظ النظام الفلاتر مؤقتاً.",
                    "يعرض النظام عداد العناصر الظاهرة."
                ],
                "business_rules": [
                    {
                        "id": "br_uc014_01",
                        "rule": "يجب أن يعمل البحث بدون حساسية للحروف واللغة."
                    },
                    {
                        "id": "br_uc014_02",
                        "rule": "تُعرض الأسعار شاملة الضرائب حسب الإعدادات الإقليمية."
                    },
                    {
                        "id": "br_uc014_03",
                        "rule": "يؤدي الفرز إلى ترتيب مستقر عند التطابق."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة فلاتر المنتجات",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط النشاط",
                        "description": "Activity Diagram: User applies filters, App refines product list, sorts by rating or price, and displays counts.",
                        "url": "https://brd-qi0f.onrender.com/static/9f09271df6f54f6abd54b74ec06b5bba.svg"
                    }
                ]
            },
            {
                "id": "uc_015",
                "name": "تفاصيل المنتج والتخصيص",
                "description": "الغرض: تمكين تخصيص الخيارات والإضافات بدقة. النطاق: يشمل الأحجام، الإضافات، والتحقق من الإلزاميات. التفاعلات: المستخدم، النظام، خدمة التسعير. القيود/الافتراضات: أسعار محدثة وتوفر ديناميكي. النتيجة: إضافة ناجحة أو تنبيهات بخصوص الاختيارات المطلوبة.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "المطعم"
                ],
                "preconditions": [
                    "منتج صالح ومتاح",
                    "اتصال إنترنت متاح",
                    "القائمة محملة",
                    "قواعد تسعير مفعلة"
                ],
                "steps": [
                    "يفتح المستخدم المنتج، فيعرض النظام التفاصيل.",
                    "يختار المستخدم الحجم، فيحدث النظام السعر.",
                    "يضيف المستخدم إضافات، فيجمع النظام التكلفة.",
                    "يلبي المستخدم الخيارات الإلزامية، فيتحقق النظام.",
                    "يضبط المستخدم الكمية، فيعيد النظام الإجمالي.",
                    "يرى المستخدم شارات مثل حار أو نباتي، فيوضح النظام المعنى.",
                    "ينقر المستخدم إضافة للسلة، فيتحقق النظام من الصحة.",
                    "يحفظ النظام العنصر ويعرض شريط السلة."
                ],
                "business_rules": [
                    {
                        "id": "br_uc015_01",
                        "rule": "لا يُسمح بإضافة المنتج دون استكمال الخيارات الإلزامية."
                    },
                    {
                        "id": "br_uc015_02",
                        "rule": "تنعكس أسعار الإضافات فوراً في الإجمالي الظاهر."
                    },
                    {
                        "id": "br_uc015_03",
                        "rule": "يجب إظهار حالة عدم التوفر فورياً مع سبب مختصر."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة تفاصيل المنتج",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط التسلسل",
                        "description": "Sequence Diagram: User selects options, App recalculates price, validates mandatory choices, and adds item to cart.",
                        "url": "https://brd-qi0f.onrender.com/static/dbda5d016638450eb1042f55b179f080.svg"
                    }
                ]
            },
            {
                "id": "uc_016",
                "name": "إضافة العناصر إلى السلة",
                "description": "الغرض: بناء طلب متكامل بسهولة. النطاق: يشمل الإضافة من القوائم والتفاصيل والدفع اللاحق. التفاعلات: المستخدم، النظام، خدمة التسعير. القيود/الافتراضات: عناصر من مطاعم متعددة تُجمع منفصلة. النتيجة: سلة محفوظة مع إشعار وتلخيص فوري.",
                "actors": [
                    "المستخدم",
                    "النظام"
                ],
                "preconditions": [
                    "منتج متاح",
                    "اتصال إنترنت متاح",
                    "قواعد الأسعار والضرائب مفعلة"
                ],
                "steps": [
                    "يختار المستخدم منتجاً، فيعرض النظام الخيارات.",
                    "يضبط المستخدم التخصيص، فيحسب النظام الإجمالي.",
                    "يضغط المستخدم إضافة، فيضيفه النظام للسلة.",
                    "يعرض النظام شريط السلة بعدد العناصر.",
                    "يجمع النظام عناصر كل مطعم منفصلة.",
                    "يحفظ النظام السلة محلياً وللحساب.",
                    "يعرض النظام التوصيات بعد الإضافة.",
                    "يتيح النظام الانتقال إلى السلة فوراً."
                ],
                "business_rules": [
                    {
                        "id": "br_uc016_01",
                        "rule": "لا تُخلط عناصر مطاعم مختلفة ضمن طلب واحد للدفع."
                    },
                    {
                        "id": "br_uc016_02",
                        "rule": "تُحفظ السلة مؤقتاً عبر الأجهزة للمستخدم المسجل."
                    },
                    {
                        "id": "br_uc016_03",
                        "rule": "يجب إظهار ضرائب ورسوم واضحة ضمن الإجمالي."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة إضافة للسلة",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط النشاط",
                        "description": "Activity Diagram: User adds item, App groups by restaurant, recalculates totals, and persists the cart.",
                        "url": "https://brd-qi0f.onrender.com/static/da04ab10104d44829c90a2da0fc08020.svg"
                    }
                ]
            },
            {
                "id": "uc_017",
                "name": "تعديل السلة وعرض الأسعار",
                "description": "الغرض: إدارة محتوى السلة قبل الدفع. النطاق: يشمل تعديل الكميات والخيارات وحذف العناصر. التفاعلات: المستخدم، النظام، خدمة التسعير. القيود/الافتراضات: تحديث لحظي للأسعار والرسوم. النتيجة: سلة متسقة أو إخطارات بالأخطاء والتعارضات.",
                "actors": [
                    "المستخدم",
                    "النظام"
                ],
                "preconditions": [
                    "وجود عناصر في السلة",
                    "اتصال إنترنت متاح",
                    "قواعد المطعم متاحة",
                    "تحديد عملة العرض"
                ],
                "steps": [
                    "يفتح المستخدم السلة، فيعرض النظام العناصر مجمعة.",
                    "يزيد المستخدم الكمية، فيحدث النظام الإجمالي.",
                    "يعدل المستخدم خياراً، فيعيد النظام التسعير.",
                    "يحذف المستخدم عنصراً، فيعيد النظام الحساب.",
                    "يدخل المستخدم ملاحظة، فيحفظها النظام.",
                    "يعرض النظام الرسوم والضرائب مفصلة.",
                    "يتحقق النظام من حد أدنى للطلب.",
                    "يسمح النظام بالمتابعة إلى الدفع."
                ],
                "business_rules": [
                    {
                        "id": "br_uc017_01",
                        "rule": "لا يمكن متابعة الدفع دون تحقيق الحد الأدنى لكل مطعم."
                    },
                    {
                        "id": "br_uc017_02",
                        "rule": "تُعرض جميع الرسوم بشكل مفصل قبل التأكيد."
                    },
                    {
                        "id": "br_uc017_03",
                        "rule": "يجب الالتزام بتوافر العناصر قبل الدفع مع تحقق أخير."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة السلة",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": "https://brd-qi0f.onrender.com/static/b5e4220d0fe44f42a7843f0556c30b07.png"
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط التسلسل",
                        "description": "Sequence Diagram: App updates quantities, recalculates taxes and fees, revalidates availability, and enables checkout.",
                        "url": "https://brd-qi0f.onrender.com/static/dc39ae8fa6ac439193722414458c9d48.svg"
                    }
                ]
            },
            {
                "id": "uc_018",
                "name": "تطبيق كوبون الخصم",
                "description": "الغرض: منح خصومات عادلة ومحفزة. النطاق: يشمل إدخال الكود والتحقق وتطبيق التخفيض. التفاعلات: المستخدم، النظام، خدمة الكوبونات. القيود/الافتراضات: قيود فترة وصلاحية واستخدام. النتيجة: تخفيض مطبق أو إشعار سبب الرفض.",
                "actors": [
                    "المستخدم",
                    "النظام"
                ],
                "preconditions": [
                    "سلة تحتوي عناصر مؤهلة",
                    "اتصال إنترنت متاح",
                    "كوبون صالح أو قيد التحقق"
                ],
                "steps": [
                    "يفتح المستخدم حقل الكوبون، فيعرضه النظام.",
                    "يدخل المستخدم الكود، فيتحقق النظام من التنسيق.",
                    "يرسل النظام الكود للتحقق من الصلاحية.",
                    "تعود النتيجة، فيطبق النظام الخصم عند النجاح.",
                    "يعرض النظام تحديث الإجمالي وتفاصيل الخصم.",
                    "يوضح النظام سبب الرفض عند الفشل.",
                    "يسمح النظام بإزالة الكوبون.",
                    "يمنع النظام تكرار الاستخدام غير المسموح."
                ],
                "business_rules": [
                    {
                        "id": "br_uc018_01",
                        "rule": "لا يُسمح بتراكب الكوبونات إلا وفق سياسة السلسلة."
                    },
                    {
                        "id": "br_uc018_02",
                        "rule": "يجب التحقق من أهلية المطعم والمنطقة للكوبون."
                    },
                    {
                        "id": "br_uc018_03",
                        "rule": "تُسجل محاولة استخدام الكوبون لأغراض التدقيق."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة الكوبون",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط النشاط",
                        "description": "Activity Diagram: User submits coupon, App validates with Coupon Service, applies discount, and refreshes totals.",
                        "url": "https://brd-qi0f.onrender.com/static/69281cdeba9e40e18c2c378014ec0cab.svg"
                    }
                ]
            },
            {
                "id": "uc_019",
                "name": "التحقق من حد أدنى للطلب",
                "description": "الغرض: ضمان جدوى الطلب اقتصادياً. النطاق: يشمل حساب الحد الأدنى لكل مطعم. التفاعلات: المستخدم، النظام، قواعد المطعم. القيود/الافتراضات: حدود مختلفة حسب المنطقة والزمن. النتيجة: السماح بالمتابعة أو توجيه لزيادة السلة.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "المطعم"
                ],
                "preconditions": [
                    "سلة تحتوي عناصر",
                    "اتصال إنترنت متاح",
                    "قواعد المطعم محملة"
                ],
                "steps": [
                    "يفتح المستخدم السلة، فيحسب النظام الإجماليات.",
                    "يقارن النظام الإجمالي بحد المطعم الأدنى.",
                    "يعرض النظام رسالة عند عدم الاستيفاء.",
                    "يقترح النظام عناصر تكميلية.",
                    "يزيد المستخدم عناصر، فيحدث النظام الإجماليات.",
                    "يتحقق النظام مجدداً بعد كل تغيير.",
                    "يعرض النظام السماح بالمتابعة عند الاستيفاء.",
                    "يحفظ النظام حالة التحقق في الجلسة."
                ],
                "business_rules": [
                    {
                        "id": "br_uc019_01",
                        "rule": "يجب تطبيق الحد الأدنى لكل مطعم بشكل مستقل."
                    },
                    {
                        "id": "br_uc019_02",
                        "rule": "يُستثنى الكوبون من حساب الحد الأدنى إذا حددت السياسة."
                    },
                    {
                        "id": "br_uc019_03",
                        "rule": "تُعرض قيمة الحد الأدنى بوضوح ضمن ملخص السلة."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة حد الطلب",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط التسلسل",
                        "description": "Sequence Diagram: App compares cart subtotal with Restaurant Rules and toggles checkout availability.",
                        "url": "https://brd-qi0f.onrender.com/static/d540e938b9fb4616bbbec69b40b3966c.svg"
                    }
                ]
            },
            {
                "id": "uc_020",
                "name": "اختيار طريقة الدفع",
                "description": "الغرض: تحديد وسيلة دفع مناسبة وآمنة. النطاق: يشمل دفع إلكتروني ونقد عند التسليم إذا متاح. التفاعلات: المستخدم، النظام، بوابة الدفع. القيود/الافتراضات: توافر بوابة معتمدة وسياسات المنطقة. النتيجة: طريقة محفوظة أو توضيح عدم التوفر.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "بوابة الدفع"
                ],
                "preconditions": [
                    "سلة مكتملة وصالحة",
                    "اتصال إنترنت آمن",
                    "تفعيل طرق الدفع المدعومة",
                    "المستخدم مسجل الدخول"
                ],
                "steps": [
                    "يفتح المستخدم صفحة الدفع، فيعرض النظام الخيارات.",
                    "يختار المستخدم بطاقة، فيهيئ النظام النموذج.",
                    "يدخل المستخدم بيانات الدفع، فيتحقق النظام لحظياً.",
                    "يرسل النظام الطلب لبوابة الدفع للتفويض.",
                    "تعود استجابة التفويض، فيخزنها النظام مؤقتاً.",
                    "يختار المستخدم نقداً، فيتحقق النظام من السماحية.",
                    "يحفظ النظام التفضيل للطبات المستقبلية.",
                    "يعرض النظام ملخص الطريقة المختارة."
                ],
                "business_rules": [
                    {
                        "id": "br_uc020_01",
                        "rule": "لا يُعرض نقد عند التسليم إلا للمناطق والمطاعم المصرح بها."
                    },
                    {
                        "id": "br_uc020_02",
                        "rule": "يجب عدم تخزين بيانات البطاقة خارج بوابة الدفع الموثوقة."
                    },
                    {
                        "id": "br_uc020_03",
                        "rule": "الاتصال بالبوابة يتم عبر HTTPS مع مصادقة قوية."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة طرق الدفع",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط النشاط",
                        "description": "Activity Diagram: User selects payment method, App validates availability, and pre-authorizes card via Payment Gateway.",
                        "url": "https://brd-qi0f.onrender.com/static/b28945e6075e4b04a0671ce31ab20389.svg"
                    }
                ]
            },
            {
                "id": "uc_021",
                "name": "إتمام الطلب والتأكيد",
                "description": "الغرض: إنهاء عملية الشراء بشكل موثوق. النطاق: يشمل ملخص الطلب، العنوان، والدفع النهائي. التفاعلات: المستخدم، النظام، بوابة الدفع، المطعم. القيود/الافتراضات: توفر العناصر وزمن التحضير. النتيجة: تأكيد برقم طلب أو معالجة أخطاء واسترجاع.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "بوابة الدفع",
                    "المطعم"
                ],
                "preconditions": [
                    "المستخدم مسجل الدخول",
                    "سلة صالحة ومحققة",
                    "عنوان خدمة قابل للتوصيل",
                    "طريقة دفع محددة"
                ],
                "steps": [
                    "يفتح المستخدم صفحة الملخص، فيعرض النظام التفاصيل.",
                    "يختار المستخدم عنواناً، فيتحقق النظام من الخدمة.",
                    "يوافق المستخدم على الشروط، فيسجلها النظام.",
                    "يضغط المستخدم تأكيد، فيقفل النظام السلة.",
                    "يرسل النظام طلب الدفع النهائي للبوابة.",
                    "يحصل النظام على نجاح، فينشئ الطلب لدى المطعم.",
                    "يعرض النظام رقم الطلب وحالة مبدئية.",
                    "يرسل النظام إشعاراً ويُحدث التاريخ."
                ],
                "business_rules": [
                    {
                        "id": "br_uc021_01",
                        "rule": "لا يُنشأ الطلب قبل نجاح دفع إلكتروني أو قبول نقد عند التسليم."
                    },
                    {
                        "id": "br_uc021_02",
                        "rule": "يجب قفل السلة لمنع التعديل بعد التأكيد."
                    },
                    {
                        "id": "br_uc021_03",
                        "rule": "تُسجّل جميع الأحداث للتتبع والتسويات المالية."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة تأكيد الطلب",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط التسلسل",
                        "description": "Sequence Diagram: App locks cart, completes payment via Gateway, creates order with Restaurant Service, and returns confirmation.",
                        "url": "https://brd-qi0f.onrender.com/static/970d442006b04b93b29cd36add0f5fd0.svg"
                    }
                ]
            },
            {
                "id": "uc_022",
                "name": "تتبع الطلب المباشر",
                "description": "الغرض: تمكين متابعة التوصيل لحظياً. النطاق: يشمل حالة الطلب وخريطة التتبع. التفاعلات: المستخدم، النظام، شريك التوصيل، مزود الخرائط. القيود/الافتراضات: توافر GPS من الشريك. النتيجة: تحديثات حية أو fallback لرسائل الحالة.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "شريك التوصيل",
                    "مزود الخرائط"
                ],
                "preconditions": [
                    "طلب قائم بحالة نشطة",
                    "اتصال إنترنت متاح",
                    "صلاحية الوصول للطلب",
                    "تفعيل خدمات الخريطة"
                ],
                "steps": [
                    "يفتح المستخدم شاشة التتبع، فيجلب النظام الحالة.",
                    "يعرض النظام خط الزمن للمراحل.",
                    "عند الخروج للتسليم، يعرض النظام موقع المندوب.",
                    "يحدّث النظام الموقع دورياً.",
                    "يعرض النظام زمن الوصول المقدر.",
                    "يوفر النظام زر تحديث سريع.",
                    "يعرض النظام إشعارات بالحالات الجديدة.",
                    "يوثق النظام التسليم النهائي."
                ],
                "business_rules": [
                    {
                        "id": "br_uc022_01",
                        "rule": "تظهر الخريطة فقط إذا توفرت بيانات GPS موثوقة."
                    },
                    {
                        "id": "br_uc022_02",
                        "rule": "يجب إخفاء بيانات المندوب الحساسة عن غير أصحاب الطلب."
                    },
                    {
                        "id": "br_uc022_03",
                        "rule": "تُرسل إشعارات الحالة وفق تفضيلات المستخدم والمنصة."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة تتبع الطلب",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط النشاط",
                        "description": "Activity Diagram: App polls Delivery Service for status and courier GPS, updates map, and pushes notifications.",
                        "url": "https://brd-qi0f.onrender.com/static/e7ab175470cb4d58b96cd1c8da20bbfe.svg"
                    }
                ]
            },
            {
                "id": "uc_023",
                "name": "الاتصال بالمندوب عبر الجوال",
                "description": "الغرض: توفير قناة تواصل سريعة مع المندوب. النطاق: يشمل عرض رقم المندوب والاتصال. التفاعلات: المستخدم، النظام، شريك التوصيل. القيود/الافتراضات: متاح على الجوال فقط. النتيجة: اتصال ناجح أو رسالة توضح القيود المنصية.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "شريك التوصيل"
                ],
                "preconditions": [
                    "طلب بحالة خارج للتسليم",
                    "توفر رقم المندوب",
                    "الجهاز هاتف يدعم الاتصال",
                    "صلاحية الوصول للطلب"
                ],
                "steps": [
                    "يفتح المستخدم شاشة التتبع، فيظهر زر الاتصال.",
                    "ينقر المستخدم الاتصال، فيتحقق النظام من المنصة.",
                    "يفتح النظام طالب الهاتف بالمعلومات.",
                    "يؤكد المستخدم الاتصال، فيبدأ النظام المكالمة.",
                    "يُلغي المستخدم، فيغلق النظام طالب الهاتف.",
                    "يعرض النظام بدائل المراسلة عند عدم الدعم.",
                    "يسجل النظام محاولة الاتصال.",
                    "يحتفظ النظام بالخصوصية بعدم كشف الرقم علناً."
                ],
                "business_rules": [
                    {
                        "id": "br_uc023_01",
                        "rule": "زر الاتصال يظهر على تطبيقات الجوال فقط."
                    },
                    {
                        "id": "br_uc023_02",
                        "rule": "لا يُعرض الرقم إلا لأصحاب الطلب الموثقين."
                    },
                    {
                        "id": "br_uc023_03",
                        "rule": "تُحترم سياسات الشريك لزمن الإتاحة والتواصل."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة اتصال المندوب",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط التسلسل",
                        "description": "Sequence Diagram: User taps Call, App verifies platform, launches dialer with courier number from Delivery Service.",
                        "url": "https://brd-qi0f.onrender.com/static/aa6702a089d0488b93e3f3b1fd19c757.svg"
                    }
                ]
            },
            {
                "id": "uc_024",
                "name": "عرض الطلبات السابقة",
                "description": "الغرض: تمكين مراجعة المشتريات التاريخية. النطاق: يشمل قائمة الطلبات وتفاصيلها. التفاعلات: المستخدم، النظام، خدمة الطلبات. القيود/الافتراضات: ترقيم صفحات وتحميل كسول. النتيجة: عرض منظم أو إشعار عند عدم وجود طلبات.",
                "actors": [
                    "المستخدم",
                    "النظام"
                ],
                "preconditions": [
                    "المستخدم مسجل الدخول",
                    "اتصال إنترنت متاح",
                    "توفر بيانات الطلبات"
                ],
                "steps": [
                    "يفتح المستخدم قسم الطلبات، فيعرض النظام قائمة.",
                    "يطبق المستخدم فلترة بالتاريخ، فيحدث النظام.",
                    "يختار المستخدم طلباً، فيعرض النظام التفاصيل.",
                    "يعرض النظام العناصر والمبالغ والخصومات.",
                    "يوفر النظام زر إعادة طلب.",
                    "يسمح النظام بتنزيل فاتورة عند الطلب.",
                    "يحفظ النظام آخر فلتر مستخدم.",
                    "يعرض النظام حالة لا توجد بيانات عند الحاجة."
                ],
                "business_rules": [
                    {
                        "id": "br_uc024_01",
                        "rule": "لا تظهر الطلبات إلا لصاحب الحساب نفسه."
                    },
                    {
                        "id": "br_uc024_02",
                        "rule": "يجب إخفاء بيانات الدفع الحساسة من تفاصيل الطلب."
                    },
                    {
                        "id": "br_uc024_03",
                        "rule": "يتم ترقيم النتائج للحفاظ على الأداء."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة سجل الطلبات",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط النشاط",
                        "description": "Activity Diagram: App paginates orders, filters by date, and opens order detail view.",
                        "url": ""
                    }
                ]
            },
            {
                "id": "uc_025",
                "name": "إعادة الطلب من السجل",
                "description": "الغرض: تسريع إتمام طلب مشابه سابقاً. النطاق: يشمل نسخ العناصر والتحقق من توفرها. التفاعلات: المستخدم، النظام، المطعم. القيود/الافتراضات: تغيّر الأسعار والتوفر محتمل. النتيجة: سلة محدثة أو تنبيهات بالفروق والتعديلات.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "المطعم"
                ],
                "preconditions": [
                    "طلب سابق متاح",
                    "المستخدم مسجل الدخول",
                    "اتصال إنترنت متاح"
                ],
                "steps": [
                    "يفتح المستخدم تفاصيل طلب سابق، فيعرض النظام العناصر.",
                    "ينقر المستخدم إعادة الطلب، فينشئ النظام سلة جديدة.",
                    "يتحقق النظام من التوفر لكل عنصر.",
                    "يحدّث النظام الأسعار وفق القواعد الحالية.",
                    "يبدل النظام الخيارات غير المتاحة باقتراحات.",
                    "يحفظ النظام السلة ويعرض الملخص.",
                    "يسمح النظام بالتعديل قبل الدفع.",
                    "يوجه النظام لخطوة الدفع عند الجاهزية."
                ],
                "business_rules": [
                    {
                        "id": "br_uc025_01",
                        "rule": "يجب إعادة التحقق من التوفر والأسعار قبل الإضافة للسلة."
                    },
                    {
                        "id": "br_uc025_02",
                        "rule": "لا تُعاد العناصر من مطاعم لم تعد تخدم الموقع الحالي."
                    },
                    {
                        "id": "br_uc025_03",
                        "rule": "يجب تمييز العناصر المُبدلة بوضوح للمستخدم."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة إعادة الطلب",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": "https://brd-qi0f.onrender.com/static/f27c143d923d4426b2effcfac6e6e692.png"
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط التسلسل",
                        "description": "Sequence Diagram: App clones past order, revalidates items with Restaurant Service, recalculates prices, and fills cart.",
                        "url": "https://brd-qi0f.onrender.com/static/9a134e5c954c430198db17afe23f90b6.svg"
                    }
                ]
            },
            {
                "id": "uc_026",
                "name": "إدارة المفضلة للمطاعم",
                "description": "الغرض: حفظ مطاعم مفضلة للوصول السريع. النطاق: يشمل إضافة وإزالة وعرض المفضلات. التفاعلات: المستخدم، النظام، خدمة المحتوى. القيود/الافتراضات: مزامنة عبر الأجهزة. النتيجة: قائمة مفضلات محدثة أو إشعار بالحاجة لتسجيل الدخول.",
                "actors": [
                    "المستخدم",
                    "النظام"
                ],
                "preconditions": [
                    "المستخدم مسجل الدخول",
                    "اتصال إنترنت متاح",
                    "مطعم صالح للاختيار"
                ],
                "steps": [
                    "ينقر المستخدم قلب المفضلة، فيتحقق النظام من الجلسة.",
                    "يضيف النظام المطعم لقائمة المفضلات.",
                    "يعرض النظام حالة التبديل فوراً.",
                    "يفتح المستخدم صفحة المفضلات، فيعرض النظام القائمة.",
                    "يزيل المستخدم مطعماً، فيحدّثه النظام.",
                    "يرتب المستخدم القائمة، فيحفظ النظام الترتيب.",
                    "يُزامن النظام التغييرات مع الحساب.",
                    "يعرض النظام توصيات مرتبطة."
                ],
                "business_rules": [
                    {
                        "id": "br_uc026_01",
                        "rule": "لا تتاح المفضلات للضيوف دون تسجيل الدخول."
                    },
                    {
                        "id": "br_uc026_02",
                        "rule": "يجب مزامنة المفضلات مع السحابة لكل حساب."
                    },
                    {
                        "id": "br_uc026_03",
                        "rule": "تظهر المطاعم غير المتاحة مع إشارة الحالة فقط."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة المفضلة",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": "https://brd-qi0f.onrender.com/static/70e44af74c0e4893b8a0ef8c41ed15ab.png"
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط النشاط",
                        "description": "Activity Diagram: User toggles favorite, App updates cloud list, and renders favorites page.",
                        "url": "https://brd-qi0f.onrender.com/static/5b088d44331b46f9bc0c4614bd67e737.svg"
                    }
                ]
            },
            {
                "id": "uc_027",
                "name": "تقييم المطعم بعد الطلب",
                "description": "الغرض: جمع تعليقات لتحسين الجودة. النطاق: يشمل تقييم النجوم ونص المراجعة. التفاعلات: المستخدم، النظام، وحدة المراجعات، فريق المراجعة. القيود/الافتراضات: متاح بعد التسليم فقط. النتيجة: مراجعة منشورة أو قيد المراجعة مع إشعار.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "المطعم"
                ],
                "preconditions": [
                    "طلب مكتمل بالتسليم",
                    "المستخدم مسجل الدخول",
                    "اتصال إنترنت متاح"
                ],
                "steps": [
                    "يفتح المستخدم الطلب المكتمل، فيعرض النظام خيار التقييم.",
                    "يحدد المستخدم النجوم، فيسجلها النظام.",
                    "يكتب المستخدم تعليقاً، فيتحقق النظام من اللغة.",
                    "يرفع المستخدم التقييم، فيخضعه النظام للمراجعة.",
                    "يعرض النظام متوسط التقييم المحدّث.",
                    "يوضح النظام حالة المراجعة عند التعليق.",
                    "يسمح النظام بتعديل خلال نافذة زمنية.",
                    "يرسل النظام إشعار استلام المراجعة."
                ],
                "business_rules": [
                    {
                        "id": "br_uc027_01",
                        "rule": "يُسمح بالتقييم فقط بعد تسليم الطلب فعلياً."
                    },
                    {
                        "id": "br_uc027_02",
                        "rule": "تخضع المراجعات للمراقبة ضد الإساءة والمحتوى المحظور."
                    },
                    {
                        "id": "br_uc027_03",
                        "rule": "يمكن تعديل المراجعة خلال مدة محدودة فقط."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة تقييم المطعم",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط التسلسل",
                        "description": "Sequence Diagram: App validates delivered order, accepts rating and review, queues moderation, and updates aggregate rating.",
                        "url": "https://brd-qi0f.onrender.com/static/e08153f87d6c472d8bd6ae2c94a5fb03.svg"
                    }
                ]
            },
            {
                "id": "uc_028",
                "name": "تقييم المنتجات مع الصور",
                "description": "الغرض: توفير تغذية راجعة مفصلة للمنتجات. النطاق: يشمل نجوم، نص، وصور اختيارية. التفاعلات: المستخدم، النظام، وحدة الوسائط. القيود/الافتراضات: حجم وصيغ صور محددة. النتيجة: نشر أو تعليق للمراجعة مع توضيح.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "المطعم"
                ],
                "preconditions": [
                    "طلب مكتمل يحتوي المنتج",
                    "المستخدم مسجل الدخول",
                    "اتصال إنترنت متاح"
                ],
                "steps": [
                    "يفتح المستخدم تفاصيل المنتج في الطلب، فيعرض النظام نموذج التقييم.",
                    "يحدد المستخدم النجوم، فيسجلها النظام.",
                    "يكتب المستخدم تعليقاً، فيتحقق النظام من الطول.",
                    "يرفع المستخدم صوراً، فيضغط النظام حجمها.",
                    "يرسل المستخدم المراجعة، فيحفظها النظام.",
                    "يعرض النظام حالة المراجعة ومكان النشر.",
                    "يوفر النظام خيار حذف الصورة.",
                    "يحدث النظام متوسط تقييم المنتج."
                ],
                "business_rules": [
                    {
                        "id": "br_uc028_01",
                        "rule": "تُحدّد أحجام الصور وصيغها وتُضغط قبل التخزين."
                    },
                    {
                        "id": "br_uc028_02",
                        "rule": "يُحظر نشر صور شخصية أو حساسة وفق السياسات."
                    },
                    {
                        "id": "br_uc028_03",
                        "rule": "يجب ربط التقييم بطلب مكتمل لنفس المنتج."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة تقييم المنتج",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط النشاط",
                        "description": "Activity Diagram: User rates product, uploads images, App validates constraints, stores review, and updates product rating.",
                        "url": "https://brd-qi0f.onrender.com/static/a630c264e9bf40dab4bf7fa71e98311f.svg"
                    }
                ]
            },
            {
                "id": "uc_029",
                "name": "إدارة تفضيلات الإشعارات",
                "description": "الغرض: ضبط أنواع الإشعارات المسموح بها. النطاق: يشمل إشعارات الطلبات والتسويق. التفاعلات: المستخدم، النظام، خدمة الإشعارات، أذونات الجهاز. القيود/الافتراضات: احترام صلاحيات المنصة. النتيجة: حفظ التفضيلات وتطبيقها مباشرة.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "خدمة الإشعارات"
                ],
                "preconditions": [
                    "المستخدم مسجل الدخول",
                    "أذونات الجهاز مضبوطة",
                    "اتصال إنترنت متاح"
                ],
                "steps": [
                    "يفتح المستخدم الإشعارات، فيعرض النظام الأقسام.",
                    "يعطل المستخدم التسويق، فيحفظ النظام الحالة.",
                    "يبقي المستخدم إشعارات الطلب قيد التشغيل، فيؤكد النظام.",
                    "يختبر المستخدم إشعاراً، فيرسل النظام تنبيه اختبار.",
                    "يربط النظام التفضيلات بالحساب.",
                    "يعرض النظام شرح الأذونات لكل منصة.",
                    "يوجه النظام لتمكين الأذونات عند التعطيل.",
                    "يؤكد النظام تحديث الإعدادات."
                ],
                "business_rules": [
                    {
                        "id": "br_uc029_01",
                        "rule": "لا يمكن تعطيل إشعارات الحالة الحرجة دون إذن المنصة."
                    },
                    {
                        "id": "br_uc029_02",
                        "rule": "يجب احترام موافقة المستخدم على التسويق وفق القوانين."
                    },
                    {
                        "id": "br_uc029_03",
                        "rule": "تُخزن التفضيلات لكل جهاز وحساب بشكل مستقل."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة الإشعارات",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط التسلسل",
                        "description": "Sequence Diagram: User toggles categories, App updates Notification Service settings and tests delivery.",
                        "url": "https://brd-qi0f.onrender.com/static/653024f254274acab153088ed0fd8315.svg"
                    }
                ]
            },
            {
                "id": "uc_030",
                "name": "استعراض الإعلانات والعروض",
                "description": "الغرض: إبراز عروض ترويجية مستهدفة. النطاق: يشمل لافتات رئيسية وروابط موجهة. التفاعلات: المستخدم، النظام، خدمة الإعلانات. القيود/الافتراضات: جدولة واستهداف حسب الموقع. النتيجة: نقرات محسوبة أو إخفاء غير مناسب.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "المطعم"
                ],
                "preconditions": [
                    "اتصال إنترنت متاح",
                    "توافر لافتات بالحملة",
                    "اللغة مضبوطة"
                ],
                "steps": [
                    "يفتح المستخدم الصفحة الرئيسية، فيعرض النظام لافتات.",
                    "يمرر المستخدم، فيتناوب النظام العروض.",
                    "ينقر المستخدم لافتة، فيفتح النظام الوجهة.",
                    "يتتبع النظام النقر لأغراض التحليل.",
                    "يعرض النظام شارة العرض في المطعم المستهدف.",
                    "يشير النظام لانتهاء العرض عند اللزوم.",
                    "يحترم النظام تفضيلات الخصوصية.",
                    "يحمل النظام بدائل عند فشل الصورة."
                ],
                "business_rules": [
                    {
                        "id": "br_uc030_01",
                        "rule": "يجب عدم تتبع المستخدم إلا بموافقته الصريحة."
                    },
                    {
                        "id": "br_uc030_02",
                        "rule": "تُطبّق قواعد الاستهداف دون كشف بيانات شخصية."
                    },
                    {
                        "id": "br_uc030_03",
                        "rule": "تُعرض تواريخ البدء والانتهاء بوضوح عند الحاجة."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة العروض",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط النشاط",
                        "description": "Activity Diagram: App loads banners, logs impressions and clicks, and navigates to targeted restaurant or category.",
                        "url": "https://brd-qi0f.onrender.com/static/8e21a5f4cd80428eb430882ed19b5b05.svg"
                    }
                ]
            },
            {
                "id": "uc_031",
                "name": "التوصيات الشخصية الذكية",
                "description": "الغرض: تقديم مقترحات ملائمة لذوق المستخدم. النطاق: يشمل أقسام الأقرب والمقترح لك. التفاعلات: المستخدم، النظام، محرك التوصيات. القيود/الافتراضات: خصوصية البيانات محفوظة. النتيجة: قائمة موصى بها أو بدائل عامة عند نقص البيانات.",
                "actors": [
                    "المستخدم",
                    "النظام"
                ],
                "preconditions": [
                    "المستخدم لديه نشاط سابق أو موقع محدد",
                    "اتصال إنترنت متاح",
                    "محرك التوصيات يعمل"
                ],
                "steps": [
                    "يفتح المستخدم الصفحة الرئيسية، فيستدعي النظام التوصيات.",
                    "يعرض النظام مطاعم ومنتجات مقترحة.",
                    "يتفاعل المستخدم بالتفضيل، فيتعلم النظام.",
                    "يحدّث النظام الأوزان حسب السلوك.",
                    "يوضح النظام سبب التوصية عند الإمكان.",
                    "يعرض النظام عروضاً ذات صلة.",
                    "يتيح النظام تحديث التوصيات يدوياً.",
                    "يحفظ النظام الأداء للتحسين."
                ],
                "business_rules": [
                    {
                        "id": "br_uc031_01",
                        "rule": "لا تُستخدم بيانات شخصية خارج غرض التوصية المصرح به."
                    },
                    {
                        "id": "br_uc031_02",
                        "rule": "يجب أن تكون التوصيات قابلة للتفسير عند طلب المستخدم."
                    },
                    {
                        "id": "br_uc031_03",
                        "rule": "تُحترم إعدادات اللغة والموقع في النتائج."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة التوصيات",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط التسلسل",
                        "description": "Sequence Diagram: App requests recommendations, Engine returns ranked items, App explains and renders lists.",
                        "url": "https://brd-qi0f.onrender.com/static/342c3097f6e341bc8df19613723783f3.svg"
                    }
                ]
            },
            {
                "id": "uc_032",
                "name": "إدارة الخصوصية والموافقات",
                "description": "الغرض: التحكم في جمع البيانات والكوكيز. النطاق: يشمل موافقات الموقع والإشعارات والتحليلات. التفاعلات: المستخدم، النظام، خدمات الطرف الثالث. القيود/الافتراضات: الامتثال للقوانين المحلية. النتيجة: تطبيق الإعدادات أو تقييد الميزات مع توضيح.",
                "actors": [
                    "المستخدم",
                    "النظام"
                ],
                "preconditions": [
                    "التطبيق يعرض سياسة خصوصية",
                    "اتصال إنترنت متاح",
                    "وحدات التحليلات قابلة للتعطيل"
                ],
                "steps": [
                    "يفتح المستخدم صفحة الخصوصية، فيعرض النظام الأقسام.",
                    "يعطل المستخدم التحليلات، فيوقفها النظام.",
                    "يدير المستخدم موافقة الموقع، فيطبق النظام القيود.",
                    "يضبط المستخدم إشعارات التسويق، فيحفظ النظام.",
                    "يعرض النظام روابط السياسة والتفاصيل.",
                    "يخزن النظام الموافقات زمنياً.",
                    "يوضح النظام أثر كل خيار.",
                    "يقدم النظام خيار استرجاع الإعدادات الافتراضية."
                ],
                "business_rules": [
                    {
                        "id": "br_uc032_01",
                        "rule": "لا تُفعّل التحليلات التسويقية دون موافقة صريحة."
                    },
                    {
                        "id": "br_uc032_02",
                        "rule": "يجب إتاحة سحب الموافقة بسهولة في أي وقت."
                    },
                    {
                        "id": "br_uc032_03",
                        "rule": "تُسجل الموافقات مع الطابع الزمني والجهاز للحفظ."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة الخصوصية",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط النشاط",
                        "description": "Activity Diagram: User toggles consents, App updates settings, disables trackers, and persists consent log.",
                        "url": "https://brd-qi0f.onrender.com/static/61146ca2b0b444bf9f4ce21ece5a7e5f.svg"
                    }
                ]
            },
            {
                "id": "uc_033",
                "name": "تسجيل الخروج وإنهاء الجلسة",
                "description": "الغرض: حماية الحساب بإنهاء الجلسة بأمان. النطاق: يشمل إنهاء الرموز ومسح التخزين. التفاعلات: المستخدم، النظام، خدمة المصادقة. القيود/الافتراضات: أجهزة متعددة محتملة. النتيجة: خروج كامل أو إبلاغ بوجود خطأ وإعادة المحاولة.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "خدمة المصادقة"
                ],
                "preconditions": [
                    "المستخدم مسجل الدخول",
                    "اتصال إنترنت متاح",
                    "جلسة نشطة صالحة"
                ],
                "steps": [
                    "يفتح المستخدم القائمة، فيختار تسجيل الخروج.",
                    "يرسل النظام طلب إبطال الرمز للخادم.",
                    "يمسح النظام التخزين المحلي الآمن.",
                    "يعيد النظام المستخدم لشاشة الدخول.",
                    "يعرض النظام رسالة تأكيد.",
                    "يوفر النظام خيار إنهاء كل الجلسات.",
                    "يؤكد النظام الإنهاء عبر إشعار.",
                    "يعالج النظام أي خطأ برسالة آمنة."
                ],
                "business_rules": [
                    {
                        "id": "br_uc033_01",
                        "rule": "يجب إبطال رموز الوصول والتحديث فوراً عند الخروج."
                    },
                    {
                        "id": "br_uc033_02",
                        "rule": "لا تُعرض تفاصيل أخطاء حساسة للمستخدم."
                    },
                    {
                        "id": "br_uc033_03",
                        "rule": "يُخلى التخزين المحلي من البيانات الشخصية بعد الخروج."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة تسجيل الخروج",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط التسلسل",
                        "description": "Sequence Diagram: App calls Auth Service to revoke tokens, clears local storage, and redirects to login.",
                        "url": "https://brd-qi0f.onrender.com/static/b4edf03094ea492d9481325dfc8d1db8.svg"
                    }
                ]
            },
            {
                "id": "uc_034",
                "name": "إعدادات التطبيق العامة",
                "description": "الغرض: تخصيص سلوك التطبيق للمستخدم. النطاق: يشمل اللغة، المنطقة، والإشعارات. التفاعلات: المستخدم، النظام، وحدات الإعدادات. القيود/الافتراضات: حفظ سحابي ومحلي. النتيجة: تطبيق الإعدادات فورياً أو إشعار بإعادة التشغيل الجزئي.",
                "actors": [
                    "المستخدم",
                    "النظام"
                ],
                "preconditions": [
                    "المستخدم لديه جلسة أو ضيف",
                    "اتصال إنترنت متاح للحفظ السحابي",
                    "الإعدادات الافتراضية محملة"
                ],
                "steps": [
                    "يفتح المستخدم الإعدادات، فيعرض النظام الأقسام.",
                    "يعدّل المستخدم اللغة، فيطبقها النظام.",
                    "يضبط المستخدم المنطقة، فيحدّث النظام العملة والتنسيقات.",
                    "يغيّر المستخدم إشعارات، فيحفظها النظام.",
                    "يعيد النظام تحميل المحتوى المتأثر.",
                    "يحفظ النظام نسخة سحابية.",
                    "يعرض النظام معاينة فورية للتغييرات.",
                    "يوضح النظام الأثر على التوصيات."
                ],
                "business_rules": [
                    {
                        "id": "br_uc034_01",
                        "rule": "تعكس التنسيقات الإقليمية العملة والمسافات تلقائياً."
                    },
                    {
                        "id": "br_uc034_02",
                        "rule": "تتزامن الإعدادات عبر الأجهزة للحساب نفسه."
                    },
                    {
                        "id": "br_uc034_03",
                        "rule": "يجب توثيق آخر تغيير مع مصدر الجهاز."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة الإعدادات العامة",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط النشاط",
                        "description": "Activity Diagram: User edits preferences, App applies changes, refreshes content, and syncs to cloud.",
                        "url": "https://brd-qi0f.onrender.com/static/20c40005a34345d9a5c7354d02548ef1.svg"
                    }
                ]
            },
            {
                "id": "uc_035",
                "name": "تصفح الخريطة التفاعلية",
                "description": "الغرض: استكشاف مطاعم قريبة بصرياً. النطاق: يشمل عرض دبابيس المطاعم والتصفية على الخريطة. التفاعلات: المستخدم، النظام، مزود الخرائط. القيود/الافتراضات: أداء خرائط مستقر وفلاتر متزامنة. النتيجة: فتح تفاصيل مطعم أو توضيح عدم توفر في المنطقة.",
                "actors": [
                    "المستخدم",
                    "النظام",
                    "مزود الخرائط"
                ],
                "preconditions": [
                    "تم تحديد موقع أو منطقة",
                    "اتصال إنترنت متاح",
                    "خريطة قابلة للتحميل",
                    "بيانات مطاعم قريبة"
                ],
                "steps": [
                    "يفتح المستخدم تبويب الخريطة، فيعرض النظام دبابيس.",
                    "يحرك المستخدم الخريطة، فيحدّث النظام النتائج.",
                    "يطبق المستخدم فلاتر، فيصفيها النظام مكانياً.",
                    "ينقر المستخدم دبوساً، فيعرض النظام بطاقة مختصرة.",
                    "يفتح المستخدم التفاصيل، فينتقل النظام للصفحة.",
                    "يعرض النظام المسافة والزمن التقديري.",
                    "يحفظ النظام آخر موضع للخريطة.",
                    "يعالج النظام مناطق بلا نتائج بحالة واضحة."
                ],
                "business_rules": [
                    {
                        "id": "br_uc035_01",
                        "rule": "تُحسب المسافات من المركز الحالي للخريطة أو موقع المستخدم."
                    },
                    {
                        "id": "br_uc035_02",
                        "rule": "تُطبق نفس فلاتر قائمة المطاعم على عرض الخريطة."
                    },
                    {
                        "id": "br_uc035_03",
                        "rule": "يجب تقليص طلبات الشبكة باستخدام تجميع واستعلامات مجدولة."
                    }
                ],
                "ui": [
                    {
                        "name": "واجهة خريطة المطاعم",
                        "description": "Layout: clean grid with generous spacing and clear hierarchy. Navigation: top header with tabs and breadcrumbs guiding the ux flow. Forms: concise inputs with inline validation, contextual errors, and success messages. Data Display: cards and sortable lists with filters and pagination. Interactions: primary buttons, hover and focus states, loading indicators, empty states, toasts, and confirmation dialogs. Responsive: mobile app and desktop responsive design across defined breakpoints. Accessibility: WCAG 2.1 AA, full keyboard support, aria labels, strong contrast. Visual Style: professional ui with modern design, material design, bootstrap style, high-fidelity, pixel perfect, colored design, ui kit. Platform: app screen and website design.",
                        "url": ""
                    }
                ],
                "diagrams": [
                    {
                        "name": "مخطط التسلسل",
                        "description": "Sequence Diagram: App loads map tiles, queries nearby restaurants by bounds, renders pins, and opens detail on pin tap.",
                        "url": "https://brd-qi0f.onrender.com/static/c646b1b1864044f1990a41a82eaddb02.svg"
                    }
                ]
            }
        ]
    },
    "conclusion": {
        "meta": {
            "id": "conclusion",
            "name": "Conclusion - الخاتمة"
        },
        "paragraphs": "يمثل مشروع SmartDine - منصة ذكية لطلب وتوصيل الطعام - نقلة نوعية في مجال طلب وتوصيل الطعام من خلال دمج الراحة والتخصيص والتقنيات الحديثة في نظام واحد متكامل، حيث يوفر للمستخدمين تجربة سلسة تشمل تسجيل آمن، تحديد الموقع الجغرافي، استعراض المطاعم والمنتجات مع ترشيحات مخصصة، إدارة السلة والدفع، وتتبع حالة الطلب لحظة بلحظة، كما يدعم النظام التصفح عبر الويب والجوال بواجهات مبنية على أحدث مبادئ التصميم (UI/UX)، ويقدم تنبيهات فورية وتوصيات قائمة على البيانات لزيادة رضا العملاء وولائهم، مما يضع الأساس لبناء منظومة جيل جديد لطلب الطعام ترفع من مستوى الخدمات للمستخدمين والمطاعم على حد سواء. أما مشروع MarketPulse - نظام ذكي لقياس أداء الشركات وتحليل السوق - فيمثل إطاراً شاملاً لاتخاذ القرار المبني على بيانات حقيقية من السوق ووسائل التواصل الاجتماعي، مما يعزز تنافسية الشركات ويدعم نموها المستدام، حيث يدمج بين تحليل أداء الشركة على وسائل التواصل الاجتماعي، مقارنة المنافسين، قياس قوة العلامة التجارية، وتحليل الانطباعات العامة باستخدام تقنيات الذكاء الاصطناعي ومعالجة اللغة الطبيعية، كما يوفر لوحات تحكم تفاعلية تعرض مؤشرات مثل معدل التفاعل، قوة العلامة التجارية، مؤشر الاستعداد للمناقصات، ونموذج احتمالية قبول الشركة في الفرص الجديدة، وهذه القدرات تمنح الإدارة العليا وفِرق التسويق وتطوير الأعمال أداة استراتيجية لرصد الأداء، استشراف المستقبل، واتخاذ قرارات مدعومة بالبيانات لتحقيق نجاح أكبر في السوق." 
    }

}