{
  "glossary": {
    "meta": {
      "id": "glossary",
      "name": "Glossary - جدول المصطلحات"
    },
    "terms": [
      {
        "id": "gl_01",
        "term": "إدارة التذاكر - Ticket Management",
        "definition": "نظام لتنظيم وتتبع التذاكر الخاصة بطلبات العملاء ومشاكلهم."
      },
      {
        "id": "gl_02",
        "term": "نظام الرد الصوتي التفاعلي IVR - IVR System",
        "definition": "نظام للتفاعل الصوتي مع العملاء عبر الهاتف لتوجيه المكالمات وإنشاء التذاكر."
      },
      {
        "id": "gl_03",
        "term": "تكامل النظام - System Integration",
        "definition": "ربط الأنظمة المختلفة لتحقيق التشغيل الأوتوماتيكي وتحسين الكفاءة."
      },
      {
        "id": "gl_04",
        "term": "المزامنة الثنائية الاتجاه - Bi-directional Synchronization",
        "definition": "نقل البيانات في كلا الاتجاهين بين الأنظمة لضمان تحديثها بشكل متزامن."
      },
      {
        "id": "gl_05",
        "term": "إدارة المستخدم - User Management",
        "definition": "إجراءات لإضافة المستخدمين وتعيين الصلاحيات لهم وفقًا لأدوارهم."
      },
      {
        "id": "gl_06",
        "term": "الاستيفاء - Escalation",
        "definition": "عملية رفع مستوى التذاكر أو الطلبات إلى إدارة أعلى عند الضرورة."
      },
      {
        "id": "gl_07",
        "term": "لوحات المعلومات - Dashboards",
        "definition": "أدوات لعرض الأداء والمؤشرات الحيوية للإدارة."
      },
      {
        "id": "gl_08",
        "term": "التدريب - Training",
        "definition": "توفير البرامج التعليمية للموظفين لاستخدام النظام بكفاءة."
      },
      {
        "id": "gl_09",
        "term": "اتصال متعدد القنوات - Multi-channel Communication",
        "definition": "دعم التفاعل مع العملاء عبر عدة وسائط مثل الهاتف والبريد الإلكتروني والدردشة."
      },
      {
        "id": "gl_10",
        "term": "إدارة الاتصال - Communication Management",
        "definition": "الإشراف على جميع أشكال التواصل مع العملاء لضمان الجودة والفعالية."
      }
    ]
  },
  "introduction": {
    "meta": {
      "id": "introduction",
      "name": "Introduction - المقدمة"
    },
    "paragraphs": [
      "يتمحور هذا المشروع حول تطوير نظام مركز اتصال متكامل يتصل بنظام إدارة التذاكر لشركة الجزيرة كابيتال. الهدف الرئيسي هو تلبية احتياجات العملاء بسرعة وكفاءة عن طريق دمج عمليات خدمة العملاء مع إدارة التذاكر، مما يخلق تجربة سلسة عبر القنوات الإلكترونية والهاتفية.",
      "يعتمد المشروع على الخبرات الواسعة لمزود الحلول الرقمية المعنية، ويستند إلى أفضل الممارسات في السوق وتحليل البيانات التاريخية لخدمة العملاء. يحدد هذا المشروع نطاق العمل، تدفقات الخدمة وآليات التصعيد الأساسية لتحسين مؤشرات الأداء وضمان تحقيق الأهداف الاستراتيجية للمؤسسة.",
      "الرؤية لهذا المشروع هي تحسين تجربة العملاء بشكل جذري من خلال توفير أدوات مبتكرة تعزز العمليات التشغيلية وتعطي الأولوية للاحتياجات الفردية لكل عميل.",
      "تعد السرعة والكفاءة في معالجة طلبات الخدمة من الأهداف الأساسية لهذا المشروع، مع التركيز على تقديم دعم متكامل عبر جميع قنوات الخدمة.",
      "سيوفر النظام لوحات معلومات أداء للإدارة لمراقبة جودة الخدمة وتحسين العمليات بشكل مستمر لضمان تطابق المخرجات مع الأهداف الاستراتيجية.",
      "سيتضمن النظام آليات لضمان الامتثال والحوكمة من خلال توثيق شامل لجميع التذاكر والإجراءات ذات الصلة مما يعزز من الالتزام بمعايير الجودة والشفافية.",
      "يتميز نظام إدارة التذاكر بتخصيص تدفقات العمل وتحديد قواعد التوجيه والتصعيد لتحقيق الكفاءة في حل المشاكل وخدمة العملاء بشكل مبتكر.",
      "سيتم تصميم واجهات المستخدم لتتسم بالمرونة، وتدعم الإشعارات التلقائية عبر البريد الإلكتروني أو الرسائل القصيرة، مما يعزز من خدمة العملاء الاستباقية.",
      "ستتولى إدارة المهام المستخدمين بما في ذلك التعيين وإلغاء التعيين والتعديل، مما يتيح بيئة عمل أكثر تنظيماً وكفاءة.",
      "سيتيح النظام للأعضاء المعنيين عرض تفاصيل التذاكر بشكل شامل مع إمكانيات بحث متقدمة لضمان معالجة فعالة وموجهة لكل حالة.",
      "من خلال التكامل مع نظام IVR، سيتمكن النظام من التعرف على هوية المتصل وإنشاء تذاكر جديدة مرفقة ببيانات العملاء المسجلة مسبقًا.",
      "سيقوم النظام بتسجيل تفاصيل المكالمة في نظام التذاكر مع تحديد نوع المكالمة والقسم والأولوية، مما يساهم في تخصيص الخدمة بشكل أكثر دقة.",
      "سيوفر التكامل مع قاعدة بيانات العملاء مزامنة فعال وذو اتجاهين لبيانات العملاء بين القاعدة ونظام التذاكر.",
      "سيكون هناك إمكانية عرض سجل العميل بالكامل من بدء التذكرة حتى إغلاقها، مما يسهل متابعة العملية كاملة وتحسين رضا العملاء.",
      "سوف تتضمن إدارة المستخدمين إضافة مستخدمين جدد وتخصيص الأذونات بدقة حسب الأدوار، مما يعزز بيئة عمل آمنة ومنظمة.",
      "سيتم ربط المستخدمين بالأقسام المناسبة لضمان سلاسة تدفق العمل وتحقيق أقصى استفادة من القدرات البشرية المتاحة.",
      "يتسم تخزين تفاصيل حساب المستخدم والأذونات بالأمان لضمان مراجعة الحوكمة والامتثال بشكل دوري.",
      "تشمل إدارة الاتصالات دعم الاتصال متعدد القنوات، بما في ذلك المكالمات، وواتساب، والدردشات الرقمية، والبريد الإلكتروني، مما يعزز من التفاعل المتكامل.",
      "سيتيح النظام التعامل مع مكالمات متزامنة ودعم الاتصالات ثنائية الاتجاه، مما يسهم في خدمة العملاء بشكل فعال ودقيق.",
      "سيتمكن المديرون والمسؤولون من عرض تقارير الأداء وفقاً للأذونات الممنوحة، مع إمكانية إعداد وتصدير تقارير تركز على توزيع أنواع القضايا ومعدلات إغلاق التذاكر وأداء الموظفين."
    ]
  },
  "importance": {
    "meta": {
      "id": "importance",
      "name": "Importance - أهمية المشروع"
    },
    "points": [
      "يضمن تحسين الكفاءة التشغيلية من خلال تكامل مركز الاتصال مع نظام إدارة التذاكر.",
      "يساعد في تقليص زمن الاستجابة ومعالجة طلبات الخدمة بسرعة أكبر.",
      "يوفر لوحة تحكم للأداء تُمكن الإدارة من متابعة جودة الخدمة وتحسين العمليات بشكل مستمر.",
      "يساهم في تحقيق الامتثال والحوكمة من خلال توثيق جميع التذاكر والإجراءات المرتبطة بها بدقة.",
      "يسمح بمزامنة ثنائية الاتجاه لبيانات العملاء مما يضمن الوصول الفوري إلى كافة معلومات العملاء.",
      "يعزز من تجربة العملاء بتحسين آليات التواصل وتعدد قنوات الاتصال المتاحة.",
      "يمكن من تقليص الأخطاء البشرية عبر أتمتة الإشعارات وعمليات تخصيص التذاكر.",
      "يوفر تقارير مخصصة تمكن من تحليل نسبة إرضاء العملاء وحجم المكالمات وأداء الموظفين.",
      "يساعد على تحسين الإجراءات الداخلية من خلال إدارة دقيقة لمهام المستخدمين وارتباطهم بالأقسام المناسبة.",
      "يعزز التفاعل مع العملاء بفضل التكامل مع منصات مثل WhatsApp والمحادثات الرقمية والبريد الإلكتروني."
    ]
  },
  "goals": {
    "meta": {
      "id": "goals",
      "name": "Goals - أهداف المشروع"
    },
    "points": [
      "إنشاء مركز اتصال متكامل يربط بين إدارة خدمة العملاء وإدارة التذاكر عبر جميع القنوات خلال 6 أشهر.",
      "تسريع أوقات الاستجابة وتقليل متوسط وقت معالجة الطلبات إلى أقل من 3 دقائق.",
      "تقديم لوحة معلومات أداء للإدارة خلال الربع الأول لتحسين جودة الخدمة.",
      "توفير نظام وثائق شامل لكل التذاكر والإجراءات المتبعة لتحقيق الامتثال بنسبة 100٪.",
      "دمج منصة IVR بنظام التذاكر لتمكين خدمة العملاء بشكل تلقائي خلال أول شهرين.",
      "تحقيق نسبة دقة 95٪ في التعرف على هوية المتصل وإنشاء التذاكر الجديدة.",
      "تمكين تحديث ثنائي الاتجاه لبيانات العملاء بين قاعدة البيانات ونظام التذاكر.",
      "إضافة 100 مستخدم جديد للنظام وتوزيعهم على الأقسام المناسبة خلال 3 أشهر.",
      "دعم قنوات الاتصال المتعددة بما في ذلك المكالمات والدردشة خلال أول 4 أشهر.",
      "إعداد تقارير شهرية عن توزيع أنواع المشاكل ونسب إغلاق التذاكر وكفاءة الأداء الوظيفي للموظفين."
    ]
  },
  "scope": {
    "meta": {
      "id": "scope",
      "name": "Scope - نطاق المشروع"
    },
    "included": [
      "ربط مركز الاتصال بنظام إدارة التذاكر عبر كافة قنوات الخدمة.",
      "تسريع أوقات الاستجابة وتحسين معالجة طلبات الخدمة.",
      "تزويد لوحة قياس الأداء للمديرين لمراقبة جودة الخدمة وتحسين العمليات.",
      "دمج المعلومات الثنائية للمستخدمين بين النظام القاعدي ونظام التذاكر.",
      "إدارة مهام المستخدمين بما في ذلك التعيين والإلغاء والتعديل.",
      "إدماج النظام الصوتي الآلي (IVR) مع نظام التذاكر لخدمة العملاء الفعالة.",
      "التعرف على هوية المتصل لفتح تذاكر جديدة تحتوي على بيانات العميل.",
      "التخزين الآمن لحسابات المستخدمين وتفاصيل الأذونات لمراجعة الامتثال والحكم.",
      "دعم الاتصال عبر قنوات متعددة مثل المكالمات والدردشة الرقمية والبريد الإلكتروني.",
      "تحضير وتصدير التقارير التي تركز على توزيع نوع المشاكل ومعدلات إغلاق التذاكر وأداء الموظفين."
    ],
    "diagrams": [
      {
        "description": "Context Diagram showing System integrating Contact Center, Ticket Management, Customer Database, and IVR."
      }
    ]
  },
  "out_of_scope": {
    "meta": {
      "id": "out_of_scope",
      "name": "Out of Scope - خارج نطاق المشروع"
    },
    "excluded": [
      "إدارة البنية التحتية أو تطوير الوحدات الخارجية.",
      "تقديم خدمة الدعم الفني المباشر عبر الهاتف.",
      "إغلاق التذاكر بواسطة غير الوكلاء المخصصين."
    ]
  },
  "assumptions_constraints": {
    "meta": {
      "id": "assumptions_constraints",
      "name": "Assumptions & Constraints - الافتراضات والقيود"
    },
    "assumptions": [
      "الموظفين سيتم تدريبهم بالشكل الكافي لاستخدام الأنظمة المطورة حديثاً.",
      "النظام سيعمل حصرياً مع البنية التحتية للشبكة الحالية المقدمة من قبل أقسام الجزيره كابيتال.",
      "سيتم تنفيذ النظام بما يتماشى مع أفضل الممارسات في السوق.",
      "سيتم توفير واجهة مستخدم مخصصة لجميع الأنواع المحددة من المستخدمين.",
      "سيمكن من إدارة مهام المستخدمين وإجراء التعديلات بشكل فعال.",
      "ستكون البيانات متاحة لعرض سجل العميل الكامل من الإنشاء إلى الإغلاق.",
      "سيكون هناك تزامن باتجاهين بين بيانات العملاء في قاعدة البيانات ونظام التذاكر.",
      "ستكون هناك إمكانيات للإبلاغ عن رضا العملاء وحجم المكالمات وأداء الموظفين.",
      "سيمكن للمديرين والمشرفين عرض تقارير الأداء بناءً على أذوناتهم.",
      "سيكون النظام قادراً على التعامل مع التواصل ثنائي الاتجاه."
    ],
    "constraints": [
      "المشروع يغطي فقط تطوير وتشغيل مركز الاتصال وأنظمة التذاكر والارتباط بينها.",
      "النظام متصل فقط بالبنية التحتية القائمة دون تضمين العناصر الخارجية.",
      "فقط وكلاء الاتصال المعينين يمكنهم إغلاق التذاكر لضمان الاتساق والمساءلة.",
      "يجب أن يتم الامتثال لجميع القوانين واللوائح المتعلقة بالحوكمة والامتثال.",
      "يجب أن تظل بيانات العميل خاصة وآمنة مع التقيد بلوائح الخصوصية المنطبقة.",
      "سيكون هناك عدة امتيازات وفوائد متاحة فقط للمستخدمين المعينين.",
      "جميع الإشعارات الإلكترونية تعتمد على البنية التحتية للاتصالات الحالية.",
      "النظام يجب أن يضمن التزام الموظفين بالوقت والمواعيد النهائية المحددة للعملاء.",
      "سيتم تحديد مسارات العمل مع قواعد التوجيه والتصعيد مسبقًا لضمان الفعالية.",
      "النظام يغطي فقط عمليات التواصل المتعددة القنوات مثل المكالمات وواتساب والبريد الإلكتروني."
    ]
  },
  "current_state": {
    "meta": {
      "id": "current_state",
      "name": "Current State - الوضع الحالي"
    },
    "points": [
      "عدم التكامل بين مراكز الاتصال ونظام إدارة التذاكر.",
      "معالجة الطلبات تستغرق وقتاً طويلاً بسبب العمليات اليدوية.",
      "غياب نظام الإفصاح عن الأداء الفوري للإدارة.",
      "عدم توفر خاصية المزامنة المباشرة لبيانات العملاء بين الأنظمة المختلفة.",
      "التقارير الإدارية تُعَدُ بشكل يدوي وتتطلب جهداً كبيراً.",
      "عدم وجود قواعد تصعيد فعّالة للمشكلات العالقة.",
      "بيانات العملاء غير محدثة بشكل مستمر بين قنوات الخدمة المختلفة.",
      "انعدام نظام لربط تعريف المتصل ببيانات العميل بشكل تلقائي.",
      "إدارة الصلاحيات والمهام تتم بشكل غير منهجي.",
      "التواصل عبر القنوات المختلفة يتم بشكل منفصل وغير موحد."
    ]
  },
  "actors": {
    "meta": {
      "id": "actors",
      "name": "Actors - الأطراف المشاركة"
    },
    "rows": [
      {
        "id": "ac_01",
        "role": "وكيل الاتصال",
        "description": "يتعامل مع استفسارات العملاء وينشئ التذاكر."
      },
      {
        "id": "ac_02",
        "role": "المشرف",
        "description": "يراقب وكلاء الاتصال ويشرف على معالجة التذاكر."
      },
      {
        "id": "ac_03",
        "role": "مسؤول النظام",
        "description": "يدير الوصول للمستخدمين وتكوينات النظام."
      },
      {
        "id": "ac_04",
        "role": "مدير",
        "description": "يراجع تقارير التشغيل ولوحات قياس الأداء."
      },
      {
        "id": "ac_05",
        "role": "نظام الـ IVR",
        "description": "يتكامل مع النظام للتعامل بكفاءة مع خدمة العملاء."
      }
    ],
    "diagrams": [
      {
        "name": "مخطط حالة استخدام لإنشاء وإدارة التذاكر",
        "description": "Use Case Diagram showing Actor 'Contact Agent' creating and managing tickets. Actor 'Supervisor' oversees ticket escalation and resolution.",
        "url": "https://brd-qi0f.onrender.com/static/37b4c01fd70a40c4bc0074cf04a8d76c.svg"
      },
      {
        "name": "مخطط حالة استخدام لتكامل نظام IVR",
        "description": "Use Case Diagram showing Actor 'IVR System' initiating 'Create Ticket with Caller ID' and logging call details into the ticketing system with type, department, and priority.",
        "url": ""
      },
      {
        "name": "مخطط حالة استخدام لتزامن قاعدة بيانات العملاء",
        "description": "Use Case Diagram showing bi-directional synchronization of customer data to ensure full customer record tracking. Actor 'System Administrator' manages the synchronization process.",
        "url": "https://brd-qi0f.onrender.com/static/ff68a00e375c4db79a2f5d7ca60dc20a.svg"
      },
      {
        "name": "مخطط حالة استخدام لإدارة المستخدمين",
        "description": "Use Case Diagram showing Actor 'System Administrator' adding new users, assigning permissions, and managing departmental links for effective workflow.",
        "url": "https://brd-qi0f.onrender.com/static/1ce2743a943a46b3ba0b19d3915ba7ad.svg"
      },
      {
        "name": "مخطط حالة استخدام لإعداد تقارير الأداء",
        "description": "Use Case Diagram showing Actor 'Manager' viewing and exporting performance reports with focus on issue type distributions, ticket closure rates, and employee performance monitoring.",
        "url": "https://brd-qi0f.onrender.com/static/e77e8653c79943629e3612f0a5788835.svg"
      }
    ]
  },
  "dependency_and_integration": {
    "meta": {
      "id": "dependency_and_integration",
      "name": "Dependencies & Integrations - التبعيات والتكامل"
    },
    "description": "النظام يعتمد على قاعدة بيانات خارجية للعملاء، ويتطلب تكاملاً مع نظام ال-IVR، وخدمة الرسائل القصيرة، ونظام إدارة المستخدمين، وخدمة التقارير الخارجية.",
    "diagrams": [
      {
        "name": "مخطط المكونات للتكامل",
        "description": "Component Diagram showing the Contact Center System with components including the Ticket Management System, IVR System, SMS Notification Service, and User Management System. The Ticket Management System integrates with the IVR System to create tickets automatically and send SMS notifications.",
        "url": "https://brd-qi0f.onrender.com/static/208aa5ac5be94084ae004a49ca05bdff.svg"
      },
      {
        "name": "مخطط النشر للخدمات",
        "description": "Deployment Diagram showing nodes: Contact Agent Workstation, IVR Server, Ticket Management Server, and Customer Database Server. IVR Server communicates with Ticket Management Server to log call details and initiates ticket creation process. All communication occurs over secured network protocols.",
        "url": "https://brd-qi0f.onrender.com/static/ddfbb7115c4d4fd9a3f9adf700a96f0d.svg"
      }
    ]
  },
  "architecture": {
    "meta": {
      "id": "architecture",
      "name": "Architecture - هيكلية النظام"
    },
    "diagrams": [
      {
        "name": "تدفق إدارة التذاكر",
        "description": "Flow Chart for Ticket Management System: Start → Ticket Creation → Assign to Department → Apply Routing Rules → Escalation Check → Notify Assigned Agent via Email/SMS → Agent works on Ticket → Ticket Closure or Reassignment based on Resolution",
        "url": "https://brd-qi0f.onrender.com/static/17a754ad95ae45b49a40337d3edbcb7f.svg"
      },
      {
        "name": "تكامل IVR ونظام التذاكر",
        "description": "System Architecture Diagram illustrating integration between IVR Platform and Ticket System: IVR captures Caller ID → Create New Ticket with Customer Data → Log Call Details specifying Type, Department, Priority → Data Flow from IVR to Ticket System",
        "url": "https://brd-qi0f.onrender.com/static/4c44a3579c224776bcc202a15573e718.svg"
      },
      {
        "name": "تزامن قاعدة بيانات العملاء",
        "description": "Architecture Diagram for Bi-directional Synchronization: Customer Database ↔ Ticket System Synchronization → Initiate Ticket → Update Customer Data in Database → Close Ticket → Synchronize Changes back to Database",
        "url": "https://brd-qi0f.onrender.com/static/24f35e42498d4c3ba56c24e7dcc4929a.svg"
      },
      {
        "name": "إدارة المستخدمين",
        "description": "Flow Chart showing User Management Process: Start → Add New User → Assign Roles and Define Permissions → Link User to Department → Store Account Details → Periodic Review for Governance and Compliance",
        "url": "https://brd-qi0f.onrender.com/static/2cd002ee5c1d4032a0604a6e5ec014de.svg"
      },
      {
        "name": "إدارة قنوات الاتصال",
        "description": "System Architecture Diagram displaying Communication Channel Management: Calls, WhatsApp, Digital Chats, Email → System Components for Concurrent Handling and Bidirectional Communication → Central Management Module",
        "url": "https://brd-qi0f.onrender.com/static/d40cbed4cd8f4e20851c50198385d0ef.svg"
      },
      {
        "name": "لوحة الأداء والتقارير",
        "description": "Architecture Diagram representing Reporting and Dashboard System: Data Flow from Ticket System to Reporting Engine → Generate Performance Reports → Managers and Admins Access Reports Based on Permissions → Export Functionality",
        "url": "https://brd-qi0f.onrender.com/static/dd9772d0ebfd47af86605eb46ab92e62.svg"
      },
      {
        "name": "تدفق التصعيد",
        "description": "Flow Chart detailing Ticket Escalation Process: Ticket Creation → Initial Agent Assignment → Escalation Decision Point → Notify Supervisor/Manager if Escalated → Reassign or Provide Guidance to Agent → Close Ticket upon Resolution",
        "url": ""
      },
      {
        "name": "التعامل مع المكالمات المتعددة",
        "description": "Flow Chart for Multi-Call Handling: Start → Incoming Call Queue → Concurrent Handling Decision → Assign to Available Agent → Create Ticket → Log Call and Ticket Details → Notify Customer Upon Completion",
        "url": "https://brd-qi0f.onrender.com/static/0b2cde715cac433c862f6ca97ba06a0e.svg"
      },
      {
        "name": "نظام إدارة المهام للمستخدم",
        "description": "Flow Chart for User Task Management: Start → Task Assignment → Task Notification via Email/SMS → User Accepts Task → Task Execution → Task Completion or Escalation Decision → Task Closure",
        "url": "https://brd-qi0f.onrender.com/static/e83f8caf839248259624351e575a5c94.svg"
      },
      {
        "name": "إعداد التقارير المخصصة",
        "description": "Architecture Diagram for Custom Report Generation: Data Extraction from Ticket System → Reporting Engine Processing → User Defines Report Parameters → System Generates Report → User Views or Exports Report",
        "url": "https://brd-qi0f.onrender.com/static/33ba23ce6e8249c7a654053db0ec9aef.svg"
      }
    ]
  },
  "functional_requirements": {
    "meta": {
      "id": "functional_requirements",
      "name": "Functional Requirements - المتطلبات الوظيفية"
    },
    "items": [
      {
        "id": "fr_01",
        "title": "إدارة التذاكر",
        "description": "يجب على النظام أن يدعم إدارة التذاكر من خلال تصميم تدفقات العمل، وتحديد قواعد التوجيه والتصعيد. يساعد هذا في ضمان معالجة جميع الطلبات بكفاءة ويتماشى مع أهداف الأداء الخاصة بالمؤسسة.",
        "priority": "عالي",
        "acceptance_criteria": [
          "يمكن لمدير النظام إنشاء وتعديل قواعد التوجيه للتذاكر.",
          "يجب إرسال إشعارات آلية عند تلبية شروط تصعيد محددة.",
          "يجب أن يوفر النظام واجهة مستخدم تساعد على تعديل البيانات بسهولة.",
          "يجب تسجيل جميع عمليات إدارة التذاكر لأغراض المراجعة.",
          "يتم توفير خيارات للبحث في تفاصيل التذكرة بشكل كامل."
        ],
        "diagrams": [
          {
            "name": "مخطط النشاط لإدارة التذاكر",
            "description": "Activity Diagram showing workflow: Ticket Created → rules assessed → ticket assigned to Agent → status updates logged → notification sent to Supervisor if escalated.",
            "url": "https://brd-qi0f.onrender.com/static/85cbe63241f541a68b35db17767c58a3.svg"
          }
        ]
      },
      {
        "id": "fr_02",
        "title": "تكامل نظام الرد الصوتي IVR مع نظام التذاكر",
        "description": "يجب أن يتمكن النظام من التكامل بين منصة IVR ونظام التذاكر للوصول السريع إلى بيانات العميل وإنشاء تذاكر جديدة تلقائيًا بناءً على المكالمة.",
        "priority": "عالي",
        "acceptance_criteria": [
          "يجب التعرف على معرف المتصل إذا كان مسجلاً في قاعدة بيانات العملاء.",
          "يمكن لنظام IVR إنشاء تذكرة جديدة تلقائيًا باستخدام بيانات التعرف الخاصة بالعميل.",
          "يجب تسجيل تفاصيل المكالمة في نظام التذاكر مع تحديد النوع والقسم والأولوية.",
          "يتم تعيين الأولوية للعملاء بناءً على حالتهم في قاعدة بيانات الجزيرة كابيتال.",
          "يجب أن يكون هناك اتصال ثنائي الاتجاه بين منصة IVR ونظام التذاكر للمعلومات المحدثة."
        ],
        "diagrams": [
          {
            "name": "مخطط التسلسل لتكامل نظام IVR",
            "description": "Sequence Diagram illustrating IVR checks Caller ID → if recognized, queries Customer Database → creates Ticket → logs call details into Ticketing System → updates sent back to IVR.",
            "url": "https://brd-qi0f.onrender.com/static/b90ef36a371e4e198b4ae7a1de0084de.svg"
          }
        ]
      },
      {
        "id": "fr_03",
        "title": "تزامن قاعدة بيانات العملاء",
        "description": "يجب على النظام أن يدعم تزامن البيانات ثنائياً بين قاعدة بيانات العملاء ونظام التذاكر لضمان أن البيانات دقيقة ومحدثة.",
        "priority": "عالي",
        "acceptance_criteria": [
          "يجب أن يشمل التزامن جميع البيانات الشخصية والسجلات التاريخية للعملاء.",
          "يجب أن تعرض التذاكر جميع مراحل المعالجة من البداية إلى النهاية.",
          "يجب توفير إمكانية إنشاء تقارير مخصصة تعرض رضى العملاء وحجم المكالمات وأداء الموظفين.",
          "يجب أن تحدث عمليات المزامنة تلقائيًا عند تغيير البيانات في أي من النظامين.",
          "يجب تسجيل جميع حالات التزامن لأغراض تتبع الأخطاء."
        ],
        "diagrams": [
          {
            "name": "مخطط النشاط لتزامن قاعدة البيانات",
            "description": "Activity Diagram showing Customer Data Change occurs → System initiates Sync Process → updates reflected in Ticket System and Database → changes logged → confirmation sent to initiating system.",
            "url": "https://brd-qi0f.onrender.com/static/7b442e5a62d4458ebac168aa49a466eb.svg"
          }
        ]
      },
      {
        "id": "fr_04",
        "title": "إدارة المستخدمين",
        "description": "النظام يجب أن يدعم إضافة مستخدمين جدد وتحديد أذوناتهم بدقة تبعًا لأدوارهم، وربط المستخدمين بالأقسام المناسبة لضمان تدفق العمل بشكل سلس.",
        "priority": "عالي",
        "acceptance_criteria": [
          "يمكن لمدير النظام إضافة مستخدمين جدد بسهولة.",
          "يجب أن تتيح واجهة المستخدم تحديد الأذونات بدقة.",
          "يجب أن يتم تخزين بيانات الحساب للمستخدمين بأمان.",
          "يمكن ربط المستخدمين بالوحدات التنظيمية المناسبة.",
          "يجب على النظام أن يحتفظ بسجل لجميع التغييرات التي تطرأ على أذونات الدخول."
        ],
        "diagrams": [
          {
            "name": "مخطط دراسي لإدارة المستخدمين",
            "description": "Class Diagram illustrating User class attributes (UserID, Roles, Permissions, Department) with methods (AddUser, AssignPermissions, LinkDepartment).",
            "url": "https://brd-qi0f.onrender.com/static/5a43b75bcab4495a94f4ac8a8d43932c.svg"
          }
        ]
      },
      {
        "id": "fr_05",
        "title": "إدارة الاتصال",
        "description": "يجب على النظام دعم الاتصال متعدد القنوات، وتضمين وظائف مثل التعامل مع المكالمات المتزامنة والتواصل الثنائي الاتجاه عبر مختلف وسائل الاتصال.",
        "priority": "متوسط",
        "acceptance_criteria": [
          "يجب أن يدعم النظام الاتصالات عبر المكالمات، وWhatsApp، والدردشات الرقمية، والايميل.",
          "يجب أن يكون النظام قادرًا على التعامل مع مكالمات متزامنة بشكل فعال.",
          "يجب أن يوفر النظام أدوات للدمج بين القنوات المختلفة لخلق تجربة متسقة للمستخدم.",
          "يجب تسجيل جميع الاتصالات لأغراض التحليل والمراجعة.",
          "يجب أن يدعم النظام تضمين الرسائل الآلية للرد الفوري."
        ],
        "diagrams": [
          {
            "name": "مخطط النشاط لإدارة الاتصال",
            "description": "Activity Diagram showing Incoming Multi-Channel Request → System Opens Preferred Channel → routes to relevant Agent or Automated Response → logs interaction → feedback option provided to user.",
            "url": "https://brd-qi0f.onrender.com/static/f6775b1cba6541909b80fda96dff6ad9.svg"
          }
        ]
      }
    ]
  },
  "nonfunctional_requirements": {
    "meta": {
      "id": "nonfunctional_requirements",
      "name": "Non-Functional Requirements - المتطلبات غير الوظيفية"
    },
    "requirements": [
      {
        "id": "nfr_01",
        "type": "الأداء",
        "description": "النظام يجب أن يدعم معالجة الطلبات في الوقت الفعلي بدون تأخير."
      },
      {
        "id": "nfr_02",
        "type": "الأمان",
        "description": "يجب على النظام استخدام الجدران النارية لمنع الوصول غير المصرح به."
      },
      {
        "id": "nfr_03",
        "type": "قابلية الاستخدام",
        "description": "يجب أن تكون واجهة المستخدم سهلة الاستخدام وتوفر تجربة سلسة للمستخدم."
      }
    ]
  },
  "use_cases": {
    "meta": {
      "id": "use_cases",
      "name": "Use Cases - حالات الاستخدام"
    },
    "items": [
      {
        "id": "uc_01",
        "name": "إدارة المهام للمستخدم",
        "description": "يسمح النظام لمسؤولي النظام بتنظيم مهام المستخدمين بما في ذلك التخصيص وإلغاء التخصيص والتعديل. تهدف هذه العملية لضمان تقسيم العمل بفعالية ومتابعة الحالة الحالية للمهام ضمن النظام.",
        "actors": [
          "مسؤول النظام"
        ],
        "preconditions": [
          "النظام نشط",
          "المستخدمون قد تم تعريفهم في النظام"
        ],
        "steps": [
          "مسؤول النظام يفتح قسم إدارة المهام.",
          "النظام يعرض قائمة المهام الحالية.",
          "المسؤول يختار المستخدم ويدخل تفاصيل المهمة.",
          "النظام يتحقق من الصلاحيات ويفعل الإجراء المطلوب.",
          "النظام يرسل إشعاراً إلى المستخدم بخصوص المهمة.",
          "المسؤول يؤكد الحفظ وتحديث قاعدة البيانات."
        ],
        "business_rules": [
          {
            "id": "br_01",
            "rule": "يجب أن يكون للمسؤول صلاحيات كاملة على إدارة المهام."
          },
          {
            "id": "br_02",
            "rule": "المهام الجديدة لا يمكن أن تتخطى السعة المحددة لكل مستخدم."
          },
          {
            "id": "br_03",
            "rule": "يجب حفظ كل تغيير مع تأكيد من المسؤول."
          },
          {
            "id": "br_04",
            "rule": "لن يتم حفظ التغييرات إلا بعد التحقق من الصلاحيات."
          }
        ],
        "ui": [
          {
            "name": "شاشة إدارة المهام",
            "description": "UI design for Task Management Page: professional ui, including task lists, user selection dropdown, assign and revoke buttons, and notifications panel. Must be responsive and styled with a modern material design.",
            "url": "https://brd-qi0f.onrender.com/static/2fc86179bc7f4f44ae1233bf86d89a7a.png"
          }
        ],
        "diagrams": [
          {
            "name": "مخطط نشاط إدارة المهام",
            "description": "Activity Diagram showing workflow: Admin opens task management → selects task → assigns or revokes → system verifies permissions → updates task status and sends notifications.",
            "url": "https://brd-qi0f.onrender.com/static/077cc0b4329140b192d9149d87e2d227.svg"
          }
        ]
      },
      {
        "id": "uc_02",
        "name": "فتح تذكرة جديدة",
        "description": "يجري النظام عملية فتح تذكرة جديدة عند تلقي اتصال جديد أو عبر القنوات الرقمية، وذلك لضمان تسجيل بيانات العميل وتفاصيل الاتصال بشكل كامل ودقيق، مما يتيح للموظفين المقدرة على مراجعة الحالة ومعالجتها بكفاءة.",
        "actors": [
          "وكيل الاتصال"
        ],
        "preconditions": [
          "نظام الاتصال التفاعلي يعمل",
          "قناة التواصل فعالة"
        ],
        "steps": [
          "الوكيل يتلقى اتصالاً جديداً من العميل.",
          "النظام يعرض معلومات المتصل بناءً على الرقم التعريفي.",
          "الوكيل يدخل تفاصيل الاتصال ويختار القسم الصحيح.",
          "النظام ينشئ تذكرة جديدة ويعرضها للوكيل.",
          "الوكيل يؤكد الحفظ في قاعدة البيانات.",
          "النظام يرسل إشعاراً بالتذكرة المفتوحة للعميل."
        ],
        "business_rules": [
          {
            "id": "br_05",
            "rule": "يجب تسجيل كافة الاتصالات مع تفاصيل كاملة وموثقة."
          },
          {
            "id": "br_06",
            "rule": "يجب التحقق من هويات العملاء قبل فتح التذكرة."
          },
          {
            "id": "br_07",
            "rule": "التذاكر المفتوحة يجب أن تحتوي على معلومات أساسية مثل الوقت، القسم، والأولوية."
          }
        ],
        "ui": [
          {
            "name": "شاشة فتح التذكرة",
            "description": "UI design for New Ticket Page: professional ui, includes caller info display, input fields for ticket details, department selection, and save confirmation. Styled with responsive design and material design elements.",
            "url": "https://brd-qi0f.onrender.com/static/a42db69b8830480e8bbeea60fd0af102.png"
          }
        ],
        "diagrams": [
          {
            "name": "مخطط تسلسل فتح التذكرة",
            "description": "Sequence Diagram showing the interaction between User receiving call, system displaying caller info, ticket creation, confirmation, and notification sent to customer.",
            "url": "https://brd-qi0f.onrender.com/static/2394a0e825fb43859432529585ae3136.svg"
          }
        ]
      },
      {
        "id": "uc_03",
        "name": "تحديث البيانات البيانية للعميل",
        "description": "يسمح النظام بتحديث بيانات العملاء بشكل ثنائي الاتجاه بين قاعدة البيانات ونظام التذاكر، مما يضمن أن جميع التعديلات مرئية ويتم مزامنتها بشكل فوري لإمكانية الاستعراض الكامل لسجلات العملاء من بدء الحادثة وحتى إغلاق التذكرة.",
        "actors": [
          "وكيل الاتصال",
          "موظف الدعم الفني"
        ],
        "preconditions": [
          "النظام نشط",
          "بيانات العميل موجودة في النظام"
        ],
        "steps": [
          "الموظف يدخل تفاصيل العميل الأولية.",
          "النظام يحقق من البيانات ويعرض السجل الحالي إن وجد.",
          "الموظف يجري تعديلات ويضغط على زر التحديث.",
          "النظام يتحقق من صحة التعديلات ويوسع حقل التأكيد.",
          "النظام يحدث البيانات البيانية في كلا النظامين.",
          "النظام يظهر رسالة نجاح بإتمام التحديث."
        ],
        "business_rules": [
          {
            "id": "br_08",
            "rule": "جميع التعديلات يجب أن تتوافق مع سياسات أمان البيانات."
          },
          {
            "id": "br_09",
            "rule": "يجب أن تتم المزامنة بشكل تلقائي وفوري لضمان توحيد المعلومات."
          },
          {
            "id": "br_10",
            "rule": "التحديثات يجب أن تكون مرئية لجميع الأطراف ذات الصلة فور حدوثها."
          }
        ],
        "ui": [
          {
            "name": "شاشة تحديث العميل",
            "description": "UI design for Client Update Page: includes fields for customer details, update button, and synchronization status. Design uses modern style, with emphasis on user-friendliness and clear interaction flow.",
            "url": "https://brd-qi0f.onrender.com/static/810b6664248a43a09145338ff3c727ab.png"
          }
        ],
        "diagrams": [
          {
            "name": "مخطط نشاط تحديث العميل",
            "description": "Activity Diagram showing process flow: Employee accesses client data → modifies data → system validates and syncs both databases → confirmation displayed.",
            "url": "https://brd-qi0f.onrender.com/static/a5e8306877cd4b4bbbf06cc181fefcfd.svg"
          }
        ]
      },
      {
        "id": "uc_04",
        "name": "إغلاق التذكرة",
        "description": "يقوم النظام بعملية إغلاق التذكرة بعد معالجة الطلب، حيث تتطلب هذه العملية من الوكيل التأكد من تنفيذ جميع الخطوات وأن الحل قد تم بنجاح. يتم توثيق جميع الخطوات والتواصل لضمان تقديم تقرير شامل ومفصل عن الحالة.",
        "actors": [
          "وكيل الاتصال"
        ],
        "preconditions": [
          "التذكرة مفتوحة",
          "الحل قد تم تطبيقه"
        ],
        "steps": [
          "الوكيل يفتح صفحة تفاصيل التذكرة المفتوحة.",
          "النظام يعرض الوضع الحالي للتذكرة وتفاصيل الاتصال.",
          "الوكيل يتحقق من اكتمال كل الإجراءات.",
          "الوكيل يحدد وضع الإغلاق ويكتب ملخص التقرير.",
          "النظام ينهي التذكرة ويرسل تقريراً إلى جميع المساهمين.",
          "النظام يسجل التذكرة في الأرشيف للتصنيف المستقبلي."
        ],
        "business_rules": [
          {
            "id": "br_11",
            "rule": "يجب أن يتم مراجعة جميع مراحل التذكرة قبل الإغلاق."
          },
          {
            "id": "br_12",
            "rule": "يجب تسجيل جميع المحاولات والاتصالات في سجل التذكرة."
          },
          {
            "id": "br_13",
            "rule": "التذاكر لا يمكن أن تغلق إلا بواسطة الوكلاء المفوضين باحترام."
          }
        ],
        "ui": [
          {
            "name": "شاشة إغلاق التذكرة",
            "description": "UI design for Ticket Closure Page: comprehensive design including ticket details review, closure options, summary input, and final confirmation. Modern design with structured layout for efficient workflow.",
            "url": "https://brd-qi0f.onrender.com/static/79785c7d0e1442ada3c7b41862a236de.png"
          }
        ],
        "diagrams": [
          {
            "name": "مخطط نشاط إغلاق التذكرة",
            "description": "Activity Diagram detailing the process of closing a ticket: review → update status → summarize report → system archives and confirms closure.",
            "url": "https://brd-qi0f.onrender.com/static/f7d15e99ffe64011896e1d58e4871c42.svg"
          }
        ]
      },
      {
        "id": "uc_05",
        "name": "تصميم التقارير ولوحات الأداء",
        "description": "يسمح النظام للمسؤولين بإعداد وتصميم تقارير الأداء والخدمات المتنوعة لمراقبة جودة الخدمات واتخاذ القرارات المستندة إلى البيانات. يتم دعم مجموعة متنوعة من الأشكال والرسوم البيانية لضمان قراءة بيانات فعالة.",
        "actors": [
          "مدير",
          "مشرف"
        ],
        "preconditions": [
          "النظام يعمل",
          "البيانات متاحة ومحدثة"
        ],
        "steps": [
          "المستخدم يفتح وحدة التقارير.",
          "النظام يعرض خيارات محددة للمعايير والتحديدات المطلوبة.",
          "المستخدم يختار المعايير ويحدد النطاق الزمني المطلوب.",
          "النظام يعالج المعلومات ويجمع البيانات المطلوبة.",
          "النظام يعرض التقارير في شكل رسومات بيانية وجداول.",
          "المستخدم يمكنه تخصيص وتصدير التقرير للمراجعة المستقلة."
        ],
        "business_rules": [
          {
            "id": "br_14",
            "rule": "يجب حماية التقارير بخصائص أمان لضمان عدم الوصول غير المصرح به."
          },
          {
            "id": "br_15",
            "rule": "التقارير يجب أن تعكس البيانات الواقعية بوقت فعلي."
          },
          {
            "id": "br_16",
            "rule": "كل تقرير يجب أن يحمل توقيع زمني فوري لضمان دقة الزمن."
          }
        ],
        "ui": [
          {
            "name": "شاشة تصميم التقارير",
            "description": "UI design for Reporting Dashboard: professional and modern design, including interactive chart options, filters, export buttons, and real-time data visualization capabilities.",
            "url": "https://brd-qi0f.onrender.com/static/ffe8c668a4254d17b4f589a51df82a99.png"
          }
        ],
        "diagrams": [
          {
            "name": "مخطط تسلسل تصميم التقارير",
            "description": "Sequence Diagram illustrating the user's interaction for selecting report parameters, generating data, and rendering output in visual format with options to export.",
            "url": "https://brd-qi0f.onrender.com/static/17c8880cc05944ed938c0c4c9c24cdb8.svg"
          }
        ]
      }
    ]
  }
}